import 'package:flutter/material.dart';
import 'package:jathakakatha/model/Tale.dart';

final _tale001 = Tale(
    id: 1,
    title: 'අපණ්ණක ජාතකය',
    story:
        "ශාක්‍ය කුල තිලක වූ පරදුක්ඛ දුක්ඛිතවූ කරුණා නිධාන වූ අසරණ සරණ වූ සමන්ත භද්‍ර වූ තිලෝගුරු සම්‍යක් සම්බුදුරජාණන් වහන්සේ මේ භද්‍ර කල්පයට සරාසංඛ්‍ය කල්ප ලක්ෂයකින් යට සාරමණ්ඩ නම් කල්පයෙහි තණ්හංකරය, මේධංකරය, සරණංකරය යි තුන් බූදුකෙණෙකුන් වහන්සේට ඉක්බිතිව උපන් තුන්ලොවට ඛේමංකර වූ මොහඳුරට දිවාකර වූ මුළු සතන්ට ශාන්තිකර වූ පින්වත්නට සිවංකර වූ මරසෙනඟට භයංකර වූ දිපංකර නම් සර්වඥයන් වහන්සේ බුදුව සියළු සත්වයන් අමා මහා නිවනින් දක්වමින් සුදසුන් විහාරයෙහි වාසය කරණ සමයෙහි රඹගම් නුවර වාසී මනුෂ්‍යයෝ සර්වඥයන් ප්‍රධානකොට භික‍ෂූ සංඝයා වහන්සේ පවරා සර්වඥයන් වඩනා මාර්ගය සරහන්නට වන්හ. එසමයට අප මහා බෝධිසත්වයෝ සුමේධ නම් තාපසව වාසය කරන්නාහූ මන්සකස්කොට තබන්නාවූ මනුෂ්‍යයන් දැක මේ මාර්ගය කුමකටද සරහවුදැයි විචාරා එපවත් දැන එසේ වී නම් මා සරහන නියායෙන් භූමි ප්‍රදේශයක් දෙවයි කීහ. එවිට මනුෂ්‍යයෝ දෙන්නාහු දැදුරුව දියබොර ඇති භුමි ප්‍රදේශයක් දි̈හ. ඒ භූමි ප්‍රදේශය සකස් කොට තනා නොනිමන තුරු සාර ලක්ෂයක් භික්ෂුන් වහන්සේ පිරිවරා ඒ දිපංකර නම් සර්වඥයන් වහන්සේ වැඩි සේක. ඒ සර්වඥයන් වහන්සේ දැක සුමේධ තාපසයෝ මඩ කළලෙහි අඳුන් දිවිසම් අතුට බුදු බව පතා වැදහොත්තාහ. සර්වඥයන් වහන්සේ ඒ තාපසයන්ගේ ඉස්දොර සිට මහා පුරුෂයා කුමක් සිතාවැදහොත්තේ දෝ හොයි දිවසින් බලා සිතු සිතුවිලි දැක මහණෙනි මේ පුරුෂ තෙම මෙතනට සාරාසංඛ කල්ප ලක්ෂයකින් මත්තේ ගෞතම නම් බුදුවෙතියි. විවරණ පතුල් දෙවා වදාල සේක. ඒ සුමේධ තාපසයෝත් ගාථාමාත්‍රයක් ඇසූ පමණින් නිවන් දකිනට හේතු සම්පත් ඇතිව තිබියදීත් ඒ හැර සංසාරයට වැද එතැන් පටන් දසපාරමිතාය, දස උප පාරමිතාය, දස පරමාර්ත පාරමිතාය, යන සම ත්‍රිංශත් පාරමිතා ධර්මයන් හා අංග පරිත්‍යාගය, ජීවිත පරිත්‍යාගය යනාදී වූ පඤ්ච මහා පරිත්‍යාගයන් හා ඉන් මෑත බුදු වූ කොණ්ඩඤ්ඤ දිවු තෙවිසි බුදුකෙනෙකුන් වහන්සේ අතින් ලබන ලද විවරණශ්‍රී ද ඇතිව වෙස්සන්තරාත්ම භාවයේ සිට සත් වරක් මහාපොළොව ගුගුරුවා මහ දන් දී එයින් චුතව, තුසිත බවනයෙහි ඉපිද, බොහො කාලයක් එහි වැස දස දහසක් සක්වල දිව්‍ය බ්‍රහ්මයන්ගේ ආරාධනාවෙන් පස් බැම් බලා ඇසල පුරු පසලස්වක් ලත් උතුරු ශල නැකතින් මාතෘ ගර්භයෙහි ප්‍රතිසන්දි ග්‍රහනය කොට දස එකඩ මසක් ඇවැමෙන් මාතෘ ගර්භයෙන් ප්‍රසූතව එකුන් තිස් අවුරුද්දක් රාජ්‍ය කොට තුන් පූර්ව නිමිත්ත දැක සසල කල කිරී සතර වෙනි දුටු මහන වේසය දැක ප්‍රවෘජ්ජාවෙහි ආලය ඇතිව එදා රාත්‍රියෙහි කන්ථක නම් අශ්වයා පිට නැගී දස දහසක් සක්වල දිව්‍ය බ්‍රහ්මයන් පිරිවරා අනෝමා නම් ගංතෙරදී මුහුලස කපා ආකාශයට දමා මහා බ්‍රහ්මයා විසින් දෙන ලද අශ්ට පරිශ්කාරධරා පැවිදිව සාඅවුරුද්දක් දුෂ්කර ක්‍රියාකොට අජපාල නිග්‍රෝධ මූලයෙහි සුජාතාවන් දුන් සීල පායාසය වළඳා සල් උයනෙහි දිවා විහාරය කොට සවස් වේලෙහි ජය මහා බෝධින් වහන්සේ කරා එමෙන් සිටි අතර මගදී සොත්තිය නම් බමුණෙකු දුන් කුස තණ අටමිටක් ගෙන ඇසතු බෝමුල් හි සලා ඉන් පැන නැංගා වූ තුදුස් රියන් වජ්‍රාසනාරූඩව මාර පරාජය කොට අළුයම් වෙලෙහි සියළු කෙලෙසුන් නසා බුදුව සත් සතියක් බෝධිද්‍රැම සමීපයෙහි දවස් යවා අටවන සතියෙහිදී මහා බ්‍රහ්මයාගේ ආරාධනාවෙන් බරණැස් නුවර ඉසිපතන නම් විහාරයේදී පස්වග මහනුන් වහන්සේ ප්‍රධාන කොට ඇති බොහෝ දිව්‍ය බ්‍රහ්මයන්ට දම්සක් පැවතුම් සූත්‍ර දේශනාව කොට බොහෝ සත්වයන් අමා මහා නිවන් දක්වා එතැන් පටන් වෛනෛය ජනයන් සංසාර සාගරයෙන් ගොඩනගා වාසය කරන සේක් ඒ ඒ මනුෂ්‍යයන් හා ඒ ඒ භික්ෂු භික්ෂූනියන්ගේ හා නෙයෙක් ආපත්ති හා නොයෙක් දෘෂ්ඨාංත වලට හා නොයෙක් කතාන්තර වලට හා මෙකි දෙයෙහි සංඛා දුරු කරන පිණිස දිව්‍ය බ්‍රහ්ම මනුෂාදීන්ට පිං පිණිස වදාරණ ලද පන්සිය පණස් ජාතකඑළුවෙන් දක්වන්ට උවමනැයි කියා පරාක්‍රම නම් ඇමති සත් පුරුෂයාගේ ආරාධනාවෙන් හා වීරසිංහ ප්‍රතිරාජ නම් අමාත්‍යයෝත්තමයාගේ උත්සාහයෙන් ද අටුවාසාමින්ලි ජාතක නියාව නොවරදවා එළුවෙන් ලියු ජාතක කථාව සත් පුරුෂ වූ මනුෂ්‍යා විසින් කන්යොමා සිත් එළා ඇසිය යුතු \n\nහේ කෙසේ ද යත්\n\nභාග්‍යවත් වූ තිලෝගුරු සම්‍යක් සම්බුදුරජාණන් වහන්සේ ජේතවන මහා විහාරයෙහි දිව්‍ය බ්‍රහ්ම ආර්ය ඊයාර්යපථ සංඛ්‍යාත විහරණයන් අතුරෙන් එක්තරා විහරණයකින් දවස් යවන සේක් අනේපිඩු මහා සිටානන්ගේ යහළු වූ පන්සියයක් තීර්තක ශ්‍රාවකයන් අරභයා මේ අපණ්නක ජාතක ධර්ම දේශනාව වදාල සේක. එක් දවසක් අනේපිඩු මහා සිටානෝ තමන්ගේ යහළු වූ පන්සියයක් තීර්තක ශ්‍රාවකයන් කැඳවාගෙන බොහෝ ගධ දුම් මල්පහන් හා ගිතෙල් මී උක් සකුරු හා සිවුරු පිළි ආදීය ගෙන්වාගෙන ජේතවනයට ගොස් බුදුරජානන් වහන්සේට නමස්කාර කොට මල් සුවඳ ආදීයෙන් පූජා කොට ගිතෙල් ආදී වූ ඛෙහෙත් බඩු හා සිවුරු පිළිද භික්ෂු සංඝයා වහන්සේට පිළිගන්වා නපච්චතෝන පූරතෝ යනාදී සය වැදෑරුම් වූ මිසත්‍ය දෝෂ දුරු කොට එකත් පස්වහුන්නාහුය. ඒ අන්‍ය තීර්තක ශ්‍රාවකයෝ බුදුන්ට නමස්කාර කොට බුදුන්ගේ පුන් සඳ මඩලක් බඳු වූ සශ්‍රික මුඛය හා දෙතිස් මහා පුරුෂ ලක්ෂණ අසිත්‍යාණු ව්‍යජන ඛ්‍යාම ප්‍රභා කේතු මාලා ලංකාරයෙන් විරජමාන වූ බ්‍රහ්ම ශරීර හා කරකැවි යුවල යුවල නික්මෙන්නා වූ ඝන බුද්ධ රශ්මී බල බලා අනේපිඩු මහා සිටානන් සමීපයෙහි උන්නාහුය.එකල්හි ඔවුන්ට බුදුහු රත් ගල් තලාවක හිඳ සිංහ නාද කරන්නා වූ අභිත කේෂර සිංහ රාජයෙක් මෙන්ද මේඝ කාලයෙහි මහා වර්ෂාවක් වස්නා කලක් මෙන්ද ආකාශ ගංගාවක් බානා කලක් මෙන්ද රුවන් දමක් ගොතන්නාහූ මෙන් ද අශ්ඨාංගයෙන් සමන්විත වූ ශ්‍රවණීය වූ මනෝඥ වූ බ්‍රහ්ම ස්වරයෙන් නානානය නිපුණ විචිත්‍ර වූ මදුර වූ ධර්ම දේශනාවකට වදාල සේක. ඒ තීර්තක ශ්‍රාවකයෝ බුදුන්ගේ ධර්මය අසා ප්‍රසන්න වූ සිත් ඇතිව නැගී සිට දස බලදාරී වූ බුදුන්ට නමස්කාර කොට තීර්තක ලබ්දිය හැර බුදුන්ගේ සරණ ගියහ. ඔහු එතැන් පටන් ඇමකලම අනේපිඩු මහ සිටානන් හා සමග සුවඳ මල් ආදිය ගෙන විහාරයට ගොස් බණ අසති. දන් දෙති. සිල් රක්ෂා කෙරෙති. පෙහෙවස් වෙසෙති. ඉක්බිත්තෙන් බුදූහූ සැවැත් නුවරින් රජගහ නුවරට වැඩි සේක. එකල්හි ඒ තීර්තක ශ්‍රාවකයෝ බුදුන් රජගහ නුවරට වැඩි කල්හි බුදුන්ගේ සරණය හැර නැවත අන්‍ය තීර්තකයන්ගේ සරණ ගෙන තමන්ගේ මුල සරණයේහිම පිහිටියාහ. බුදුරජාණන් වහන්සේගේත් සත් අටමසක් කල් ගෙවා යවා නැවත ජේතවනයට වැඩි සේක. අනේ පිඩු මහ සිටානෝත් නැවත ඔවුන් කැඳවාගෙන බුදුන් සමීපයට ගොස් වැඳ සුවඳ මල් ආදීයෙන් පූජා කොට බුදුන්ට නමස්කාර කොට එකත් පස්ව උන්නාහුය. ඒ තීර්තක ශ්‍රාවකයෝත් බුදුන් වැඳ එකත්පස්ව හුන්නාහුය. එකල්හි ඔවුන් බුදුරජානන් වහන්සේ සැරි සරා වැඩි කල්හි ගන්නා ලද සරණ හැර නැවත අන්‍ය තිර්තකයන්ගේ සරණ ගැන මුලස්ථානයෙහි පිහිටි බව අනේපිඩු මහ සිටානෝ බුදුන්ට දැන්වූහ. එකල්හි සර්වඥයන් වහන්සේ ප්‍රමාණාතික්‍රාන්ත වූ කාලයෙහි අතරක් නැති කොට පවත්වන ලද වාක් සුචරිතානු භාවයෙන් දිව සුවඳින් සුවඳ කැවු නොයෙක් සුවඳින් පිරුණු රුවන් කරඬුවක් හරින කලක් පරිද්දෙන් මුඛ පත්මය විවෘත කොටමදුර ස්වර විහිදුවමින් සැබෑද උපාසකවරුණි. තොපි රත්නත්‍රයෙහි සරණ හැර අන්‍ය තීර්තකයන්ගේත් සරණගියෙදැයි විචාරා වදාල සේක. එකල්හි තමන් කල කාර්ය හඟ වන්නට අසමර්ථ වූ ඔවුන් විසින් සැබැව ස්වාමිනි. බුදුහු උපාසකවරුන්ට ආමන්ත්‍රණය කොට එම්භා උපාසක වරුණි. යටින් අවිචිය හා මත්තෙන් භවාග්‍රය කෙළවරකොට සරසින් අනන්තාපරිමාන සක්වලහෙි සීල සමාධි ප්‍රඥා වූ ගුණයෙන් බුදුන් හා සමකෙනෙක් නැත. බුදුන්ට වඩනා කෙණෙක්ම නැත. මෙසේ උත්තම ගුණයෙන් සමන්විත වූ රත්නත්‍රය සරණ ගිය උපාසක කෙනෙක් වේවායි උපාසිකා කෙනෙක් වේවායි නරකාදී වූ සතර අපායෙහි උපදිනාහු නොවෙති. අපායොත්පත්තියෙන් මිදි දිව්‍යලෝකයෙහි ඉපිද මහා සම්පත් අනුභව කෙරෙති. එසේ හෙයින් තොපි ඇම දෙනා මෙබඳු සරණ හැර අන්‍යතීර්තකයන්ගේ සරණ යන්නවුන් විසින් කල සේ නපුරැයි වදාලසේක. තවද උපාසක වරුනි බුද්ධානුස්මෘති, ධර්මානුස්මෘති, සංඝානුස්මෘති කර්මස්ථාන එනම් ශෝතාපත්ති ඵලය දෙන්නේය. සකෘද්ධාගාමී මාර්ගය හා සකෘද්ධාගාමී ඵළය දෙන්නේය. අනාගාමි මාර්ගය හා අනාගාමි ඵලය දෙන්නේය. අරහත් මාර්ගය හා අරහත්ඵළය දෙන්නේ යැයි මේ ආදි වූ කාරණයෙනුත් ධර්ම දේශනා කොට මෙබඳු රත්නතරය සරණ බිඳපු තොප විසින් නොකල මනා දෙයක් කරණ ලදැයි වදාල සේක. මෙසේ භාග්‍යවත් වූ තිලෝගුරු බුදුරජානන් වහන්සේ අනේකප්‍රාකාරයෙන් උපාසක වරුන්ට අවවාද කොට උපාසකවැරනි පළමුත් මනුෂ්‍යයෝ අසරණය සරණයයි විරූඩග්‍රහනය ගෙන අමුනුශ්‍යයෝ පරිගෘහිත වූ කාන්තාරයෙහි යක්ෂයන්ට ගොදුරුව මහා විනාශයට පැමිණියෝය. සරණ යෑම සරණයයි ඒකාන්ත කොට අවිරූඩ ග්‍රහණය ගත්තා වූ මනුෂ්‍යයෝ ඒකාන්තාරයෙහි ස්වාසස්ථානයට පැමිණියෝ වේදැයි වදාරා මුවෙන් නොබැන වැඩ උන් සේක. එකල්හි අනේපිඩු මහා සිටානෝ හුනස්නෙන් නැගීසිට බුදුන්ට වැඳ ස්තූති කොට දොහොත් මුදුනෙහි තබා ස්වාමීනි දැන් වූ කලි මේ උපාසක වරුන්ගේ උතුම් වූ රත්නත්‍රය සරණ හැර විරුඩ ග්‍රහණය අපට ප්‍රකාශය. පූර්වෙහි යක්ෂාදි ගෘහිත වූ කාන්තාර මාර්ගයෙහි විරූඩග්‍රාහින්ගේ විනාශය හා අවිරූඩ ග්‍රහිතව වූ මනුෂ්‍යයන් ස්වාසස්ථානයට පැමිණි බව අපට සැබවී තිඛෙන්නේය. නුඹවහන්සේටම ප්‍රකාශය. ස්වාමීනී යාඤ්ඤා කරම්හ. පින්වත් වූ සර්වඥයන් වහන්ස. ආකාශයෙහි පුන් සඳ මඩල නගා පානා කලක් මෙන් මේ කාරණය ප්‍රකාශ කොට වදාල මැනවයි ආරාධනා කළාහුය. ඉක්බිත්තෙන් බුදුහු මා විසින් සිටානෙනි අප්‍රමාණ කාලයක් මුළුල්ලෙහි දස පාරමිතාවන් පුරා ලෝක වාසීන්ගේ සැක දුරු කරන පිණිසම සර්වඥතා ඥානය ප්‍රතිවේදය කරන ලද්දේය. සිංහ තෛලයෙන් රන් නලක් පුරවන්නාක් මෙන් සකස් කොට කන්නමා අසවයි සිටානන්ට සිහි උපදවා හිම ගර්භයක් පලා පුන් සඳ මඩල පිටත් කොට පාන්නක් මෙන් භවාන්තරයෙන් සැඟ වූනාවූ කාරණය ප්‍රකාශ කොට වදාල සේක.\n\n\nයටගිය දවස කසීරට බරණැස් නුවර බ්‍රහ්මදත්ත නම් රජ්ජුරු කෙනෙක් සතර සංග්‍රහ වස්තුවෙන් ජනරංජනය කොට රාජ්‍ය කරන්නාහුය. එසමයෙහි පුරණ ලද බෝධි සංබාර ඇති අප මහා බෝසතානෝ සාන්තු නායක කුලයක පිළිසිඳ ගෙන ක්‍රමයෙන් වැඩිවිය පැමිණ පන්සියයක් ගැලින් වෙළඳාම් කොට ඇවිදිනාහුය. ඒ බෝධිසත්වයෝ කලෙක නැගෙනහිරින් බස්නාහිරට යෙති. කලෙක බස්නාහිරන් නැගෙනහිරට යෙති. එකල බරණැස් නුවර අනෙකුත් ශාන්තු නායක පුත්‍රයෙක් විය. ඒ තම අඥාණය අව්‍යක්කතය. උපායෙහි දක්ෂ නොවෙයි. එසමයෙහි බෝධිසත්වයෝ බරණැස් නුවරින් මහඟි වූ බඩු ගෙන පන්සියයක් ගැල් පුරා ගමන සරහා සිටු වූහ. ඒ නුවනැති සාන්තුනායක පුත්‍රද එසේම පන්සියයක් ගැල් බඩු පුරා ගමනට සරහා සිටුවූයේය. බෝධි සත්වයෝ ඉදින් මේ නුවණ නැතිශාන්තු නායක පුත්‍ර තෙමෙ මා හා සමඟ යේනැම් ගැල් දහසක් එක් මග යන්ට පටන්ගත් කල මග නොසෑහෙන්නේය. මනුශ්‍යයන්ට දර පැන් හා සරකට තන නොලැබ හැක්කේය. මොහුවත් මාවත් පළමු කොට යාම කටයුතු යයි සිතා බෝධි සත්වයෝ ඒ අඥාණ වූ සාන්තු නායකයා කැඳවා මෙපවත් කියා අප දෙදෙනා එක්ව යන්ට නොපිළිවෙන. කිමෙක්ද තෙපි ඉදිරියෙහි යව්ද?. නොහොත් පස්සෙයි යව්ද යි විචාලෝය. එවේලෙහිම හෙතම මෙසේ සිතී තමා ඉදිරියේ යන්ට වන් කල්හි බොහෝ අනුසස් වන්නේය. ගැල් සකීන් නුබුන් මගින් යෙමෙන් ගැල් අදිනා ගොන් පළමු සරක් නොකෑ තන කති. මනුශ්‍යයන්ට පළමු කිසි කෙණෙකුන් විසින් නොකැඩූ පළාකොලවන් වන්නේය. ප්‍රසන්න වූ පැන් වන්නේය. කැමති පරිද්දෙන් අගය තබා ගෙන බඩු විකුණමියි සිතා හෙතම මම යහළුව පළමුකොට යෙමියි කීහ. බෝධි සත්වයෝත් පස්සෙහි යාමෙහි බොහෝ අනුසස් දැක මෙසේ සිතූය. ඉදිරියෙහි යන්නාවූ සත්වයෝ මග විසම තැන සම කෙරෙති. මම ඔහුන් ගිය මගින් යෙමි. පෙරත් දුව ගිය ගොන් මුහුකුරා තදව ගිය තණ කති යි මාගේ ගොන් නැවත අට ගත් මිහිරි වු ලා තණ අනුභව කෙරෙති. පළමු පලා පල කඩා නැවත අට ගත් මිහිරි වූ ලාතන අනුභව කෙරෙති. පළමු පලා කොල කඩා ගත් තැනින් නැගී දළු පලා මනුශ්‍යන්ට මිහිරිවන්නේය. පළමු පැන් නැති තැන වලකැන පැන් උපදවති. මොහුන් කැනවූ වල වලින් අපි පැන් බොම්හ. පළමු කොට අගය තිබියේ නම් මනුශ්‍යයන්ගේ දිවි ගැලවූ වාක් වැන්නේය. මම පස්සෙහි ගොස් මොවුන් විසින් තුබූ අගයෙන් බඩු විකුණම් යැයි ඒ මහා බෝසතානෝ මෙතෙක් අනුහස් දැක යහළුව තෙපි පළමු කොට යව් වයි කීවාහුය. එකල්හි නුවණ නැති ශාන්තු නායක යහපත යහළු යැයි කියා ගැල් යොදා ගෙන නික්මයති. ක්‍රමයෙන් මනුෂ්‍ය වාසය ඉක්ම කාන්තාර මුඛයට පැමිණියේය. හෙතම පළමුව හැම කල්හි මහසැල තබ්බවා පැන් පුරවා සැට යොදුන් කාන්තාර මාර්ගයෙහි ගමන් ගත්තේය.\n\nඉක්බිත්තෙන් ඔහු කාන්තාර මධ්‍යයට පැමිණි කල්හි එහි අදිගෘහිත යක්ෂයෙක් මේ මනුෂ්‍යන් ගෙන යන පැන් දම්මවා පියා දුරුවල කොට සියල්ලවුන් කමියි සිතා සර්වාංගයෙන් දවල වූ ඇලි ගොන් දෙන්නෙකු යොදන ලද සිත්කළු යානාවක් මවාගෙන දුණු හිය උරු පළඟ ආයධ ගත් අත් ඇතිව අමුනුෂ්‍යයන් දස දොලොස් දෙනෙකු පිරිවරා ගෙන ඇඹුල උපුල මල් පැළඳ නෙත් තෙත් ඉසකේ හා නෙත්පිලි ඇතිව නායක පුරුෂයෙකු මෙන් ඒ රතයේ ඉඳ මඩ වැකි ගියාවූ රථයකින් යුක්තව පෙරමගට ගියේය. ඔහුගේ පිරිවර අමුනශ්‍යයෝද ඉදිරියේ පස්සේ වන්නාහූ තෙත් ඉසකේ හා තෙත් පිළි ඇතිව ඇඹුල උපුල මල් පැළඳ රත් පියුම් හෙල පියුම් මිටි ගෙන නෙළුම් අල සහ නෙළුබුදැලි කමින් පැන් බින්දු හා මඩ බින්දු වගුරමින් නික්මුනාහුය. යක්ෂයා ඉදිරියේ එන්නාවූ සාන්තු නායකයා දැක තමාගේ යනාව මගින් පහකොට කොයි යව්දැයි යනාදීන් ඔහු හා සමග සුවදව කතා කලේය. සාන්තු නායකයාද තමාගේ යානාව මගින් ඉවත් කොට සෙසෙු ගැල් යන්ට මග අවසර හැර එකත්පස්ව සිට ඒ යක්ෂයාට මෙසේ කීය. අපි වූ කලී බරණැස් නුවර සිට ආම්හ. තෙපි හැම දෙන ඇඹුල උපුළ මල් පැලඳ රත් පියුම් හෙල පියුම් ගත් අත් ඇතිව නෙළුබල හා නෙළුඹුදැලි කමින් සකල ශරීරයෙහි මඩ වකාගෙන පිනි බින්දු වගුරවා කොයි සිට අවුදැයි තොපි එන මග වැසි වටද ඇඹුල උපුල මල් ආදීයෙන් ගැවසීගත් විල් ඇද්දැයි විචාලේය. යක්ෂයා ඔහුගේ බස් අසා යහළුව තෝ කුමක් කියයිද තෙල පෙනෙන්නේ නිල් වූ වනරේඛාවය. එතැන් පටන් සියළු වනය පැනින් ගැවසී ගත්තේය. නිඹඳ වැසි වස්නේය. කඳු රුලි පුරා දිය දුවන්නේය. ඒ ඒ තැන පියුමින් ගැවසී ගත් විල් හා පොකුණු වන්නේයැයි කියා පිළිවෙලින් යන්නාවූ ගැල් වල මනුශ්‍යයන් අතින් මේ ගැල් අරගෙන කොයි යව්දැයි විචාලේය. එකල්හි ඒ මනුශ්‍යයෝ අසවල් ජනපදයට යම්හයි කීහ. මේ මේ ගැල කිනම් බඩු දැයි විචාලේය. අසවල් බඩු යැයි කීහ. පස්සේ එන්නා වූ ගැල් ඉතා බරව එන්නේය. ඒ ගැල් වලකුමන බඩුදැයි විචාලේය. පැන් පිරු ගැල යයි කීහ. පළමු මෙතන දක්වා පැන් ගෙන ආ තොප විසින් කලසේ ඉතායහපත් වන්නේය. මෙතැන් පටන් තොප ගෙන යන පැනින් ප්‍රයෝජන නැත. ඉදිරියේ බොහෝ පැන් ඇත. පැන්සැලවල් බිඳ පැන් දමා පියා සැපසේ යවයි කීයේය. මෙසේ කියා තොපි යව අපට ලස් වන්නේයැයි කියා මද තැනක් ගොස් අන්තර් දානව තමාගේ යක්ෂ පුරයට ගියේය. ඒ අඥ්ඤාණ වූ ශාන්තු නායකයාද තමා නුවණ නැති බැවින් යක්ෂයාගේ බස් ගෙන සැලවල් බිඳුවා පැන් උලක්කුවක් විවරකුත් නොතබා සියළු පැන් දම්මවා ගැල් පමණක් පදවාගෙන නික්මුනේය. ඉදිරියේ ස්වල්ප මාත්‍රයකුත් පැන් නොවිය. මනුෂ්‍යයෝ පැන් නොලැබ මිරිකී ගියාහු සවස්වන තුරු ගොස් ගැල් වලල්ලෙහි සිටුවා ගොන් ගැල් සක බැඳ සිටවූය. සරකුන්ට බොන්නටවත් මනුෂ්‍යන්ට බත් පිසන්නටවත් පැනක් නැති විය. පැන් නොළැබ මිරිකී ගියාහු මනුෂ්‍යයෝ ඒ ඒ තැන වැදහෙව නිදන්නට පටන්ගත්තාහුය. රාත්‍රි භාගයෙහි යක්ෂයෝ යක්ෂ පුරයෙන් අවුත් සරක් හා මනුෂ්‍යන් මරා මස් අනුභවකොට ඇට පමණක් තබා ගියාහුය. මෙසේ ඒ නුවණ නැති සාන්තු නායකයා නිසා සියළු සත්වයෝ විනාශයට පැමිණියාහුය. අත් ඇට ආදීය ඒ ඒ අත විසිරි ගියේය. පන්සියයක් ගැල් බඩු පිරුවනින්ම තිබුයේය.\n\nමහා බෝධිසත්වයෝද නුවණ නැති ශාන්තු නායකයා යෙල මසක් ඉක්මවා පන්සියක් ගැල්වල බඩු පටවාගෙන නුවරින් නික්ම ක්‍රමයෙන් පැන් නැති අමුනුෂ්‍ය වාසය වූ කාන්තාර මුඛයට පැමිණියෝය. මෙසේ පැමිණියා වූ මහා බෝධිසත්වයෝ එතැන්හිදි මහා සැල වල පැන් පුරවා බොහෝ පැන් ගෙන තමන් කැටිව යන මිනුසුන් කැඳවා කඳවුරු බැඳගෙන උන් තැන ඛෙර පියවි කරවා මනුෂයන් රැස් කොට මෙසේ කිවුය. මා නොවිචාරා පැන් පතක් විවරකුත් ප්‍රයෝජන නොවිඳුව මේ කතර මඟ විස වෘක්ෂයෝ ඇත. ඒහෙයින් පෙර නොකැ විරු පළාකොලත් මලක් පළාපලයක්ම මා නොවිචාරා නොකවයි. මෙසේ මනුෂ්‍යයන්ට අවවාද කොට බඩු පැටවූ පන්සියයක් ගැල් හා සමග අමුනුෂ්‍යාදි ගෘහිත නිරුදක කාන්තාරයට පැමිණියෝය. ඒ මහා බෝ සතානෝ කාන්තාර මධ්‍යයට පැමිණ කල්හි ඒ යක්ෂ තෙම පළමු පරිද්දෙන්ම බෝධි සත්වයන් එන පෙරමග තමා දක්වා සිටියේය. බෝධි සත්වයෝ ඔහු දැකලාම දැනගත්තුය. මේ කාන්තාරයෙහි පැන් නැති හෙයින් නිරුදක කාන්තාර යැයි මේ කාන්තාරයට නමක් වන්නේය. මේ තෙම නිර්භිතය. රත් වූ ඇස් ඇත්තේය. මොහුගේ ඡායාවත් නොපෙනෙන්නේය. ඒකාන්තයෙන්ම මොහු විසින් පළමු කොට බිය නුවණැති සාන්තු නායකයා ඔහුගේ පිරිසත් සමඟ ගැල් වල පිරවු පැන් දම්මවා කලාන්ත කොට කන ලද්දේ වන්නේය. මා ගේ වූ කලි නුවණැති බව හා උපායෙහි දක්ෂ බව මොහු නොදනිතියි සිතමි සිතා ඉක්බිත්තෙන් ́ හට මෙසේ කීවුහ. තෙපි හැම දෙන පළා යව්. අපි හැම වෙළඳුන් නම් අනිත් තැනක් නොදැක ඇරගත් පැන් නොදම්හ. පැන් දුටු තැනකදී පැන් දමා පියා ගැල් සැහැල් ̈ කොට ගෙන යම් යැවි කිවුහ. යක්ෂයා මඳ තැනක් ගොස් අන්තර්දානව තමාගේ යක්ෂ පුරයටම ගියේය. යක්ෂයා ගිය කල්හි මනුෂ්‍යයෝ බෝධිසත්වයන්ට මෙසේ කිවුහ. මේ සාමිනී මනුෂ්‍යයෝ මේ නිල් වූ වන රේඛාව පෙනෙන්නේය. එතැන් පටන් නිබඳවැසි වස්නේයැයි කියා ඇඹුල උපුල මල් පැළඳ රත් පියුම් හෙල පියුම් මිටිගෙන නෙළුඹල හා නෙළුඹ දැලි කමින්තෙත් පිළි හැඳ තෙත් වූ හිසකේ හැරගෙන ආවාහුය. එසේ හෙයින් අප හැම ගෙන යන පැන් දමා පියා ගැල් සැහැල් ̈ කොට ගෙන වහා පලායම්හයි කිවුහ.\n\nබෝධි සත්වයෝ ඒ මිනිස්සුන්ගේ කී බස් අසා ගැල් රඳවලා සියළු මනුෂ්‍යයන් රැස් කොට තොප විසින් මේ කාන්තාර මාර්ගයෙහි විලෙක්වත් පොකුණෙක්වත් ඇතැයි කිසි කෙනෙකුගෙන් ඇසූ විරු ඇද්දැයි විචාලෝය. ස්වාමීනි ඇසූ විරූ නැත. මේ තම නිරුද්දක කාන්තාරය වේද. ඒ මනුෂ්‍යයෝ කිහුය. එකල්හි බෝධි සත්වයෝ කියන්නාහු මේ අප දුටු මනුෂ්‍යයන්ගෙන් සමහර කෙණෙක් නිල් වූ වන රොදින් එපිටවැසි වස්නේ යැයි කියුය. වැසි සුළඟ නම් කෙතෙක් තැන් හමාදැයි විචාලෝය. ස්වාමීනි යොදුනක් පමණ තැන් හමන්නේ වේදැයි කිවුය. කිමෙක්ද තොප හැම දෙනා අතුරින් එක් කෙනෙකුගෙන් ඇඟ වැසි සුළගක් වැදගත් දැයි විචාලෝය. නැත ස්වාමීනි කිහ. මේඝ ශර්ස නම් කොපමණකදී පෙනේදැයි විචාලෝය. යොදුනක් පමණ තැන්පටන් පෙනෙන්නේ වේද ස්වාමීනි කීයුය. තොප හැමගේ කිසි කෙනෙකුන් විසිනුත් එකල වැසි වලා කුලකුත් දුටුවේ ඇද්දැයි විචාලෝය. නැත ස්වාමීනි කීහ. විදුලියෙන් නම් කෙතැන් පටන් පෙනේදැයි විචාලෝය. සතර පස්යොදුනක් පසන් පෙනෙන්නේ වේද. ස්වාමිනි කිවුහ. තොප ඇම දෙනාගේන් කිසි කෙනෙකුන් විසින් විදුලි ආලෝකයක් දක්නා ලද්දේදැයි විචාලෝය. නැත ස්වාමීනි. විදුලි ආලෝකයක් නොදුටුම්හයි කීහ. මේඝ දවනිය නම්කොතෙක් තැන් පටන් ඇසේ දැයි විචාලෝය. එක් යොදුනක් මත්තේ පටන් ඇසෙන්නේ වේදැයි ස්වාමිනි කීයුහ. කිමෙක්ද තොප හැම දෙනාගෙන් කිසි කෙනෙකුන් විසින් විදුලි ආලෝකයක් වැසි ඝර්ජනාවක් කරන්නා ඇසූ අුැද්දැයි විචාලෝය. නැත ස්වාමිනි අකුණු ගසන හඬක් නොඇසුම් යැයි කීහ. එකල්හි අප මහ බෝ සතානෝ කියන්නාවු එම්බා පින්වන්ති මොහු මනුෂ්‍යයෝ නොවෙතියි, යක්ෂයෝය. මොහු අප හැම ගෙන යන පැන් දම්මවාපියා දුර්වල කොට කම්හයි ආවාහු යක්ෂ කෙණෙක් වෙති. ඉදිරියේ ගිය නුවනැති ශාන්තු නායක පුත්‍රයා උපාය දැක්මෙහි අදක්ෂය. ඒ කාන්තයෙන්ම එතෙම මොහු විසින් පැන් දම්මවා මිරිකා දුර්වල කොට කන ලද්දේ වන්නේය. පන්සියයක් ගැල් බඩු පිරුවනින්ම තිඛෙන්නේ වේදැයි අපි එම බඩු පිරු ගැල් දැකුම්හ. එසේ හෙයින් පැන් උලක්කුවක් විවරකුත් නොදමා වහ වහා ගැල් පදුවයි කියා ගැල් පදවාගෙන නික්මුනාහුය.\n\nමහා බෝධි සත්වයෝ යමෙන් සිට බඩු පිරුවනින්ම තිබු ගැල් දැක පන්සියයක් ගැල් හා ගොන් හා මිනිසුන්ගේ අත් පා ඇට ආදිය ඒ ඒ තැන විසිර තිබුවා දැක ගැල් මුදවා ගැල් වලල්ලෙන් කඳවුරු බඳවා වේලාසනම මනුෂ්‍යයන් හා ගොන්ද බත් හා තන කවා මනුෂ්‍යයන් මධ්‍යය යේ ගෙරි කැට කොට වැදහොවා තුමු සත්ති සම්පන්න ප්‍රධාන පුරුෂයන් ගැන කඩු ගත් අත් ඇතිව තුන් යම් රාත්‍රියෙහි රැකවල් ගෙන සිටිසේ සිටම අරුණ නැගුය. දෙවන දවස් උදෑසනම සියළු කටයුතු සපයාගෙන ගොන් තණ ආදීය කවා ගෙන මාළු ගැල් දමා තර ගැල් ගෙන මඳ මිඳ ඇතිබඩු දම්මවා බොහෝ මිල ඇති බඩු නංවාගෙන මහා බෝ සතානෝ තමන් වෙළදාම් කරන්නට යන්ට සිතුනෙතටම ගොස් දියුණු තියුණු මිලයෙන් බඩු විකුට සියළු පිරිස ගෙන නැවත තමන්ගේ නුවරටම ආවාහුය.\n\n\nසාස්තෘ වූ තිලෝගුරු බුදුරජාණන් වහන්සේ මේ කතාව ගෙන හැර දක්වා වදාරා මහා සිටානෙනි මෙසේ පෙර විරුඩ ග්‍රාහය ගත්තෝ මහා විනාසයට පැමිණියෝය. අවිරුඩ ග්‍රාහය ගත්තෝ නුවණැත්තෝ අමුනුෂ්‍යයන් අතින් මිඳි සැපසේ කැමති තැනට අභිමතාර්ථය සිද්ධ කොට ගෙන පෙරලා තමන් වසන නෙතට පැමිණියෝ වේදැයි පූර්වාපර සන්ධි ගැලපීම් වශයෙන් අතීත කථාවත් වර්ථමාන කථාවත් වදාරා මත්තෙහි අපණ්ණක ජාතක ධර්ම දේශනාව කොට වදාරණ සේක.\n\nඅපණ්තකං ඨානමේකේ දුතියං ආහු තක්ඛිකා\nඒත දංඥාය මේ දාවි තංගණේය යදපන්ථකංමේ\n\nගාථාව වදාලසේක. මෙහි අපණ්තක පටිපදාව නම් රත්නතත්‍රය සරණ යාම, පංච ශීලය හා දස සීලය රක්ෂා කිරීම, ප්‍රාතිමෝක්ෂ සංවර ශිලය, ඉන්ද්‍රිය සංවර ශීලය, ආජිව පාරිශුද්ධි ශීලය, ප්‍රත්‍ය සන්ති සීත ශිලය යන සියළුම සිල් පිරිසිදුව සිල් නොකිලිටි කොට රැකීමය. චක්ශරාධි පංචේන්ද්‍රයන් වසඟ කොට වසන බවය. භෝජනයෙහි පමණ දක්නා බව නිදි වර්ජිත කිරීමය. පංච විද ධ්‍යානය ඉපිද වීමය. විදර්ශනා භාවනා කිරීමය. පංචාභිඥාණ අෂ්ටසමාපත්ති ඉපිදවීමය. ස්ව්ත ආපත්තාදීහු සතර ආර්ය මාර්ගය හා සතර ආර්ය ඵලය ඉපදවීම යන මේ සියල්ල අපණ්තක පටිපදා නම් වේ. නිර්වාණ ග්‍රාමී වු ප්‍රතිපත්තිය නම් වෙයි. සර්වඥ ශාසනයට අවිරූඩ ප්‍රතිපත්තිය නම්වෙයි. මේ අපණ්තක පටිපදා යන අන්‍ය ලබ්දි ගැන්මය දස අකුසල කර්මයෙහි හැසිරීම නුසුදුසු වූ කාය වාක්සමාදාරියෙහි යෙදීමය. යන මේ සියල්ල වන්නේය. මේ විරුඩ ප්‍රතිපදාව සතර අපායෙහි හා පංච විද නිච කුලයෙහි උපදවා මහා දුක් දෙන්නේය. තවද මේ අවිරූඩ වූ ඒ කාන්ත කාරණ වූ මේ අවිරූඩ ප්‍රතිපත්තියෙහිම සිට සර්වඥයෝ දෘඩ විර්යෙන් පාරමිතාවන් පුරා බෝධි ද්‍රම සමීපයෙහි ඉඳ සම්‍යක් සම්බෝධි ඥාණය සමාධිගමය කරන්නාහුය. පසේ බුදුවරයෝ ඉඳ සම්‍යයක් සම්බෝධි ඥාණය සමාධි ගමය කරන්නාහුය. පසේ බුදුවරයෝ ප්‍රත්‍යොක් බෝධි ඥාණය සමගි ගමනය කෙරෙති. බුද්ධ පුත්‍ර වූ ශ්‍රාවකයෝ ශ්‍රවක පාරමිතා ඥාණය ප්‍රතිවේද කෙරෙති. මෙසේ භාග්‍යවත් වූ බුදුරජාණන් වහන්සේ ඒ උපාසක වරුන්ට ත්‍රිවිධ කුසල සම්පත්තීන් හා දිව්‍ය බ්‍රහ්ම සම්පත්තීන් දක්වා කෙලවර මේ අපණ්තක පටිපදාව අර්හත් මාර්ගයට පමුණුවා නිර්වාණ සම්පත්තිය සාදාදීලන්නේ යැයි කියා අනේ පිඩු මහා සිටානන්ගේ ප්‍රධාන කොට ඇති පන්සියයක් උපාසක වරුන්ට මේ අපණ්තක ධර්ම දේශනාව දක්වා මත්තෙහි චතුරාර්ය සත්‍යය සොලොස් ආකාරයකින් ප්‍රකාශ කොට වදාල සේක. මේ චතුස් සත්‍යය ධර්ම දේශනාවගේ කෙළවර ඒ සියළු පන්සියයක් උපාසකවරු යෙළ දහසක් කෙළසුන් නසා දහසක්නයින් ප්‍රතිමණ්ඩිත වූ සෝවාන් ඵලයෙහි පිහිටියාහුය. බුදුරජාණන් වහන්සේ මේ ධර්ම දේශනාව ගෙන හැරදක්වා වදාරා මේ අපණ්තක ජාතකය නිමවා වදාලසේක. එසමයෙහි අඥ්ඥාණ වූ සාන්තු නායක පුත්‍ර නම් දැන්මේ දේවදත්ත ස්ථවිරයේය. ඔහුගේ පෂීද නම් මේ දේවදත්ත පර්ෂිද වන්නේය. එසමයෙහි නුවණැති සාන්තුනායකයාගේ පර්ෂිද නම් දැන් බුදු පිරිස් වන්නාහුය. එසමයෙහි නුවණැති සාන්තු නායක පුත්‍ර නම් තිලෝගුරුසම්‍යයක් සම්බුදු රජු වූ මම ම වේදැයි තමන් වහන්සේ දක්වා වදාල සේක",
    image: 'assets/stories/s001.jpg',
    tags: ['Apannaka', 'Apanaka', 'අපණ්ණක', 'අපන්නක', '1']);

final _tale002 = Tale(
    id: 2,
    title: 'වණ්ණුපත ජාතකය',
    story:
        "තවද එක් සමයෙක්හි බුදුහු දෙව්රම් වෙහෙර වැඩ වසන සේක් භාවනා කිරීමෙහි හරණ ලද වීර්යය ඇති භික්ෂූ කෙණෙකුන් වහන්සේ අරභයා මේ ජාතකය වදාළ සේක.\n\nඒ කෙසේදයත්,\n\nබුදුරජානන් වහන්සේ සැවැත් නුවර වසන කල්හි එම නුවර වසන්නා වූ එක් කුල පුත්‍රයෙක් ජේතවනාරාමයට ගොස් බුදුන්ගෙන් බණ අසා රත්නත්‍රයෙහි ප්‍රසන්න වූ සිත් ඇතිව කාමයෙහි ආදීනව හා ප්‍රවෘජ්‍යාවෙහි අනුසස් අසා මහණව උපසම්පදා පස්වසක් ඇතුළත උභය මාතෘකාව වනපොත් කොට සික්ෂා පද ඉගෙන භාවනා මාර්ගයන් ඉගෙන සර්වඥයන් සමීපයේදී තමන් වහන්සේට අභිප්‍රාය වූ කර්මස්ථානයක් ගෙන උදකලාව වාසය කැමතිව වලට වැද වනයෙහි සැදැහැ ඇති උපාසකවරුන් විසින් කරවා පිළිගන්වන ලද පන්සලක වස් වැස වස් තුන් මස මුළුල්ලෙහි මාර්ග ඵල උපදවන්නට උත්සාහකරණ සේක් විදර්ශනා ලෝකයක් වේවායි ප්‍රතිභාග නිමිත්තක් වේවායි උපදාව ගත නොහි මෙසේ සිතු සේක. සර්වඥයන් වහන්සේ විසින් පුද්ගලයෝ සතර දෙනෙක් වදාරණ ලද මොහුන් සතර දෙනා අතුරින් මා පද පරමවන්ට කාරණය වන්නේය. මට මේ ආත්ම භාවයෙහි මාර්ගයෙක් වත් ඵලයක් වත් නැතැයි සිතමි. එසේ හෙයින්මේ වනයේ වැස කුමක් කෙරෙම්ද?. සර්වඥයන් වහන්සේ සමීපයට ගොස් රූපාග්‍ර ප්‍රාප්ත වූ බුදුන්ගේ ශරීරය බලබලා මිහිරී වූ බණ අසමින් විසියෙම් වීම් නම් යහපත් වන්නේයැයි සිතා නැවත ජේතවනාරාමයට වැඩි සේක.\nඋන් වහන්සේ දැක සන්ද්‍රා දෘෂ්ට සම්භක්ත භික්ෂූහූ මෙසේ කිවුහ. ඇවැත්නි තෙපි ලොව්තුරා බුදුන්ගෙන් කමටහන් ගෙන මහණ දම් කෙරෙමි ගිවිස දැන් වූ කලී වලින් අවුත් සනසන්ඝනීකා යෙහි ඇලී වාසය කරව. කිමෙක්ද තොපගේ ප්‍රවෘජා කෘත්‍යය මුදුන් පැමිණියේද පුනරුත්පත්තියක් නැතුව අරහත් ඵල ඥානය ප්‍රතිවේද කලාදැයි කීහ. ඇවැත්නි මම මාර්ගයක් වත් නොලැබම අභව්‍ය පුද්ගලයෙක් විය යුතු යැයි සිතා වීර්යය හැර ආමී සේක. එකල්හි භික්ෂුන් වහන්සේ කියන සේක් ඇවැත්නි දෘඪ වීර්යය ඇති සර්වඥයන් වහන්සේගේ සාසනයෙහි මහණව භාවනාකොට මාර්ගඵල ඉපදවීමෙහි වීර්ය අඩුව තොප විසින් අකාර්යක්ම කරන ලද අපහාස කැටිව එව. සර්වඥයන් වහන්සේ සමීපයට යම්හයි කියා ඒ භික්ෂුව කැඳවාගෙන බුදුන් සමීපයට ගිය සේක. සර්වඥයන් වහන්සේ භික්ෂුන් දැක මහණෙනි තෙපි මේ භික්ෂුව නොකැමැති පරිද්දෙන් කැඳවා ගෙන කුමක් පිණිස අවුද. මොහු විසින් කවර අපරාදයක් කරන ලදැයි විචාරා වදාළ සේක. එකල්හි භික්ෂූන් වහන්සේ දක්වන සේක් ස්වාමීනි මේ මහන මෙබඳු නෛර්යාණික ශාසනයෙහි මහණව මහණදම් කරන්නේ විර්ය ඇර ආයේ යැයි දැක්වූ සේක. එකල්හි සර්වඥයන්වහන්සේ සැබැද මහණ තා විර්ය හළු̈යෙහි යැයි වදාරා, සැබැව ස්වාමීනි, දැන් වූ කල්හි කිමෙක්ද මහණ තෝ මෙබඳු ශාසනයෙහි මහණව අල්පේච්ච සේක. සතෘෂ්ට සේක. කුලයෙහි ගෙණෙහි නොඇලෙන සේක. වඩන ලද වීර්ය ඇති සේකැයි මෙසේ තමා ප්‍රසිද්ධ නොකොට මේ මහණ හරණ ලද වීර්ය ඇත්තේ යැයි කුමක් පිණිස ප්‍රකාශ කරවූයෙහිද. මහණ තෝ පෙර වීර්ය වත් වූයේ නොවේද. තා එක තැන් වූ කල වීර්ය නිසා මරු කතර පන්සියයක් ගැල්වල ඒ මිනිසුන් හා ගොන් පැන් ලැබ ස්වාසස්ථානයට පැමිණියෝ නොවැද දැන් තෝ කවර කාරණයකින් වීර්ය ඇරපුයෙහි වේදැයි වදාල සේක. එකල්හි ඒ මහණ මෙපමණ බසකින් උපසම්ඵහ ලද්දේ විය. ඒ කතාව අසා භික්ෂූන්වහන්සේ බුදුන්ට යාඤ්ඥා කරණ සේක්, ස්වාමීනි දැන් මේ භික්ෂූ හූ විසින් වීර්ය හල බව අප ඇමට ප්‍රකාශය. අතීතයෙහි මොහු තනි තැනැත්තවූන්ගේ වීර්ය නිසා මරු කතර ගොන් හා මිනිසුන් පැන් ලැබ ස්වාසස්ථානයට පැමිණි බව භවයෙන් පටිච්ඡන්න හෙයින් අපට ප්‍රකාශය නුඹ වහන්සේගේ සර්වඥතා ඥාණයටම ප්‍රකාශය අපටත් ඒ කාරණය ප්‍රකාශ කොට වදාළ මැනවැයි ආරාධනා කළ සේක. එකල්හි සර්වඥයන් වහන්සේ එසේ වී නම් මහණෙනි අසව් යයි කියා ඒ භික්ෂුන්ට සිහි උපදවා භවාන්තරයෙන් සැඟ උනා වූ කාරණය ප්‍රකාශ කොට වදාලසේක.\n\n\nයටගිය දවස කසීරට බරණැස් නුවර බ්‍රහ්මදත්ත නම් රජ්ජුරු කෙනෙකුන් රාජ්‍ය කරන කල්හි අප මහා බෝසතානෝ සාන්තු නායක කුලයෙහි පිළිසිඳ ගෙන වැඩි විය පැමිණ පන්සියයක් ගැලින් වෙළඳාම් කොට ඇවිදිනාහුය. මෙසේ වෙළදාම් කොට ඇවිදිනාහු මහා බෝධි සත්වයෝ එක් කලක මරු කතරක පැමිණියාහුය. ඒ වාළුකා කාන්තාරයෙහි වැලි ඉතා සියුම් වන්නේය. මිටින් ගත් වැලි මිට නොසිටින්නේය. හිරු නැගි වේලෙහි පටන් කිහිරඟිරු රැසක් මෙන් කකියන්නේය. පයින් වැලි මැඩගෙන යන්ට නොපිළිවන. එසේ හෙයින් ඒ වාළුකා කාන්තාරයෙහි යන්නා වූ සත්වයෝ දර පැන් තෙල් සහල් ආදිය ගැලින් අරගෙන රාත්‍රියෙහි ගොස් අරුණ නැගුණ වේලෙහි ගැල් මුදා ගැල් පට වලල්ලෙහි සිටුවා මුදුනෙහි කොළ මඩු ඉදිකොට වේලාසනම කා බී ඇකිල මණ්ඩප ඡායාවෙහි ඉඳ දවස් යවා ඉර බැස ගිය කල්හි රාත්‍රි භෝජනය අනුභව කොට බිම සීතලව ගිය කල්හි ගැල් යොදාගෙන යන්නාහුය. සමුද්‍ර යාත්‍රාවක් හා සමාන වූ ගමන් වන්නේය. ගැල් පදවා ගෙන යන ප්‍රධාන පුරුෂ තෙමේ ගොඩ නියමුවා යැයි නම් ලබන්නට සුදුසු වන්නේය. එසේ හෙයින් තරු සලකුණින් ගැල් සාත්තු පදවාගෙන යන්නේය. අප මහා බෝසතානෝද එකල්හි මේ ක්‍රමයෙන් ඒ මරු කතර යන්නාහු එකුන් සැට යොදුනක් ගොස් දැන් එක රාත්‍රියකින්ම මරු කතර ගෙවා සේම භූමියට පැමිණීම වන්නේයැයි කියහැකි. අවස්ථාවෙහි සවස බත් අනුභව කොට සියළු දර පැන් නිමවා ගැල් යොදා ගෙන නික්මුනාහුය. නියාම පුරුෂයානෝ ඉදිරියේ යන ගැලදික් සඟලා පුටුවක් අතුරුවාගෙන ආකාශයෙහි තරු සලකුණු බලමින් ගැල් මෙසේ පදුව මෙසේ පදුවයි කිය කියා වැදහොත් තැනැත්තෝය. බොහෝ කලක් නොනිදු බැවින් නින්දෙන් මිරිකී නිදන්නට පටන් ගත්තාහුය. එකල්හි ගොන් කරකැවි ආපස්සේ නික්මුනා බව නොදන්නාහු ගැල් අඳනා ගොන් සකල රාත්‍රියෙහි අවුත් පළමු දවස් ලැගි තැනටම පැමිණියාහුය. සාත්තු නායක තෙමේ අරුණ නැගෙන වේලෙහි පිබිද නැකැත් තරු බලා ගැල් රඳව රඳවයි කීයේය. මෙසේ කියා ගැල් කරකවා පිළිවෙළින් සිටුවමින් සිටියදීම අරුණු නැංගේය. මනුෂයෝ කියන්නාහු, මේ අපගේ කඳවුරු බැඳ උන් තැනය. අපගේ දර පැනත් නිමවා ගියේය. දැන් නටුවෝමෝදැයි කියා ගැල් මුදා ගැල්වට වලල්ලෙහි සිටුවා මුදුනේ මණ්ඩපයක් කොට තම තමන්ගේ ගැල්යට සෝක ගෙන උන්නාහුය. එවෙලෙහි අප මහ බෝසතානෝ මා විර්ය ඇරපුවොත් සියල්ලෝම නසිතියි සිතා උදෑසන සිසිල් වේලේම ඇවිදිනා තැනැත්තෝ එක් ඊ තන පඳුරක් දැක මේ තණ පඳුරට දිය උරමින් නැංගේ වනැයි සිතා උදැල්ලක් ගෙන්වා ගෙන ඒ ඊතන පඳුර තිබු තැන කණින්ට පටන් ගෙන සැට රියනක් පමණ කැණපූය. මෙතෙක් තැන් කැණ නැවතත් පල්ලේ කන්හයි උදලු̈ එලන්නාවු මනුෂ්‍යන්ගේ උදුලයට ගල තල මත්තේ වැද ගන්නට පටන් ගත් කල්හි ඇම දෙන අවීරියව ගියහ. බෝධි සත්වයෝ වනාහී වම් ගල තලින් යට පැන් විය යුතුයයි සිතා ලිඳට බැස ගල තල මත්තෙහි සිට නැමී තමා දියේ යන හඬ පරීක්ෂා කරන්නෝ ගල තල යටින් දිය යන හඬ අසා ලිදෙන් ගොඩ නැගී තමන්ගේ අතවැසි පුරුෂයා හට මෙසේ කිවුය. දරුව තොප අවීරියව ගියෝත් අප සියල්ලෝම නසුම්හ. එසේ හෙයින් තොපි අවීර්යව නොවි පසු නොලැබ වීර්ය වඩා මේ යකුල ගෙන ලිඳට බැස මේ ගල තල මත්තෙහි කුළු ගණනක් එලාපියවයි කියුය. ඒ අසා අතවැසි පුරුෂ මහ බෝසතානන්ගේ වචනය පිළිගෙන ඇමදෙන වීර්ය තබා පියා සිටිකල්හි තෙමේ විර්ය නොහැර ලිඳට බැස ගල තල මත්තෙහි යකුලු̈ ගණනක් එලාපුයේය. එකල්හි ගල තල මධ්‍යනේ බිඳි යට වැටි අවිචින්නව පවත්නා වූ ජල ප්‍රවාහනය ඇස වාගෙන සිටියේය. නාඹ තල් කඳක් සා දිය කඳක් උඩපැන නැංගේය. එකල්හි සියළු මනුශ්‍යයෝ පැන් බී ජලස්නානය කොට ඉතිරිව තිබු ගැල් සක් ආදිය පුරා කැඳ බත්ආදිය පිස අනුභව කොට ගොනුන් පැන් පොවා තණ ආදීය කවාගෙන ඉර බට වේලෙහි ලිඳ සමීපයෙහි දද ජයක් බැඳ මරු කතර ගෙවා තමන් විසින් කැමතිව නල ලද්දා වූ ස්ථානයටම ගියාහුය. ඒ මනුෂ්‍යයෝ තමන් අභිප්‍රායස්ථානයෙහිදී බඩු විකුට එකට දෙක හා එකට සතර නියායෙන් දෙදියුණු සතර දියුණු ලාභ ලැබ තමන් පළමුවසන්නා වූ ස්ථානයටම පෙරලා ආවාහ. ඒ හැම මනුෂ්‍යයෝ එහි වසන්නා වූ ආයු පමණින් සිට කම් වූ පරිද්දෙන් මිය පරලව ගියාහය. මහබෝසතානෝද ධානාදී වූ පින්කම් කොට කම් වූ පරිද්දෙන් මියපරලොව ගියාහුය.\n\n\nතිලෝගුරු සම්‍යයක් සම්බුදු රජානන් වහන්සේ මේ ධර්ම දේශනාව ගෙන හැර දක්වා වදාරා තවද මත්තෙහි ඒභික්ෂූන් වහන්සේට ධර්ම දේශනා කරන සේක් යම් සේ වෙළදුන් නොකූසිතව මරු කතර ලිං බැඳ පැන් ලද්දාහුද එපරිද්දෙන්ම මේ සර්වඥ ශාසනයෙහි මහණව නුකූසීතව වීර්ය කරන්නා වූ නුවණැති මහණ තෙමේ ධ්‍යාන මෝක්ෂා මාර්ගඵල ආදී වූ ප්‍රභේද ඇති ලය සැනසීම ලබන්නේය. මහණ තෝ පෙර පැන් පමණක් නිසා වීර්යකොට දැන් මෙබඳු නෛර්‍යාත්මික සාසනයේ මහණව මාර්ගඵලයට පැමිණීමෙහි කවර කාරණයකින් වීර්ය ඇරපුයෙහි දැයි මෙසේ නැවතත් ධර්ම දේශනා කොට දුක්ඛ සමුදය නිරෝධ මාර්ගයැයි කියන ලද චතුරාර්ය සත්‍ය ප්‍රකාශ කොට වදාල සේක. චතු සත්‍යය දර්ම දේශනාවගේ කෙළවර පසුබට වීර්ය ඇති භික්ෂූන් වහන්සේ අර්හත් ඵලයෙහි පිහිටි සේක. සාතෘ වූ බුදුරජානන්වහන්සේ අතීත කතාවත් වර්ථමාන කථාවත් දෙක එක් කොට අනුසන්ධි ගලපා මේ වන්ණුපත ජාතකය නිමවා වදාළ සේක. එසමයෙහි නුපසුබට වීර්ය ඇති ගල තල බිඳමහජනයාට පැන් දුන් අතවැසි පුරුෂයා නම් දැන් මේ පසුබට වීර්ය ඇති මහණ වන්නේය. එසමයෙහි මරු කතර ගියා වූ සෙසු පර්ෂද නම් දැන් මේ බුදු පිරිස් වන්නාහ. එසමයෙහි සාත්තු නායක පුත්‍ර නම් දැන් තිලෝගුරු සම්‍යයක් සම්බුදු රජ වූ මම ම වේදැයි තමන් වහන්සේ දක්වා වදාළ සේක",
    image: 'assets/stories/s002.jpg',
    tags: [
      'Vannupatha',
      'Vanupatha',
      'Vannupata',
      'Vanupata',
      'වණ්ණුපත',
      'වන්නුපත',
      '2'
    ]);

final _tale003 = Tale(
    id: 003,
    title: 'සේරීවානිජ ජාතකය',
    story:
        'තවද එක් සමයෙක් හී සකල ගුණ නිදාන වූ තිලෝගුරු බුදු රජානන් වහනසේ සැවැත් නුවර නිසා ජේතවනාරාමයෙහි වැඩ වසන සේක් පසුබට වීර්ය ඇති භික්ෂූන් වහන්සේ අරඹයා මේ ජාතකය දක්වා වදාල සේක.\n\nඒ කෙසේද යත්\nඒ පසු බට වීර්ය ඇති භික්ෂුන් වහන්සේ පළමු පරිද්දෙන්ම අවෂේස භික්ෂූන් වහන්සේ විසින් බුදුන් සමීපයට කැඳවාගෙන අවුත් පෑ කල්හි බුදුහුගේ භික්ෂූන් වහන්සේට ආමන්ත්‍රණය කොට එම්බල තෝ මෙබඳු මාර්ග ඵලදායක ශාසනයෙහි මහණව විර්ය හරණෙහිද. ලක්ෂයක් වටනා ඝන රන් තලියෙන් පිරිහුනා වූ සේරිවාණිජ වෙළෙන්දා මෙන් බොහෝ කාලයක් ශෝක කරන්නේ වේදැයි වදාරා තුෂ්ණිම්භුතව වැඩ උන් සේක. එකල්හි එතැනට රැස් වූ භික්ෂූන් වහන්සේ සකසා හැඳ පෙරව පල භාරයෙන් නැමනා වූ කදැලි වෘක්ෂයක් මෙන් බුදු රජානන් වහන්සේට අභිමුඛව නම් නච බන්ධාඤලීව දොහොත් මුදුනෙහි තබා භක්ති ප්‍රේමාති භාර වනෝත්තම මාංගයෙන් නමස්කාර කොට සිට ඒ අර්ථය ප්‍රකාශ කරන පිණිස සර්වඥයන් වහන්සේට ආරාධනා කළ සේක. එවෙලෙහි බුදුරජානන් වහන්සේ අන්‍යභවයෙන් සැඟවුනාවූ කාරණය ප්‍රකාශ කොට ඉකුත් වත් දක්වා වදාල සේක.\n\nයට ගිය දවස මෙම කල්පයට පස් වෙනි වූ අප මහා බෝධි සත්වයෝ සේරිව රාජ්‍යයෙහි රංපසිඹු පහිය කරලා කිසිල්ලෙහි ගෙන්වා ගෙන වෙළඳාම් කෙරෙන හෙයින් කච්චපුට වාණිජය නම් ඇති වෙළඳ උපන්නාහ. ඒ වෙළෙඳානෝ සේරිවාණිජ නම් එක් ලෝභි වෙළෙදකු හා සමග නිලවාහිනී නම් වූ ගඟෙන් එතරව අන්ධපුර නම් නුවරට වැද නුවර විථිය බෙදාගෙන තමන්ට පැමිණි වීථියෙහි බඩු විකුණමින් ඇවිදිති. අන්‍යය ලෝභි වෙළඳ තම පැමිණි වීදියෙහි බඩු විකුට ඇවදිනේය. එකල්හි එක් සිටු කුලයක ඇත්තෝ දුප්පත් වූය. සියළු මල් බෑයන් හා දරුවෝත් වස්තුවත් නැසි ගියෝය. එක් මිණිබිරි කුඩා කෙල්ලක් මිත්තනියන් හා සමඟ නොනැසි රඳා ගියාය. ඔවුන් දෙදෙනම අනුන්ට බැල මෙහෙවර කොට ජිවත් වෙති. මොවුන් දෙනොගෙහි පළමු මහ සිටානන් බත් අනුභව කල රන් තලියන් වළං අතුරෙහි තිබි බොහෝ දවසක් ප්‍රයෝජන නොවු හෙයින් මළ ගැසී ගියේය. ඒ තාක් වන තුරු ඔහු දෙදන රන් තලිය බවක් නොදනිති. එකල ඒ ලෝභි වෙළඳා කදා වළුලු ගනුවයි කියමින් ඇවිදිනේ ඒ ගේ දොරට පැමිණියේය. ඒ ගෙයි කුමාරිකාවෝ වෙළදා දැක මුත්තනියන්ට කියන්නේ මෑණියනි මට එක් පළදානවක් ගනුවයි කීව. ඒ අසා මුත්තනියෝ අපි දුක්ඛිත යම්හ. කුමක් දී පළඳනා ගනුමෝදැයි කීයුය. එ වෙලෙහි ඒ කුමාරිකා කියන්නේ අපගේ තලියක් ඇත. ඒ තලියෙන් අපට කිසි ප්‍රයෝජනයකුත් නැත. මේ තලිය දී පියා වළලු ගත මැනවැයි කීහ. මුත්තනියෝ ඒ කුමාරිකාවගේ ඇවිටිලි බලවත් හෙයින් වෙළදා කැඳවා අස්නක හිඳුවා තලිය දී ස්වාමිනි මේ තලිය අරගෙන නුඹගේ නැගනියන්ට නිසි පළඳනාවක් දුන මැනවයි කීයුය. ඒ ලෝභි වෙළඳා තලිය අතින් ගෙන රන් තලියක් වනැයි තලිය පිට ඉඳිකටුවෙන් ඉරක් ඇඳ රන් භව දැන මොවුන්ට කිසිවක් නොදිම මේ තලිය ගෙනයමියි සිතා මේ තලිය කුමක් අගිද. අඩමදටකුත් පමණ මේ තලියට මිළ නැත්තේයැයි කියා බිමට දමා හුනස්නෙන් නැගී ගියේය.\n\nඑක් කෙනෙකුන් වැඳ නික්මුනු විථියට අනෙක් තැනැත්තේ වදින්ට නිසි වන්නේයැයි බෝධිසත්වයෝ ඒ විථියට වැද කදාවළලු ගනුවයි කියමින් එම ගේ දොරට පැමිණියෝය. නැවත ඒ කුමාරිකා තම පළමු පරිද්දෙන්ම මුත්තනියන්ට කියන්නේනේ මෑනියනි මට වළලු අරගෙන දුන මැනවැයි ඇවිටිලි කීව. එකල්හි මුත්තනනියෝ කුමාරිකාවන්ට කියන්නෝ දුවනියනි පළමුව ආ වෙළඳානෝ තමාට දුන් තලිය බිමට දමා ගියෝය. දැන් කුමක් දී ගනිමෝදැයි කිවුය. ඒ අසා කුමාරිකා තෙම කිය්නනේ මෑනියනි ඒ වෙළඳතෙම තද පරුෂ බස් ඇත්තේය. මේ වෙළදානෝ වූ කලි ප්‍රිය වූ දැකුම් ඇත්තෝය. මොලොක් වූ කතා ඇත්තෝය. එසේ හෙයින් මේ තලිය අරගෙනදී මට පළඳනා අරගෙන දුන මැනවැයි වළලු නම් යහපත් වේදැයි කියුය. ඒ කුමාරිකාවගේ බස් අසා මුත්තනියෝ කියන්නෝ එසේ විනම් කැඳවයි කියා වෙළඳානන් කැඳවුහ. ඉක්බිත්තෙන් ගෙට වැදලා උන්නා වූ බෝධි සත්වයන්ට ඒ තලිය දුන්නාහ. බෝධි සත්වයෝ ඒ රන් තලියේ නියාව දැන කියන්නාහු මෑණියනි මේ තලිය අගනා බඩු මා අත නැතැයි කියුහ. ඒඅසා කුමාරිකාවගේ මුත්තනියෝ කියන්නෝ පළමු ආ වෙළදානෝ මේ තලිය අඩමදටකුත් නොපුස්නේ යැයි කියා බිමට දමා ගියෝය. මේ තලිය වූ කලි නුඹගේ කුසලයෙන් ස්වාමීනි රත්රන්ව ගියවනැයි අපි නුඹට මේ තලිය දෙම්හ. අපට යම් තම් දෙයක් දී පියා මේ තලිය ගෙන ගිය මැනවැයි කීයුහ. බෝධිසත්වයෝ එකෙණෙහිම අත තිබු පන්සියයක් කහවනු හා පන්සියයක් අඟනා බඩු දී මිල ඇම මදියි මට මේ පළන්දන්ට ආපසුම්බියත් කහවනු අටකුත් දුන මැනවයි මෙපමණක් ඉල්වා අරගෙන පළා ගියා හුය. මහබෝසතානෝ වහ වහා ගංතෙරට ගොස් ඔරු පදනා තොටියාට කහවනු අටක් දී ඔරුවට පැනනැංගාහුය. ඉක්බිත්තෙන් ඒ ලෝභි වෙළඳා නැවතත් ඒ ගෙට ගොස් පළමු මා බලා පියා ගිය තලිය ගෙනව යන්තම් මිලයක් තොපට දෙමියි කියා කියුය. ඒ අසා කුමාරිකාවගේ මුත්නනියෝ ඕ හට බැණ දොඩා අපගේ ලක්ෂයක් වටනා ගනරන් තලිය අඩමදටකුත් නොමුස්නා කෙලිහිය. තට ස්වාමිදරුවෙකු වැනි වූ එක් ධර්මිෂ්ට වෙළදාන කෙනෙක් අපට දහසක් මිළ දී ඒ තලිය අරගෙන ගියෝ වේදැයි කිවුය. ඒ අසා හෙතම ලක්ෂයක් වටනා ඝණ රන් තලියෙන් පිරිහී ගියෙම් වේදැයි මට වූයේ බලවත් හානියකැයි උපන්නා වූ බලවත් ශෝක ඇතිව සිහිඑලවා ගන්නට අසමර්ථව ඉසංඥව තමා අත තිබූ කහවණුත් බඩුත් ඒ ගෙදරම වගුරුවා හං පෙරවි පිරිහෙලා පළන්දන්ඩ මුගුරක් මෙන් අල්ලාගෙන බෝධිසත්වයන් පසුපස්සේ ලුහුබැඳවාගෙන යන්නේ ගං තෙරට පැමිණ යන්නා වූ බෝධිසත්වයන් දැක එම්බල තොටිය ඔරුව රඳවයි රඳවයි කියා අඬගසා ලීය. ඒ අසා බෝධි සත්වයෝ තොටියාට කියන්නාහු ඔරුව ආපස්සේ කරකවා නොපදුවයි වැලකූය. තමා කි බස් නොගිවිස ඔරුව නොරදා පදනා ඔරුවෙන් යන්නා වූ බෝධිසත්වයන් බල බලා සිටියා වූ ඒ ලෝභි වෙළඳාට බලවත් වූ සෝක උපන්නෝය. ලය උණුව ගියේය. මුඛයෙන් උණු ලේ නැගීය. වැවක පැලි වලල්ලක් මෙන් ලය පැලි ගියේය.\n\nඒ ලෝභි වෙළඳා බෝධිසත්වයන් කෙරෙහි ආගාත බැඳ එතනැම ජිවිතක්ෂයට පැමිණියේය. මෙසේ බෝධි සත්වයන් කෙරෙහි දේවදත් ස්ථවිරයන් වහන්සේ පළමුවෙන් වෛර බැඳිම වන්නේය. බෝධි සත්වයෝ ධානාදී වූ පින්කම් කොට කම්වූ පරිද්දෙන් මිය පරලව ගියෝය. තිලෝ ගුරු බුදුරජානන් වහන්සේ මේ ධර්ම දේශනාව ගෙන හැර දක්වා වදාරා මත්තෙහි ධර්ම දේශනා කොට වදාරන සේක් යම් සේ පෙර සේරිවාණිජ නම් වෙළඳා ලක්ෂයක් වටනා ඝන රන් තලිය නොලැබ ඒ තලිය ගන්ට වීර්ය නොකොට ඒ තලියෙන් පිරිහි සෝක කරේද පංචස්තාපයට පැමිණියේද එපරිද්දෙන් මහණ තොපි මේ සාසනයෙහි සරහා පිළියල කරන ලද රන් තලියන් වැනි වු ආර්ය මාර්ගයට පසු බට වීරිය ඇති බැවින් නොපැමිණ ඒ මාර්ග ඵලයෙනුත් පිරිහි බොහෝ කලක් සෝක කරන්නාහුය. ඉඳින් තෝ වීර්ය නොහළුවේ වේනම් නුවණ ඇති වෙළඳා නම් රං තලිය ගෙන ප්‍රයොජනය වින්ද කලක් මෙන් මාගේ ශාසනයෙහි නවවිද ලෝකෝත්තර ධර්මය ලබන්නේහි වේදැයි මෙසේ ඒ සර්වඥයන් වහන්සේ නැවතත් ඒ භික්ෂූන් වහ්න්සේට අර්හත් ඵලය කුලු ගන්වමින් ධර්ම දේශනාව දක්වා චතුරාර්ය සත්‍යය ප්‍රකාශ කොට වදාලසේක. චතු සත්‍යය ධර්ම දේශනාවේ කෙළවර පසුබට වීරය ඇති භික්ෂූන් වහන්සේ අර්හත් ඵලයෙහි පිහිටි සේක. තවද බුදුහු පූර්වාපර සන්ධි ගලපා මේ සේරිවාණිජ ජාතකය නිමවා වදාල සේක. එසමයෙහි අඤ්ඤාණ වෙළදා නම් දැන් දේවදත්ත ස්ථවිරයෝය. එසමයෙහි නුවණ ඇති වෙළදානම් තිලෝගුරු සම්‍යයක් සම්බුදු රජ වූ මම්ම වේදැයි තමන් වහන්සේ දක්වා වදාල සේක.\n',
    image: 'assets/stories/s003.jpg',
    tags: ['', 'Serivanija', 'සේරීවානිජ', '3']);

final _tale004 = Tale(
    id: 4,
    title: 'චුල්ලසෙට්ඨි ජාතකය',
    story: 'This is the tale 4',
    image: 'assets/stories/s004.jpg',
    tags: ['Chullasetti', 'Chulasetti', 'Chulaseti', 'චුල්ලසෙට්ඨි', '4']);

final _tale005 = Tale(
    id: 5,
    title: 'තන්ඩුලනාලී ජාතකය',
    story: 'This is the tale 5',
    image: 'assets/stories/s005.jpg',
    tags: ['Thandulanali', 'Tandulanali', 'තන්ඩුලනාලී', '5']);

final _tale006 = Tale(
    id: 6,
    title: 'දේවධර්ම ජාතකය',
    story: 'This is the tale 6',
    image: 'assets/stories/s006.jpg',
    tags: ['Devadarma', 'Dewadarma', 'දේවධර්ම', 'දෙවදර්ම', '6']);

final _tale007 = Tale(
    id: 7,
    title: 'කඨහාරි ජාතකය',
    story: 'This is the tale 7',
    image: 'assets/stories/s007.jpg',
    tags: ['Katahari', 'කඨහාරි', 'කටහාරි', '7']);

final _tale008 = Tale(
    id: 8,
    title: 'ගාමිණී ජාතකය',
    story: 'This is the tale 8',
    image: 'assets/stories/s008.jpg',
    tags: ['Gamini', 'ගාමිණී', '8']);

final _tale009 = Tale(
    id: 9,
    title: 'මඛාදේව ජාතකය',
    story: 'This is the tale 9',
    image: 'assets/stories/s009.jpg',
    tags: ['Makadeva', 'Makadewa', 'මඛාදේව', 'මකාදේව', '9']);

final _tale010 = Tale(
    id: 10,
    title: 'සුඛවිහාරී ජාතකය',
    story: 'This is the tale 10',
    image: 'assets/stories/s010.jpg',
    tags: ['Sukavihari', 'Sukhavihari', 'සුඛවිහාරී', 'සුකවිහරි', '10']);

final _tale011 = Tale(
    id: 11,
    title: 'ලක්ඛණමිග ජාතකය',
    story: 'This is the tale 11',
    image: 'assets/stories/s011.jpg',
    tags: [
      'Lakkhanamiga',
      'Lakanamiga',
      'Lakkanamiga',
      'ලක්ඛණමිග',
      'ලක්කනමිග',
      '11'
    ]);

final _tale012 = Tale(
    id: 12,
    title: 'මාලුත ජාතකය',
    story: 'This is the tale 12',
    image: 'assets/stories/s012.jpg',
    tags: ['Malutha', 'Maluta', 'මලුත', 'මාලුත', '12']);

final _tale013 = Tale(
    id: 13,
    title: 'ආයාචිතභක්ත ජාතකය',
    story: 'This is the tale 13',
    image: 'assets/stories/s013.jpg',
    tags: ['Ayachitabakta', 'Ayachithabaktha', 'ආයාචිතභක්ත', 'මාලුත', '13']);

final _tale014 = Tale(
    id: 14,
    title: 'කුරුන්ගමෘග ජාතකය',
    story: 'This is the tale 14',
    image: 'assets/stories/s014.jpg',
    tags: [
      'Kurungamruga',
      'Kurungamuga',
      'Kurungamaga',
      'කුරුන්ගමෘග',
      'කුරුන්ගමුග',
      '14'
    ]);

final _tale015 = Tale(
    id: 15,
    title: 'ආජඤඤ ජාතකය',
    story: 'This is the tale 15',
    image: 'assets/stories/s015.jpg',
    tags: ['Aajanna', 'Ajanna', 'Aajana', 'ආජඤඤ', 'ආජන්න', '15']);

final _tale016 = Tale(
    id: 16,
    title: 'නිග්‍රෝධමිග ජාතකය',
    story: 'This is the tale 16',
    image: 'assets/stories/s016.jpg',
    tags: [
      'Nigrodamiga',
      'Negroda',
      'Nigrodhamiga',
      'Neegrodhamiga',
      'නිග්‍රෝධමිග',
      'නිග්‍රෝදමිග',
      '16'
    ]);

final _tale017 = Tale(
    id: 17,
    title: 'කණ්ඩින ජාතකය',
    story: 'This is the tale 17',
    image: 'assets/stories/s017.jpg',
    tags: ['Kandina', 'කණ්ඩින', 'කන්දින', 'කන්ඩින', '17']);

final _tale018 = Tale(
    id: 18,
    title: 'වාතමිග ජාතකය',
    story: 'This is the tale 18',
    image: 'assets/stories/s018.jpg',
    tags: ['Wathamiga', 'Vathamiga', 'Watamiga', 'Vatamiga', 'වාතමිග', '18']);

final _tale019 = Tale(
    id: 19,
    title: 'ඛරාදිය ජාතකය',
    story: 'This is the tale 19',
    image: 'assets/stories/s019.jpg',
    tags: ['Kharadiya', 'Karadiya', 'මලුත', 'ඛරාදිය', 'කරාදිය', '19']);

final _tale020 = Tale(
    id: 20,
    title: 'තිපල්ලත්ථමිග ජාතකය',
    story: 'This is the tale 20',
    image: 'assets/stories/s020.jpg',
    tags: [
      'Thipallaththamiga',
      'Tipallattamiga',
      'Thipalaththamiga',
      'Thipallattamiga',
      'තිපල්ලත්ථමිග',
      'තිපල්ලත්තමිග',
      '20'
    ]);

final _tale021 = Tale(
    id: 21,
    title: 'මතකභක්ත ජාතකය',
    story: 'This is the tale 21',
    image: 'assets/stories/s021.jpg',
    tags: [
      'Mathakabhaktha',
      'Matakabakta',
      'MathakaBhakta',
      'Matakabhakta',
      'මතකභක්ත',
      'මතකබක්ත',
      '21'
    ]);

final _tale022 = Tale(
    id: 22,
    title: 'නලපාන ජාතකය',
    story: 'This is the tale 22',
    image: 'assets/stories/s022.jpg',
    tags: ['Nalapana', 'නලපාන', 'නළපාන', 'නළපාණ', 'නලපාණ', '22']);

final _tale023 = Tale(
    id: 23,
    title: 'කුක්කුර ජාතකය',
    story: 'This is the tale 23',
    image: 'assets/stories/s023.jpg',
    tags: ['Kukkura', 'Kukura', 'කුක්කුර', '23']);

final _tale024 = Tale(
    id: 24,
    title: 'භෝජාජානීය ජාතකය',
    story: 'This is the tale 24',
    image: 'assets/stories/s024.jpg',
    tags: [
      'BojaJaneeya',
      'Bhojajaneeya',
      'Bojajaniya',
      'Bhojajaniya',
      'භෝජාජානීය',
      'බෝජාජානීය',
      'භෝජාපානීය',
      'බෝජාපානීය',
      '24'
    ]);

final _tale025 = Tale(
    id: 25,
    title: 'තීර්ථ ජාතකය',
    story: 'This is the tale 25',
    image: 'assets/stories/s025.jpg',
    tags: ['Thirtha', 'Tirtha', 'Thirta', 'Tirta', 'තීර්ත', 'තීර්ථ', '25']);

final _tale026 = Tale(
    id: 26,
    title: 'මහිලාමුඛ ජාතකය',
    story: 'This is the tale 26',
    image: 'assets/stories/s026.jpg',
    tags: ['Mahilamuka', 'Mahilamukha', 'මහිලාමුක', 'මහිලාමුඛ', '26']);

final _tale027 = Tale(
    id: 27,
    title: 'අභිණ්හ ජාතකය',
    story: 'This is the tale 27',
    image: 'assets/stories/s027.jpg',
    tags: ['Abinha', 'Abhinha', 'අබිණ්හ', 'අබින්හ', 'අභිණ්හ', '27']);

final _tale028 = Tale(
    id: 28,
    title: 'නන්දි විසාල ජාතකය',
    story: 'This is the tale 28',
    image: 'assets/stories/s028.jpg',
    tags: [
      'Nandi Wisala',
      'Nandi visala',
      'Nandivisala',
      'Nandiwisala',
      'නන්දි විසාල',
      '28'
    ]);

final _tale029 = Tale(
    id: 29,
    title: 'කණහ ජාතකය',
    story: 'This is the tale 29',
    image: 'assets/stories/s029.jpg',
    tags: ['Kanaha', 'Canaha', 'මඛාදේව', 'කනහ', '29']);

final _tale030 = Tale(
    id: 30,
    title: 'මුනික ජාතකය',
    story: 'This is the tale 30',
    image: 'assets/stories/s030.jpg',
    tags: ['Munika', 'මුණික', 'මුනික', '30']);

final _tale031 = Tale(
    id: 031,
    title: 'කුලාවක ජාතකය',
    story: '',
    image: 'assets/stories/s031.jpg',
    tags: ['', 'Kulavaka', 'කුලාවක', '31']);

final _tale032 = Tale(
    id: 032,
    title: 'නච්ච ජාතකය',
    story: '',
    image: 'assets/stories/s032.jpg',
    tags: ['', 'Nacca', 'නච්ච', '32']);

final _tale033 = Tale(
    id: 033,
    title: 'සමෙමාදමාන ජාතකය',
    story: '',
    image: 'assets/stories/s033.jpg',
    tags: ['', 'Sammodamana', 'සමෙමාදමාන', '33']);

final _tale034 = Tale(
    id: 034,
    title: 'මත්ස්‍ය ජාතකය',
    story: '',
    image: 'assets/stories/s034.jpg',
    tags: ['', 'Maccha', 'මත්ස්‍ය', '34']);

final _tale035 = Tale(
    id: 035,
    title: 'වට්ටක ජාතකය',
    story: '',
    image: 'assets/stories/s035.jpg',
    tags: ['', 'Vattaka', 'වට්ටක', '35']);

final _tale036 = Tale(
    id: 036,
    title: 'සකුණ ජාතකය',
    story: '',
    image: 'assets/stories/s036.jpg',
    tags: ['', 'Sakuna', 'සකුණ', '36']);

final _tale037 = Tale(
    id: 037,
    title: 'තිත්තිර ජාතකය',
    story: '',
    image: 'assets/stories/s037.jpg',
    tags: ['', 'Tittira', 'තිත්තිර', '37']);

final _tale038 = Tale(
    id: 038,
    title: 'බක ජාතකය',
    story: '',
    image: 'assets/stories/s038.jpg',
    tags: ['', 'Baka', 'බක', '38']);

final _tale039 = Tale(
    id: 039,
    title: 'නන්ද ජාතකය',
    story: '',
    image: 'assets/stories/s039.jpg',
    tags: ['', 'Nanda', 'නන්ද', '39']);

final _tale040 = Tale(
    id: 040,
    title: 'කපොත ජාතකය',
    story: '',
    image: 'assets/stories/s040.jpg',
    tags: ['', 'Kapota', 'කපොත', '40']);

final _tale041 = Tale(
    id: 041,
    title: 'වෙළුක ජාතකය',
    story: '',
    image: 'assets/stories/s041.jpg',
    tags: ['', 'Veluka', 'වෙළුක', '41']);

final _tale042 = Tale(
    id: 042,
    title: 'මකස ජාතකය',
    story: '',
    image: 'assets/stories/s042.jpg',
    tags: ['', 'Makasa', 'මකස', '42']);

final _tale043 = Tale(
    id: 043,
    title: 'රොහිණි ජාතකය',
    story: '',
    image: 'assets/stories/s043.jpg',
    tags: ['', 'Rohini', 'රොහිණි', '43']);

final _tale044 = Tale(
    id: 044,
    title: 'ආරාම දුෂක ජාතකය',
    story: '',
    image: 'assets/stories/s044.jpg',
    tags: ['', 'Arama Dusaka', 'ආරාම දුෂක', '44']);

final _tale045 = Tale(
    id: 045,
    title: 'වාරුණී ජාතකය',
    story: '',
    image: 'assets/stories/s045.jpg',
    tags: ['', 'Vaaruni', 'වාරුණී', '45']);

final _tale046 = Tale(
    id: 046,
    title: 'නක්ඛත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s046.jpg',
    tags: ['', 'Nakkhatta', 'නක්ඛත්ත', '46']);

final _tale047 = Tale(
    id: 047,
    title: 'දුම්මෙධ ජාතකය',
    story: '',
    image: 'assets/stories/s047.jpg',
    tags: ['', 'Dummedha', 'දුම්මෙධ', '47']);

final _tale048 = Tale(
    id: 048,
    title: 'චූලජනක ජාතකය',
    story: '',
    image: 'assets/stories/s048.jpg',
    tags: ['', 'Chulajanaka', 'චූලජනක', '48']);

final _tale049 = Tale(
    id: 049,
    title: 'පුණ්ණපාතී ජාතකය',
    story: '',
    image: 'assets/stories/s049.jpg',
    tags: ['', 'Punnapati', 'පුණ්ණපාතී', '49']);

final _tale050 = Tale(
    id: 050,
    title: 'ඵල ජාතකය',
    story: '',
    image: 'assets/stories/s050.jpg',
    tags: ['', 'Pala', 'ඵල', '50']);

final _tale051 = Tale(
    id: 051,
    title: 'ඛදිරහාර ජාතකය',
    story: '',
    image: 'assets/stories/s051.jpg',
    tags: ['', 'Kadhirahara', 'ඛදිරහාර', '51']);

final _tale052 = Tale(
    id: 052,
    title: 'පඤචායුධ ජාතකය',
    story: '',
    image: 'assets/stories/s052.jpg',
    tags: ['', 'Pancavudha', 'පඤචායුධ', '52']);

final _tale053 = Tale(
    id: 053,
    title: 'කාචනස්කන්‍ධ ජාතකය',
    story: '',
    image: 'assets/stories/s053.jpg',
    tags: ['', 'Kancanakkhandha', 'කාචනස්කන්‍ධ', '53']);

final _tale054 = Tale(
    id: 054,
    title: 'වානරින්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s054.jpg',
    tags: ['', 'Vanarinda', 'වානරින්‍ද', '54']);

final _tale055 = Tale(
    id: 055,
    title: 'භෙරිවාද ජාතකය',
    story: '',
    image: 'assets/stories/s055.jpg',
    tags: ['', 'Bherivada', 'භෙරිවාද', '55']);

final _tale056 = Tale(
    id: 056,
    title: 'සංඛ දමන ජාතකය',
    story: '',
    image: 'assets/stories/s056.jpg',
    tags: ['', 'Sankha Dhamana', 'සංඛ දමන', '56']);

final _tale057 = Tale(
    id: 057,
    title: 'තක්ක ජාතකය',
    story: '',
    image: 'assets/stories/s057.jpg',
    tags: ['', 'Takka', 'තක්ක', '57']);

final _tale058 = Tale(
    id: 058,
    title: 'දුරාචාර ජාතකය',
    story: '',
    image: 'assets/stories/s058.jpg',
    tags: ['', 'Durachara', 'දුරාචාර', '58']);

final _tale059 = Tale(
    id: 059,
    title: 'අනභිරති ජාතකය',
    story: '',
    image: 'assets/stories/s059.jpg',
    tags: ['', 'Anabhirati', 'අනභිරති', '59']);

final _tale060 = Tale(
    id: 060,
    title: 'මුලකඛණ ජාතකය',
    story: '',
    image: 'assets/stories/s060.jpg',
    tags: ['', 'Mudulakkhana', 'මුලකඛණ', '60']);

final _tale061 = Tale(
    id: 061,
    title: 'උචඡඞග ජාතකය',
    story: '',
    image: 'assets/stories/s061.jpg',
    tags: ['', 'Ucchanga', 'උචඡඞග', '61']);

final _tale062 = Tale(
    id: 062,
    title: 'සාකෙත ජාතකය',
    story: '',
    image: 'assets/stories/s062.jpg',
    tags: ['', 'Saketa', 'සාකෙත', '62']);

final _tale063 = Tale(
    id: 063,
    title: 'වරණ ජාතකය',
    story: '',
    image: 'assets/stories/s063.jpg',
    tags: ['', 'Warana', 'වරණ', '63']);

final _tale064 = Tale(
    id: 064,
    title: 'මච්ඡ ජාතකය',
    story: '',
    image: 'assets/stories/s064.jpg',
    tags: ['', 'Machcha', 'මච්ඡ', '64']);

final _tale065 = Tale(
    id: 065,
    title: 'අසංකිය ජාතකය',
    story: '',
    image: 'assets/stories/s065.jpg',
    tags: ['', 'Asankiya', 'අසංකිය', '65']);

final _tale066 = Tale(
    id: 066,
    title: 'කාලකණ්ණි ජාතකය',
    story: '',
    image: 'assets/stories/s066.jpg',
    tags: ['', 'Kalakanni', 'කාලකණ්ණි', '66']);

final _tale067 = Tale(
    id: 067,
    title: 'ලොසක ජාතකය',
    story: '',
    image: 'assets/stories/s067.jpg',
    tags: ['', 'Losaka', 'ලොසක', '67']);

final _tale068 = Tale(
    id: 068,
    title: 'වෙදබ්භ ජාතකය',
    story: '',
    image: 'assets/stories/s068.jpg',
    tags: ['', 'Vedabbha', 'වෙදබ්භ', '68']);

final _tale069 = Tale(
    id: 069,
    title: 'මහා සීලව ජාතකය',
    story: '',
    image: 'assets/stories/s069.jpg',
    tags: ['', 'Maha Silava', 'මහා සීලව', '69']);

final _tale070 = Tale(
    id: 070,
    title: 'තයො ධම්ම ජාතකය',
    story: '',
    image: 'assets/stories/s070.jpg',
    tags: ['', 'Thayo Dhamma', 'තයො ධම්ම', '70']);

final _tale071 = Tale(
    id: 071,
    title: 'අසාත මන්ත ජාතකය',
    story: '',
    image: 'assets/stories/s071.jpg',
    tags: ['', 'Asatha Manta', 'අසාත මන්ත', '71']);

final _tale072 = Tale(
    id: 072,
    title: 'අන්‍ධභූත ජාතකය',
    story: '',
    image: 'assets/stories/s072.jpg',
    tags: ['', 'Andabhuta', 'අන්‍ධභූත', '72']);

final _tale073 = Tale(
    id: 073,
    title: 'විස වන්ත ජාතකය',
    story: '',
    image: 'assets/stories/s073.jpg',
    tags: ['', 'Visavanta', 'විස වන්ත', '73']);

final _tale074 = Tale(
    id: 074,
    title: 'කුද්දාල ජාතකය',
    story: '',
    image: 'assets/stories/s074.jpg',
    tags: ['', 'Kuddala', 'කුද්දාල', '74']);

final _tale075 = Tale(
    id: 075,
    title: 'සීලව නාගරාජ ජාතකය',
    story: '',
    image: 'assets/stories/s075.jpg',
    tags: ['', 'Silava Naaga Raaja', 'සීලව නාගරාජ', '75']);

final _tale076 = Tale(
    id: 076,
    title: 'සච්චං කිර ජාතකය',
    story: '',
    image: 'assets/stories/s076.jpg',
    tags: ['', 'Sachcham Kira', 'සච්චං කිර', '76']);

final _tale077 = Tale(
    id: 077,
    title: 'රුක්ඛ ධම ජාතකය',
    story: '',
    image: 'assets/stories/s077.jpg',
    tags: ['', 'Rukkha Dhama', 'රුක්ඛ ධම', '77']);

final _tale078 = Tale(
    id: 078,
    title: 'මහාසුපින ජාතකය',
    story: '',
    image: 'assets/stories/s078.jpg',
    tags: ['', 'Mahasupina', 'මහාසුපින', '78']);

final _tale079 = Tale(
    id: 079,
    title: 'ඉල්ලිස ජාතකය',
    story: '',
    image: 'assets/stories/s079.jpg',
    tags: ['', 'Illisa', 'ඉල්ලිස', '79']);

final _tale080 = Tale(
    id: 080,
    title: 'ඛරස්සර ජාතකය',
    story: '',
    image: 'assets/stories/s080.jpg',
    tags: ['', 'Kharassara', 'ඛරස්සර', '80']);

final _tale081 = Tale(
    id: 081,
    title: 'භීමසෙන ජාතකය',
    story: '',
    image: 'assets/stories/s081.jpg',
    tags: ['', 'Bhimasena', 'භීමසෙන', '81']);

final _tale082 = Tale(
    id: 082,
    title: 'සුරාපාන ජාතකය',
    story: '',
    image: 'assets/stories/s082.jpg',
    tags: ['', 'Surapana', 'සුරාපාන', '82']);

final _tale083 = Tale(
    id: 083,
    title: 'මිත්ත වින්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s083.jpg',
    tags: ['', 'Mittavinda', 'මිත්ත වින්‍ද', '83']);

final _tale084 = Tale(
    id: 084,
    title: 'අත්ථස්ද්වාර ජාතකය',
    story: '',
    image: 'assets/stories/s084.jpg',
    tags: ['', 'Atthassadvara', 'අත්ථස්ද්වාර', '84']);

final _tale085 = Tale(
    id: 085,
    title: 'කිම්පක්ක ජාතකය',
    story: '',
    image: 'assets/stories/s085.jpg',
    tags: ['', 'Kimpakka', 'කිම්පක්ක', '85']);

final _tale086 = Tale(
    id: 086,
    title: 'සීලවිමංස ජාතකය',
    story: '',
    image: 'assets/stories/s086.jpg',
    tags: ['', 'Silavimamsana', 'සීලවිමංස', '86']);

final _tale087 = Tale(
    id: 087,
    title: 'මඞගල ජාතකය',
    story: '',
    image: 'assets/stories/s087.jpg',
    tags: ['', 'Madagala', 'මඞගල', '87']);

final _tale088 = Tale(
    id: 088,
    title: 'සාරම්භ ජාතකය',
    story: '',
    image: 'assets/stories/s088.jpg',
    tags: ['', 'Saaramba', 'සාරම්භ', '88']);

final _tale089 = Tale(
    id: 089,
    title: 'කුහක ජාතකය',
    story: '',
    image: 'assets/stories/s089.jpg',
    tags: ['', 'Kuhaka', 'කුහක', '89']);

final _tale090 = Tale(
    id: 090,
    title: 'අකතඤ‍්ඤුත ජාතකය',
    story: '',
    image: 'assets/stories/s090.jpg',
    tags: ['', 'Akatannu', 'අකතඤ‍්ඤුත', '90']);

final _tale091 = Tale(
    id: 091,
    title: 'ලිත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s091.jpg',
    tags: ['', 'Litta', 'ලිත්ත', '91']);

final _tale092 = Tale(
    id: 092,
    title: 'මහාසාර ජාතකය',
    story: '',
    image: 'assets/stories/s092.jpg',
    tags: ['', 'Mahasara', 'මහාසාර', '92']);

final _tale093 = Tale(
    id: 093,
    title: 'රිශ්වාස භොජන ජාතකය',
    story: '',
    image: 'assets/stories/s093.jpg',
    tags: ['', 'Rissasa Bhojana', 'රිශ්වාස භොජන', '93']);

final _tale094 = Tale(
    id: 094,
    title: 'ලොමහංස ජාතකය',
    story: '',
    image: 'assets/stories/s094.jpg',
    tags: ['', 'LomaHansa', 'ලොමහංස', '94']);

final _tale095 = Tale(
    id: 095,
    title: 'මහා සුදර්‍ශන ජාතකය',
    story: '',
    image: 'assets/stories/s095.jpg',
    tags: ['', 'Maha Sudarshana', 'මහා සුදර්‍ශන', '95']);

final _tale096 = Tale(
    id: 096,
    title: 'තෙල පත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s096.jpg',
    tags: ['', 'Telapatta', 'තෙල පත්ත', '96']);

final _tale097 = Tale(
    id: 097,
    title: 'නාම සිධි ජාතකය',
    story: '',
    image: 'assets/stories/s097.jpg',
    tags: ['', 'Nama Siddhi', 'නාම සිධි', '97']);

final _tale098 = Tale(
    id: 098,
    title: 'කූට වානිජ ජාතකය',
    story: '',
    image: 'assets/stories/s098.jpg',
    tags: ['', 'Kutavanija', 'කූට වානිජ', '98']);

final _tale099 = Tale(
    id: 099,
    title: 'පරොසහස්ස ජාතකය',
    story: '',
    image: 'assets/stories/s099.jpg',
    tags: ['', 'Parosahassa', 'පරොසහස්ස', '99']);

final _tale100 = Tale(
    id: 100,
    title: 'අඝාත රූප ජාතකය',
    story: '',
    image: 'assets/stories/s100.jpg',
    tags: ['', 'Agatha Ruupa', 'අඝාත රූප', '100']);

final _tale101 = Tale(
    id: 101,
    title: 'රිතීය පරොසහස්ස ජාතකය',
    story: '',
    image: 'assets/stories/s101.jpg',
    tags: ['', 'Ritheeya Parosahassa', 'රිතීය පරොසහස්ස', '101']);

final _tale102 = Tale(
    id: 102,
    title: 'පණ්ණික ජාතකය',
    story: '',
    image: 'assets/stories/s102.jpg',
    tags: ['', 'Pannika', 'පණ්ණික', '102']);

final _tale103 = Tale(
    id: 103,
    title: 'වෙරි ජාතකය',
    story: '',
    image: 'assets/stories/s103.jpg',
    tags: ['', 'Weri', 'වෙරි', '103']);

final _tale104 = Tale(
    id: 104,
    title: 'චිතීය මිත්තවින්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s104.jpg',
    tags: ['', 'Withiya Mittavinda', 'චිතීය මිත්තවින්‍ද', '104']);

final _tale105 = Tale(
    id: 105,
    title: 'ඛඛල කුඨ ජාතකය',
    story: '',
    image: 'assets/stories/s105.jpg',
    tags: ['', 'Kakala Kutta', 'ඛඛල කුඨ', '105']);

final _tale106 = Tale(
    id: 106,
    title: 'උදංචනී ජාතකය',
    story: '',
    image: 'assets/stories/s106.jpg',
    tags: ['', 'Udanchani', 'උදංචනී', '106']);

final _tale107 = Tale(
    id: 107,
    title: 'සාලික ජාතකය',
    story: '',
    image: 'assets/stories/s107.jpg',
    tags: ['', 'Saaliaka', 'සාලික', '107']);

final _tale108 = Tale(
    id: 108,
    title: 'බාහ්‍ය ජාතකය',
    story: '',
    image: 'assets/stories/s108.jpg',
    tags: ['', 'Bahiya', 'බාහ්‍ය', '108']);

final _tale109 = Tale(
    id: 109,
    title: 'කුඩ්ඩක පූව ජාතකය',
    story: '',
    image: 'assets/stories/s109.jpg',
    tags: ['', 'Kuddaka Puuva', 'කුඩ්ඩක පූව', '109']);

final _tale110 = Tale(
    id: 110,
    title: 'ප්‍රථම සිඟාල ජාතකය',
    story: '',
    image: 'assets/stories/s110.jpg',
    tags: ['', 'Prathama Singhala', 'ප්‍රථම සිඟාල', '110']);

final _tale111 = Tale(
    id: 111,
    title: 'මිත චින්ති ජාතකය',
    story: '',
    image: 'assets/stories/s111.jpg',
    tags: ['', 'Mitha Chinthi', 'මිත චින්ති', '111']);

final _tale112 = Tale(
    id: 112,
    title: 'සකුන ජාතකය',
    story: '',
    image: 'assets/stories/s112.jpg',
    tags: ['', 'Sakuna', 'සකුන', '112']);

final _tale113 = Tale(
    id: 113,
    title: 'ක්‍ෂබත ජාතකය',
    story: '',
    image: 'assets/stories/s113.jpg',
    tags: ['', '', 'ක්‍ෂබත', '113']);

final _tale114 = Tale(
    id: 114,
    title: 'තිත්තිර ජාතකය',
    story: '',
    image: 'assets/stories/s114.jpg',
    tags: ['', 'Thiththira', 'තිත්තිර', '114']);

final _tale115 = Tale(
    id: 115,
    title: 'වුටක ජාතකය',
    story: '',
    image: 'assets/stories/s115.jpg',
    tags: ['', '', 'වුටක', '115']);

final _tale116 = Tale(
    id: 116,
    title: 'අකාලරාරි ජාතකය',
    story: '',
    image: 'assets/stories/s116.jpg',
    tags: ['', 'Akaalaraari', 'අකාලරාරි', '116']);

final _tale117 = Tale(
    id: 117,
    title: 'බන්‍ධන මොක්ඛ ජාතකය',
    story: '',
    image: 'assets/stories/s117.jpg',
    tags: ['', 'Bandhana Mokkha', 'බන්‍ධන මොක්ඛ', '117']);

final _tale118 = Tale(
    id: 118,
    title: 'කුසනාලි ජාතකය',
    story: '',
    image: 'assets/stories/s118.jpg',
    tags: ['', 'Kusanali', 'කුසනාලි', '118']);

final _tale119 = Tale(
    id: 119,
    title: 'දුමෙමධ ජාතකය',
    story: '',
    image: 'assets/stories/s119.jpg',
    tags: ['', 'Dumemadha', 'දුමෙමධ', '119']);

final _tale120 = Tale(
    id: 120,
    title: 'නගුලිස ජාතකය',
    story: '',
    image: 'assets/stories/s120.jpg',
    tags: ['', 'Nagulisa', 'නගුලිස', '120']);

final _tale121 = Tale(
    id: 121,
    title: 'අඹ ජාතකය',
    story: '',
    image: 'assets/stories/s121.jpg',
    tags: ['', 'Amba', 'අඹ', '121']);

final _tale122 = Tale(
    id: 122,
    title: 'කටාහක ජාතකය',
    story: '',
    image: 'assets/stories/s122.jpg',
    tags: ['', 'Katahaka', 'කටාහක', '122']);

final _tale123 = Tale(
    id: 123,
    title: 'චන්‍දා භය ජාතකය',
    story: '',
    image: 'assets/stories/s123.jpg',
    tags: ['', '', 'චන්‍දා භය', '123']);

final _tale124 = Tale(
    id: 124,
    title: 'ප්‍රථම පුෂ්පරත්න ජාතකය',
    story: '',
    image: 'assets/stories/s124.jpg',
    tags: ['', '', 'ප්‍රථම පුෂ්පරත්න', '124']);

final _tale125 = Tale(
    id: 125,
    title: 'අසිලකඛණ ජාතකය',
    story: '',
    image: 'assets/stories/s125.jpg',
    tags: ['', 'Asilakkana', 'අසිලකඛණ', '125']);

final _tale126 = Tale(
    id: 126,
    title: 'කලණ්ඩුක ජාතකය',
    story: '',
    image: 'assets/stories/s126.jpg',
    tags: ['', 'Kalanduka', 'කලණ්ඩුක', '126']);

final _tale127 = Tale(
    id: 127,
    title: 'බිළාර ජාතකය',
    story: '',
    image: 'assets/stories/s127.jpg',
    tags: ['', 'Bilaara', 'බිළාර', '127']);

final _tale128 = Tale(
    id: 128,
    title: 'අග්ගිදත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s128.jpg',
    tags: ['', 'Aggidaththa', 'අග්ගිදත්ත', '128']);

final _tale129 = Tale(
    id: 129,
    title: 'කෝසිය ජාතකය',
    story: '',
    image: 'assets/stories/s129.jpg',
    tags: ['', 'Kosiya', 'කෝසිය', '129']);

final _tale130 = Tale(
    id: 130,
    title: 'අසපදාන ජාතකය',
    story: '',
    image: 'assets/stories/s130.jpg',
    tags: ['', '', 'අසපදාන', '130']);

final _tale131 = Tale(
    id: 131,
    title: 'පඤ්චගරු ජාතකය',
    story: '',
    image: 'assets/stories/s131.jpg',
    tags: ['', '', 'පඤ්චගරු', '131']);

final _tale132 = Tale(
    id: 132,
    title: 'ඝසන ජාතකය',
    story: '',
    image: 'assets/stories/s132.jpg',
    tags: ['', 'Ghatasana', 'ඝසන', '132']);

final _tale133 = Tale(
    id: 133,
    title: 'ස්වර්ණ හංස ජාතකය',
    story: '',
    image: 'assets/stories/s133.jpg',
    tags: ['', 'Swarna Hansa', 'ස්වර්ණ හංස', '133']);

final _tale134 = Tale(
    id: 134,
    title: 'බබ්බු ජාතකය',
    story: '',
    image: 'assets/stories/s134.jpg',
    tags: ['', 'Babbu', 'බබ්බු', '134']);

final _tale135 = Tale(
    id: 135,
    title: 'ගොධ ජාතකය',
    story: '',
    image: 'assets/stories/s135.jpg',
    tags: ['', 'Godha', 'ගොධ', '135']);

final _tale136 = Tale(
    id: 136,
    title: 'උභය භ්‍රෂ්ට ජාතකය',
    story: '',
    image: 'assets/stories/s136.jpg',
    tags: ['', '', 'උභය භ්‍රෂ්ට', '136']);

final _tale137 = Tale(
    id: 137,
    title: 'කාක ජාතකය',
    story: '',
    image: 'assets/stories/s137.jpg',
    tags: ['', 'Kaka', 'කාක', '137']);

final _tale138 = Tale(
    id: 138,
    title: 'රිතීය ගොධ ජාතකය',
    story: '',
    image: 'assets/stories/s138.jpg',
    tags: ['', 'Reethiya Godha', 'රිතීය ගොධ', '138']);

final _tale139 = Tale(
    id: 139,
    title: 'රිතීය සිගාල ජාතකය',
    story: '',
    image: 'assets/stories/s139.jpg',
    tags: ['', '', 'රිතීය සිගාල', '139']);

final _tale140 = Tale(
    id: 140,
    title: 'රිරොචන ජාතකය',
    story: '',
    image: 'assets/stories/s140.jpg',
    tags: ['', '', 'රිරොචන', '140']);

final _tale141 = Tale(
    id: 141,
    title: 'නං ගුඨ ජාතකය',
    story: '',
    image: 'assets/stories/s141.jpg',
    tags: ['', 'Nan Guttha', 'නං ගුඨ', '141']);

final _tale142 = Tale(
    id: 142,
    title: 'රාධ ජාතකය',
    story: '',
    image: 'assets/stories/s142.jpg',
    tags: ['', 'Radha', 'රාධ', '142']);

final _tale143 = Tale(
    id: 143,
    title: 'කාක ජාතකය',
    story: '',
    image: 'assets/stories/s143.jpg',
    tags: ['', '', 'කාක', '143']);

final _tale144 = Tale(
    id: 144,
    title: 'රිතීය පුෂ්ප රත්න ජාතකය',
    story: '',
    image: 'assets/stories/s144.jpg',
    tags: ['', '', 'රිතීය පුෂ්ප රත්න', '144']);

final _tale145 = Tale(
    id: 145,
    title: 'තෘතීය සිහාල ජාතකය',
    story: '',
    image: 'assets/stories/s145.jpg',
    tags: ['', 'Sigala', 'තෘතීය සිහාල', '145']);

final _tale146 = Tale(
    id: 146,
    title: 'රිරොචන ජාතකය',
    story: '',
    image: 'assets/stories/s146.jpg',
    tags: ['', '', 'රිරොචන', '146']);

final _tale147 = Tale(
    id: 147,
    title: 'සංෂවක ජාතකය',
    story: '',
    image: 'assets/stories/s147.jpg',
    tags: ['', '', 'සංෂවක', '147']);

final _tale148 = Tale(
    id: 148,
    title: 'රාජොවාද ජාතකය',
    story: '',
    image: 'assets/stories/s148.jpg',
    tags: ['', 'Rajovada', 'රාජොවාද', '148']);

final _tale149 = Tale(
    id: 149,
    title: 'චතුත්‍ර්‍ථ සිහාල ජාතකය',
    story: '',
    image: 'assets/stories/s149.jpg',
    tags: ['', 'Chathuththi Sigala', 'චතුත්‍ර්‍ථ සිහාල', '149']);

final _tale150 = Tale(
    id: 150,
    title: 'සූකර ජාතකය',
    story: '',
    image: 'assets/stories/s150.jpg',
    tags: ['', 'Sukara', 'සූකර', '150']);

final _tale151 = Tale(
    id: 151,
    title: 'උරඟ ජාතකය',
    story: '',
    image: 'assets/stories/s151.jpg',
    tags: ['', 'Uraga', 'උරඟ', '151']);

final _tale152 = Tale(
    id: 152,
    title: 'ගග්ග ජාතකය',
    story: '',
    image: 'assets/stories/s152.jpg',
    tags: ['', 'Gagga', 'ගග්ග', '152']);

final _tale153 = Tale(
    id: 153,
    title: 'අලීන චිත්ත  ජාතකය',
    story: '',
    image: 'assets/stories/s153.jpg',
    tags: ['', 'Alinacitta', 'අලීන චිත්ත', '153']);

final _tale154 = Tale(
    id: 154,
    title: 'ගුණ ජාතකය',
    story: '',
    image: 'assets/stories/s154.jpg',
    tags: ['', 'Guna', 'ගුණ', '154']);

final _tale155 = Tale(
    id: 155,
    title: 'සුහනු ජාතකය',
    story: '',
    image: 'assets/stories/s155.jpg',
    tags: ['', 'Sahunu', 'සුහනු', '155']);

final _tale156 = Tale(
    id: 156,
    title: 'සවණී මයුර ජාතකය',
    story: '',
    image: 'assets/stories/s156.jpg',
    tags: ['', '', 'සවණී මයුර', '156']);

final _tale157 = Tale(
    id: 157,
    title: 'රිනිල ජාතකය',
    story: '',
    image: 'assets/stories/s157.jpg',
    tags: ['', '', 'රිනිල', '157']);

final _tale158 = Tale(
    id: 158,
    title: 'ඉන්‍දගුත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s158.jpg',
    tags: ['', '', 'ඉන්‍දගුත්ත', '158']);

final _tale159 = Tale(
    id: 159,
    title: 'සන්ථ ජාතකය',
    story: '',
    image: 'assets/stories/s159.jpg',
    tags: ['', 'Santha', 'සන්ථ', '159']);

final _tale160 = Tale(
    id: 160,
    title: 'සුසීම ජාතකය',
    story: '',
    image: 'assets/stories/s160.jpg',
    tags: ['', 'Susima', 'සුසීම', '160']);

final _tale161 = Tale(
    id: 161,
    title: 'නකුල ජාතකය',
    story: '',
    image: 'assets/stories/s161.jpg',
    tags: ['', 'Nakula', 'නකුල', '161']);

final _tale162 = Tale(
    id: 162,
    title: 'උප සාල්හක ජාතකය',
    story: '',
    image: 'assets/stories/s162.jpg',
    tags: ['', 'Upa Saalhaka', 'උප සාල්හක', '162']);

final _tale163 = Tale(
    id: 163,
    title: 'සමිඬි ජාතකය',
    story: '',
    image: 'assets/stories/s163.jpg',
    tags: ['', 'Samidhi', 'සමිඬි', '163']);

final _tale164 = Tale(
    id: 164,
    title: 'සකුනග්ඝී ජාතකය',
    story: '',
    image: 'assets/stories/s164.jpg',
    tags: ['', 'Sakunagghi', 'සකුනග්ඝී', '164']);

final _tale165 = Tale(
    id: 165,
    title: 'අරක ජාතකය',
    story: '',
    image: 'assets/stories/s165.jpg',
    tags: ['', 'Araka', 'අරක', '165']);

final _tale166 = Tale(
    id: 166,
    title: 'කල්‍යාණ ජාතකය',
    story: '',
    image: 'assets/stories/s166.jpg',
    tags: ['', 'Kalyana Dhamma', 'කල්‍යාණ', '166']);

final _tale167 = Tale(
    id: 167,
    title: 'දද්දර ජාතකය',
    story: '',
    image: 'assets/stories/s167.jpg',
    tags: ['', 'Daddara', 'දද්දර', '167']);

final _tale168 = Tale(
    id: 168,
    title: 'මර්‍කට ජාතකය',
    story: '',
    image: 'assets/stories/s168.jpg',
    tags: ['', 'Makkata', 'මර්‍කට', '168']);

final _tale169 = Tale(
    id: 169,
    title: 'දුතිය මක්කට ජාතකය',
    story: '',
    image: 'assets/stories/s169.jpg',
    tags: ['', 'Duthiya Makkata', 'දුතිය මක්කට', '169']);

final _tale170 = Tale(
    id: 170,
    title: 'ආර්ඳා්චුපඨාන ජාතකය',
    story: '',
    image: 'assets/stories/s170.jpg',
    tags: ['', 'Ardochupatthana', 'ආර්ඳා්චුපඨාන', '170']);

final _tale171 = Tale(
    id: 171,
    title: 'කලහමුජ් ජාතකය',
    story: '',
    image: 'assets/stories/s171.jpg',
    tags: ['', 'Kalahamujja', 'කලහමුජ්', '171']);

final _tale172 = Tale(
    id: 172,
    title: 'දද්දර ජාතකය',
    story: '',
    image: 'assets/stories/s172.jpg',
    tags: ['', 'Duddara', 'දද්දර', '172']);

final _tale173 = Tale(
    id: 173,
    title: 'අනභිරත ජාතකය',
    story: '',
    image: 'assets/stories/s173.jpg',
    tags: ['', 'Anabhirata', 'අනභිරත', '173']);

final _tale174 = Tale(
    id: 174,
    title: 'චතුමුට්ට ජාතකය',
    story: '',
    image: 'assets/stories/s174.jpg',
    tags: ['', 'Chathumutta', 'චතුමුට්ට', '174']);

final _tale175 = Tale(
    id: 175,
    title: 'සීහචම ජාතකය',
    story: '',
    image: 'assets/stories/s175.jpg',
    tags: ['', 'Sihachamma', 'සීහචම', '175']);

final _tale176 = Tale(
    id: 176,
    title: 'රුහක ජාතකය',
    story: '',
    image: 'assets/stories/s176.jpg',
    tags: ['', 'Ruhaka', 'රුහක', '176']);

final _tale177 = Tale(
    id: 177,
    title: 'මිත්තා මිත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s177.jpg',
    tags: ['', 'Miththa Mitta', 'මිත්තා මිත්ත', '177']);

final _tale178 = Tale(
    id: 178,
    title: 'ගිරි දත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s178.jpg',
    tags: ['', 'Giridatta', 'ගිරි දත්ත', '178']);

final _tale179 = Tale(
    id: 179,
    title: 'තින්ක ජාතකය',
    story: '',
    image: 'assets/stories/s179.jpg',
    tags: ['', 'Tinka', 'තින්ක', '179']);

final _tale180 = Tale(
    id: 180,
    title: 'ගිජ්ඣ ජාතකය',
    story: '',
    image: 'assets/stories/s180.jpg',
    tags: ['', '', 'ගිජ්ඣ', '180']);

final _tale181 = Tale(
    id: 181,
    title: 'කචඡප ජාතකය',
    story: '',
    image: 'assets/stories/s181.jpg',
    tags: ['', 'Kachchapa', 'කචඡප', '181']);

final _tale182 = Tale(
    id: 182,
    title: 'සත්ත ධර්‍ම ජාතකය',
    story: '',
    image: 'assets/stories/s182.jpg',
    tags: ['', 'Saththa Dhamma', 'සත්ත ධර්‍ම', '182']);

final _tale183 = Tale(
    id: 183,
    title: 'අසදෘස ජාතකය',
    story: '',
    image: 'assets/stories/s183.jpg',
    tags: ['', 'Asadrusa', 'අසදෘස', '183']);

final _tale184 = Tale(
    id: 184,
    title: 'සංගාමාවචර ජාතකය',
    story: '',
    image: 'assets/stories/s184.jpg',
    tags: ['', 'Sangaamaavachara', 'සංගාමාවචර', '184']);

final _tale185 = Tale(
    id: 185,
    title: 'වාළොදක ජාතකය',
    story: '',
    image: 'assets/stories/s185.jpg',
    tags: ['', 'Valodaka', 'වාළොදක', '185']);

final _tale186 = Tale(
    id: 186,
    title: 'දධිවාහන ජාතකය',
    story: '',
    image: 'assets/stories/s186.jpg',
    tags: ['', 'Dadhivahana', 'දධිවාහන', '186']);

final _tale187 = Tale(
    id: 187,
    title: 'ශීලානිසංශ ජාතකය',
    story: '',
    image: 'assets/stories/s187.jpg',
    tags: ['', 'Shilanisansha', 'ශීලානිසංශ', '187']);

final _tale188 = Tale(
    id: 188,
    title: 'චුල්ල පදුම ජාතකය',
    story: '',
    image: 'assets/stories/s188.jpg',
    tags: ['', 'Chulla Paduma', 'චුල්ල පදුම', '188']);

final _tale189 = Tale(
    id: 189,
    title: 'මණිචොර ජාතකය',
    story: '',
    image: 'assets/stories/s189.jpg',
    tags: ['', 'Manichora', 'මණිචොර', '189']);

final _tale190 = Tale(
    id: 190,
    title: 'පර්‍වතුත්‍ථ ජාතකය',
    story: '',
    image: 'assets/stories/s190.jpg',
    tags: ['', '', 'පර්‍වතුත්‍ථ', '190']);

final _tale191 = Tale(
    id: 191,
    title: 'වලාහක ජාතකය',
    story: '',
    image: 'assets/stories/s191.jpg',
    tags: ['', '', 'වලාහක', '191']);

final _tale192 = Tale(
    id: 192,
    title: 'ගෘහපති ජාතකය',
    story: '',
    image: 'assets/stories/s192.jpg',
    tags: ['', 'Gahapati', 'ගෘහපති', '192']);

final _tale193 = Tale(
    id: 193,
    title: 'සාධුශීල ජාතකය',
    story: '',
    image: 'assets/stories/s193.jpg',
    tags: ['', 'Sadhusila', 'සාධුශීල', '193']);

final _tale194 = Tale(
    id: 194,
    title: 'බන්‍ධනාගාර ජාතකය',
    story: '',
    image: 'assets/stories/s194.jpg',
    tags: ['', 'Bandhanagara', 'බන්‍ධනාගාර', '194']);

final _tale195 = Tale(
    id: 195,
    title: 'කෙළිසීල ජාතකය',
    story: '',
    image: 'assets/stories/s195.jpg',
    tags: ['', 'Keli sila', 'කෙළිසීල', '195']);

final _tale196 = Tale(
    id: 196,
    title: 'ඛන්‍ධකවර්‍ත ජාතකය',
    story: '',
    image: 'assets/stories/s196.jpg',
    tags: ['', 'Khandha Vatta', 'ඛන්‍ධකවර්‍ත', '196']);

final _tale197 = Tale(
    id: 197,
    title: 'වීරක ජාතකය',
    story: '',
    image: 'assets/stories/s197.jpg',
    tags: ['', 'Viraka', 'වීරක', '197']);

final _tale198 = Tale(
    id: 198,
    title: 'ගඞෙගය්‍ය ජාතකය',
    story: '',
    image: 'assets/stories/s198.jpg',
    tags: ['', 'Gangeyya', 'ගඞෙගය්‍ය', '198']);

final _tale199 = Tale(
    id: 199,
    title: 'වීතිය කුරුඞග මිග ජාතකය',
    story: '',
    image: 'assets/stories/s199.jpg',
    tags: ['', 'Kurungamiga', 'වීතිය කුරුඞග මිග', '199']);

final _tale200 = Tale(
    id: 200,
    title: 'අස්සක ජාතකය',
    story: '',
    image: 'assets/stories/s200.jpg',
    tags: ['', 'Assaka', 'අස්සක', '200']);

final _tale201 = Tale(
    id: 201,
    title: 'සුංසුමාර ජාතකය',
    story: '',
    image: 'assets/stories/s201.jpg',
    tags: ['', 'Sunsumara', 'සුංසුමාර', '201']);

final _tale202 = Tale(
    id: 202,
    title: 'කක්කර ජාතකය',
    story: '',
    image: 'assets/stories/s202.jpg',
    tags: ['', 'Kakkara', 'කක්කර', '202']);

final _tale203 = Tale(
    id: 203,
    title: 'කන්ද ගලක ජාතකය',
    story: '',
    image: 'assets/stories/s203.jpg',
    tags: ['', 'Kanda Galaka', 'කන්ද ගලක', '203']);

final _tale204 = Tale(
    id: 204,
    title: 'සෝමදත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s204.jpg',
    tags: ['', 'Somadatta', 'සෝමදත්ත', '204']);

final _tale205 = Tale(
    id: 205,
    title: 'උච්චිඪභත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s205.jpg',
    tags: ['', 'Uchchiditabhatta', 'උච්චිඪභත්ත', '205']);

final _tale206 = Tale(
    id: 206,
    title: 'භරු ජාතකය',
    story: '',
    image: 'assets/stories/s206.jpg',
    tags: ['', 'Bharu', 'භරු', '206']);

final _tale207 = Tale(
    id: 207,
    title: 'පුණ්ණ නි ජාතකය',
    story: '',
    image: 'assets/stories/s207.jpg',
    tags: ['', 'Punna Ni', 'පුණ්ණ නි', '207']);

final _tale208 = Tale(
    id: 208,
    title: 'කච්ඡප ජාතකය',
    story: '',
    image: 'assets/stories/s208.jpg',
    tags: ['', 'Kachchapa', 'කච්ඡප', '208']);

final _tale209 = Tale(
    id: 209,
    title: 'මච්ඡ ජාතකය',
    story: '',
    image: 'assets/stories/s209.jpg',
    tags: ['', 'Machcha', 'මච්ඡ', '209']);

final _tale210 = Tale(
    id: 210,
    title: 'සෙග්ගු ජාතකය',
    story: '',
    image: 'assets/stories/s210.jpg',
    tags: ['', 'Seggu', 'සෙග්ගු', '210']);

final _tale211 = Tale(
    id: 211,
    title: 'වීතීය කූට වානිජ ජාතකය',
    story: '',
    image: 'assets/stories/s211.jpg',
    tags: ['', 'Vithiya Kuta Wanija', 'වීතීය කූට වානිජ', '211']);

final _tale212 = Tale(
    id: 212,
    title: 'ගරහිත ජාතකය',
    story: '',
    image: 'assets/stories/s212.jpg',
    tags: ['', 'Garahitha', 'ගරහිත', '212']);

final _tale213 = Tale(
    id: 213,
    title: 'ධර්‍මධවජ ජාතකය',
    story: '',
    image: 'assets/stories/s213.jpg',
    tags: ['', 'Dharmadhawaja', 'ධර්‍මධවජ', '213']);

final _tale214 = Tale(
    id: 214,
    title: 'කාසාව ජාතකය',
    story: '',
    image: 'assets/stories/s214.jpg',
    tags: ['', 'Kasawa', 'කාසාව', '214']);

final _tale215 = Tale(
    id: 215,
    title: 'චුල්ලනන්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s215.jpg',
    tags: ['', 'Chullananda', 'චුල්ලනන්‍ද', '215']);

final _tale216 = Tale(
    id: 216,
    title: 'පුටභත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s216.jpg',
    tags: ['', 'Putabhaththa', 'පුටභත්ත', '216']);

final _tale217 = Tale(
    id: 217,
    title: 'ඛත්තීය වණ්ණ ජාතකය',
    story: '',
    image: 'assets/stories/s217.jpg',
    tags: ['', 'Kaththeeya Wanna', 'ඛත්තීය වණ්ණ', '217']);

final _tale218 = Tale(
    id: 218,
    title: 'කොසිය ජාතකය',
    story: '',
    image: 'assets/stories/s218.jpg',
    tags: ['', 'Kosiya', 'කොසිය', '218']);

final _tale219 = Tale(
    id: 219,
    title: 'ගූථපාණී ජාතකය',
    story: '',
    image: 'assets/stories/s219.jpg',
    tags: ['', 'Guthapaani', 'ගූථපාණී', '219']);

final _tale220 = Tale(
    id: 220,
    title: 'කාමනීය ජාතකය',
    story: '',
    image: 'assets/stories/s220.jpg',
    tags: ['', 'Kamaneeya', 'කාමනීය', '220']);

final _tale221 = Tale(
    id: 221,
    title: 'පලාස ජාතකය',
    story: '',
    image: 'assets/stories/s221.jpg',
    tags: ['', 'Palaasa', 'පලාස', '221']);

final _tale222 = Tale(
    id: 222,
    title: 'වීතිය පලාස ජාතකය',
    story: '',
    image: 'assets/stories/s222.jpg',
    tags: ['', 'Vithiya Palaasa', 'වීතිය පලාස', '222']);

final _tale223 = Tale(
    id: 223,
    title: 'උපාහන ජාතකය',
    story: '',
    image: 'assets/stories/s223.jpg',
    tags: ['', 'Upahana', 'උපාහන', '223']);

final _tale224 = Tale(
    id: 224,
    title: 'වෙණ්ණුථුන ජාතකය',
    story: '',
    image: 'assets/stories/s224.jpg',
    tags: ['', 'Vinathuna', 'වෙණ්ණුථුන', '224']);

final _tale225 = Tale(
    id: 225,
    title: 'විකණ්ණව ජාතකය',
    story: '',
    image: 'assets/stories/s225.jpg',
    tags: ['', 'Vikannaka', 'විකණ්ණව', '225']);

final _tale226 = Tale(
    id: 226,
    title: 'අහිතාබු ජාතකය',
    story: '',
    image: 'assets/stories/s226.jpg',
    tags: ['', 'Asitabhu', 'අහිතාබු', '226']);

final _tale227 = Tale(
    id: 227,
    title: 'වචඡනඛ ජාතකය',
    story: '',
    image: 'assets/stories/s227.jpg',
    tags: ['', 'Vacchanakha', 'වචඡනඛ', '227']);

final _tale228 = Tale(
    id: 228,
    title: 'බක ජාතකය',
    story: '',
    image: 'assets/stories/s228.jpg',
    tags: ['', 'Baka', 'බක', '228']);

final _tale229 = Tale(
    id: 229,
    title: 'සාකෙත ජාතකය',
    story: '',
    image: 'assets/stories/s229.jpg',
    tags: ['', 'Saketha', 'සාකෙත', '229']);

final _tale230 = Tale(
    id: 230,
    title: 'එකපාද ජාතකය',
    story: '',
    image: 'assets/stories/s230.jpg',
    tags: ['', 'Ekapaada', 'එකපාද', '230']);

final _tale231 = Tale(
    id: 231,
    title: 'හරිතමෘත ජාතකය',
    story: '',
    image: 'assets/stories/s231.jpg',
    tags: ['', 'Harithamrutha', 'හරිතමෘත', '231']);

final _tale232 = Tale(
    id: 232,
    title: 'මහා පිඞගල ජාතකය',
    story: '',
    image: 'assets/stories/s232.jpg',
    tags: ['', 'Maha Pindagala', 'මහා පිඞගල', '232']);

final _tale233 = Tale(
    id: 233,
    title: 'සර්‍වදාඨක ජාතකය',
    story: '',
    image: 'assets/stories/s233.jpg',
    tags: ['', 'Sarwadhataka', 'සර්‍වදාඨක', '233']);

final _tale234 = Tale(
    id: 234,
    title: 'සුනඛ ජාතකය',
    story: '',
    image: 'assets/stories/s234.jpg',
    tags: ['', 'Sunakha', 'සුනඛ', '234']);

final _tale235 = Tale(
    id: 235,
    title: 'වීතිවච්ඡ ජාතකය',
    story: '',
    image: 'assets/stories/s235.jpg',
    tags: ['', 'Weethwachcha', 'වීතිවච්ඡ', '235']);

final _tale236 = Tale(
    id: 236,
    title: 'මූලපරියාය ජාතකය',
    story: '',
    image: 'assets/stories/s236.jpg',
    tags: ['', 'Muulapariyaya', 'මූලපරියාය', '236']);

final _tale237 = Tale(
    id: 237,
    title: 'තෙලොවාද ජාතකය',
    story: '',
    image: 'assets/stories/s237.jpg',
    tags: ['', 'Thelowada', 'තෙලොවාද', '237']);

final _tale238 = Tale(
    id: 238,
    title: 'පාදාංජලී ජාතකය',
    story: '',
    image: 'assets/stories/s238.jpg',
    tags: ['', 'Paadaanjali', 'පාදාංජලී', '238']);

final _tale239 = Tale(
    id: 239,
    title: 'කිංසුකෝපම ජාතකය',
    story: '',
    image: 'assets/stories/s239.jpg',
    tags: ['', 'Kinsukopama', 'කිංසුකෝපම', '239']);

final _tale240 = Tale(
    id: 240,
    title: 'සාල ජාතකය',
    story: '',
    image: 'assets/stories/s240.jpg',
    tags: ['', 'Saala', 'සාල', '240']);

final _tale241 = Tale(
    id: 241,
    title: 'කපි ජාතකය',
    story: '',
    image: 'assets/stories/s241.jpg',
    tags: ['', 'Kapi', 'කපි', '241']);

final _tale242 = Tale(
    id: 242,
    title: 'සුව ජාතකය',
    story: '',
    image: 'assets/stories/s242.jpg',
    tags: ['', 'Suwa', 'සුව', '242']);

final _tale243 = Tale(
    id: 243,
    title: 'ජරූදපාන ජාතකය',
    story: '',
    image: 'assets/stories/s243.jpg',
    tags: ['', 'Jarudapaana', 'ජරූදපාන', '243']);

final _tale244 = Tale(
    id: 244,
    title: 'සංකප්ප ජාතකය',
    story: '',
    image: 'assets/stories/s244.jpg',
    tags: ['', 'Sankappa', 'සංකප්ප', '244']);

final _tale245 = Tale(
    id: 245,
    title: 'තිලමුට්ටි ජාතකය',
    story: '',
    image: 'assets/stories/s245.jpg',
    tags: ['', 'Thilamutti', 'තිලමුට්ටි', '245']);

final _tale246 = Tale(
    id: 246,
    title: 'මණිකණ්ඨ ජාතකය',
    story: '',
    image: 'assets/stories/s246.jpg',
    tags: ['', 'Manikanta', 'මණිකණ්ඨ', '246']);

final _tale247 = Tale(
    id: 247,
    title: 'කුඩකකුච්ඡසින්‍ධව ජාතකය',
    story: '',
    image: 'assets/stories/s247.jpg',
    tags: ['', 'Kudakakuchchasindhawa', 'කුඩකකුච්ඡසින්‍ධව', '247']);

final _tale248 = Tale(
    id: 248,
    title: 'මහා මන්ධාතු ජාතකය',
    story: '',
    image: 'assets/stories/s248.jpg',
    tags: ['', 'Maha Mandhathu', 'මහා මන්ධාතු', '248']);

final _tale249 = Tale(
    id: 249,
    title: 'කිරිටව්ච්ඡ ජාතකය',
    story: '',
    image: 'assets/stories/s249.jpg',
    tags: ['', 'Kiritawwachcha', 'කිරිටව්ච්ඡ', '249']);

final _tale250 = Tale(
    id: 250,
    title: 'දුත ජාතකය',
    story: '',
    image: 'assets/stories/s250.jpg',
    tags: ['', 'Dutha', 'දුත', '250']);

final _tale251 = Tale(
    id: 251,
    title: 'පදුම ජාතකය',
    story: '',
    image: 'assets/stories/s251.jpg',
    tags: ['', 'Paduma', 'පදුම', '251']);

final _tale252 = Tale(
    id: 252,
    title: 'මුදුපාණී ජාතකය',
    story: '',
    image: 'assets/stories/s252.jpg',
    tags: ['', 'Mudupaani', 'මුදුපාණී', '252']);

final _tale253 = Tale(
    id: 253,
    title: 'වීතීය සංකප්ප ජාතකය',
    story: '',
    image: 'assets/stories/s253.jpg',
    tags: ['', 'Vitheeya Sankappa', 'වීතීය සංකප්ප', '253']);

final _tale254 = Tale(
    id: 254,
    title: 'මහාපනාද ජාතකය',
    story: '',
    image: 'assets/stories/s254.jpg',
    tags: ['', 'Mahapanada', 'මහාපනාද', '254']);

final _tale255 = Tale(
    id: 255,
    title: 'කුරග්ග ජාතකය',
    story: '',
    image: 'assets/stories/s255.jpg',
    tags: ['', 'Kuragga', 'කුරග්ග', '255']);

final _tale256 = Tale(
    id: 256,
    title: 'වාත සෛන්‍ධව ජාතකය',
    story: '',
    image: 'assets/stories/s256.jpg',
    tags: ['', 'Watha Saindhawa', 'වාත සෛන්‍ධව', '256']);

final _tale257 = Tale(
    id: 257,
    title: 'කර්‍කටක ජාතකය',
    story: '',
    image: 'assets/stories/s257.jpg',
    tags: ['', 'Karkataka', 'කර්‍කටක', '257']);

final _tale258 = Tale(
    id: 258,
    title: 'වීතිය ආරාම ද්‍ධෂක ජාතකය',
    story: '',
    image: 'assets/stories/s258.jpg',
    tags: ['', 'Vithiya Aarama Dhdhashaka', 'වීතිය ආරාම ද්‍ධෂක', '258']);

final _tale259 = Tale(
    id: 259,
    title: 'සුජාත ජාතකය',
    story: '',
    image: 'assets/stories/s259.jpg',
    tags: ['', 'Sujatha', 'සුජාත', '259']);

final _tale260 = Tale(
    id: 260,
    title: 'කාක උඵෑක ජාතකය',
    story: '',
    image: 'assets/stories/s260.jpg',
    tags: ['', 'Kaka Ueaka', 'කාක උඵෑක', '260']);

final _tale261 = Tale(
    id: 261,
    title: 'උදපාන දුසක ජාතකය',
    story: '',
    image: 'assets/stories/s261.jpg',
    tags: ['', 'Udapaana Dusaka', 'උදපාන දුසක', '261']);

final _tale262 = Tale(
    id: 262,
    title: 'ව්‍යාඝ්‍ර ජාතකය',
    story: '',
    image: 'assets/stories/s262.jpg',
    tags: ['', 'Wyagra', 'ව්‍යාඝ්‍ර', '262']);

final _tale263 = Tale(
    id: 263,
    title: 'තෘතීය කච්ඡප ජාතකය',
    story: '',
    image: 'assets/stories/s263.jpg',
    tags: ['', 'Thruthiya Kachchapa', 'තෘතීය කච්ඡප', '263']);

final _tale264 = Tale(
    id: 264,
    title: 'ලොල ජාතකය',
    story: '',
    image: 'assets/stories/s264.jpg',
    tags: ['', 'Lola', 'ලොල', '264']);

final _tale265 = Tale(
    id: 265,
    title: 'දුලුසි රාජ ජාතකය',
    story: '',
    image: 'assets/stories/s265.jpg',
    tags: ['', 'Dulusi Raja', 'දුලුසි රාජ', '265']);

final _tale266 = Tale(
    id: 266,
    title: 'කුරුධර්‍ම ජාතකය',
    story: '',
    image: 'assets/stories/s266.jpg',
    tags: ['', 'Kurudharma', 'කුරුධර්‍ම', '266']);

final _tale267 = Tale(
    id: 267,
    title: 'රොම ජාතකය',
    story: '',
    image: 'assets/stories/s267.jpg',
    tags: ['', 'Roma', 'රොම', '267']);

final _tale268 = Tale(
    id: 268,
    title: 'මහීස ජාතකය',
    story: '',
    image: 'assets/stories/s268.jpg',
    tags: ['', 'Mahisa', 'මහීස', '268']);

final _tale269 = Tale(
    id: 269,
    title: 'සතපත්‍ර ජාතකය',
    story: '',
    image: 'assets/stories/s269.jpg',
    tags: ['', 'Sathpathra', 'සතපත්‍ර', '269']);

final _tale270 = Tale(
    id: 270,
    title: 'කූටසාක ජාතකය',
    story: '',
    image: 'assets/stories/s270.jpg',
    tags: ['', 'Kutasaaka', 'කූටසාක', '270']);

final _tale271 = Tale(
    id: 271,
    title: 'ලාභගරු ජාතකය',
    story: '',
    image: 'assets/stories/s271.jpg',
    tags: ['', 'Labhagaru', 'ලාභගරු', '271']);

final _tale272 = Tale(
    id: 272,
    title: 'සාලොහිත ජාතකය',
    story: '',
    image: 'assets/stories/s272.jpg',
    tags: ['', 'Salohitha', 'සාලොහිත', '272']);

final _tale273 = Tale(
    id: 273,
    title: 'කාම විලෝපන ජාතකය',
    story: '',
    image: 'assets/stories/s273.jpg',
    tags: ['', 'Kaama Vilopana', 'කාම විලෝපන', '273']);

final _tale274 = Tale(
    id: 274,
    title: 'අභ්‍යන්තර ජාතකය',
    story: '',
    image: 'assets/stories/s274.jpg',
    tags: ['', 'Abhyanthara', 'අභ්‍යන්තර', '274']);

final _tale275 = Tale(
    id: 275,
    title: 'සෙය්‍යංස ජාතකය',
    story: '',
    image: 'assets/stories/s275.jpg',
    tags: ['', 'Saiyansa', 'සෙය්‍යංස', '275']);

final _tale276 = Tale(
    id: 276,
    title: 'වඩ්ඪසූකර ජාතකය',
    story: '',
    image: 'assets/stories/s276.jpg',
    tags: ['', 'WadtaSukara', 'වඩ්ඪසූකර', '276']);

final _tale277 = Tale(
    id: 277,
    title: 'සිරි ජාතකය',
    story: '',
    image: 'assets/stories/s277.jpg',
    tags: ['', 'Siri', 'සිරි', '277']);

final _tale278 = Tale(
    id: 278,
    title: 'මණි සූකර ජාතකය',
    story: '',
    image: 'assets/stories/s278.jpg',
    tags: ['', 'Mani Sukara', 'මණි සූකර', '278']);

final _tale279 = Tale(
    id: 279,
    title: 'මච්ඡවාර ජාතකය',
    story: '',
    image: 'assets/stories/s279.jpg',
    tags: ['', 'Machchawaara', 'මච්ඡවාර', '279']);

final _tale280 = Tale(
    id: 280,
    title: 'නානාච්ඡන්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s280.jpg',
    tags: ['', 'Nanachchanda', 'නානාච්ඡන්‍ද', '280']);

final _tale281 = Tale(
    id: 281,
    title: 'තිය ශීලරිමංස ජාතකය',
    story: '',
    image: 'assets/stories/s281.jpg',
    tags: ['', 'Thiya Sheelarimansa', 'තිය ශීලරිමංස', '281']);

final _tale282 = Tale(
    id: 282,
    title: 'භද්දඝට ජාතකය',
    story: '',
    image: 'assets/stories/s282.jpg',
    tags: ['', 'Bhaddaghata', 'භද්දඝට', '282']);

final _tale283 = Tale(
    id: 283,
    title: 'සුපත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s283.jpg',
    tags: ['', 'Supaththa', 'සුපත්ත', '283']);

final _tale284 = Tale(
    id: 284,
    title: 'ජඹුඛාද ජාතකය',
    story: '',
    image: 'assets/stories/s284.jpg',
    tags: ['', 'Jambukhada', 'ජඹුඛාද', '284']);

final _tale285 = Tale(
    id: 285,
    title: 'කායවිච්ඡන්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s285.jpg',
    tags: ['', 'Kayawichanda', 'කායවිච්ඡන්‍ද', '285']);

final _tale286 = Tale(
    id: 286,
    title: 'අන්ත ජාතකය',
    story: '',
    image: 'assets/stories/s286.jpg',
    tags: ['', 'Antha', 'අන්ත', '286']);

final _tale287 = Tale(
    id: 287,
    title: 'සමුද්‍ර ජාතකය',
    story: '',
    image: 'assets/stories/s287.jpg',
    tags: ['', 'Samudra', 'සමුද්‍ර', '287']);

final _tale288 = Tale(
    id: 288,
    title: 'උදුඹර ජාතකය',
    story: '',
    image: 'assets/stories/s288.jpg',
    tags: ['', 'Udumbara', 'උදුඹර', '288']);

final _tale289 = Tale(
    id: 289,
    title: 'කුමාර පත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s289.jpg',
    tags: ['', 'Kumara Paththa', 'කුමාර පත්ත', '289']);

final _tale290 = Tale(
    id: 290,
    title: 'තෘතිය බක ජාතකය',
    story: '',
    image: 'assets/stories/s290.jpg',
    tags: ['', 'Thruthiya Baka', 'තෘතිය බක', '290']);

final _tale291 = Tale(
    id: 291,
    title: 'ගාමණි චණ්ඩ ජාතකය',
    story: '',
    image: 'assets/stories/s291.jpg',
    tags: ['', 'Gamini Chanda', 'ගාමණි චණ්ඩ', '291']);

final _tale292 = Tale(
    id: 292,
    title: 'ගුත්තිල ජාතකය',
    story: '',
    image: 'assets/stories/s292.jpg',
    tags: ['', '', 'ගුත්තිල', '292']);

final _tale293 = Tale(
    id: 293,
    title: 'චිතීයරාධ ජාතකය',
    story: '',
    image: 'assets/stories/s293.jpg',
    tags: ['', 'Vithiyaradha', 'චිතීයරාධ', '293']);

final _tale294 = Tale(
    id: 294,
    title: 'සිරිකාලකණ්ණි ජාතකය',
    story: '',
    image: 'assets/stories/s294.jpg',
    tags: ['', 'Sirikaalakanni', 'සිරිකාලකණ්ණි', '294']);

final _tale295 = Tale(
    id: 295,
    title: 'චුල්ලකාලි ජාතකය',
    story: '',
    image: 'assets/stories/s295.jpg',
    tags: ['', 'Chullakali', 'චුල්ලකාලි', '295']);

final _tale296 = Tale(
    id: 296,
    title: 'මහාඅස්වාරොහක ජාතකය',
    story: '',
    image: 'assets/stories/s296.jpg',
    tags: ['', 'Mahaaswaarohaka', 'මහාඅස්වාරොහක', '296']);

final _tale297 = Tale(
    id: 297,
    title: 'විතිය සීලරිමංස ජාතකය',
    story: '',
    image: 'assets/stories/s297.jpg',
    tags: ['', 'Vithiya Silarimansa', 'විතිය සීලරිමංස', '297']);

final _tale298 = Tale(
    id: 298,
    title: 'තිය සුජාත ජාතකය',
    story: '',
    image: 'assets/stories/s298.jpg',
    tags: ['', 'Thiya Sujatha', 'තිය සුජාත', '298']);

final _tale299 = Tale(
    id: 299,
    title: 'තෘතීය පලාස ජාතකය',
    story: '',
    image: 'assets/stories/s299.jpg',
    tags: ['', 'Thruthiya Palaasa', 'තෘතීය පලාස', '299']);

final _tale300 = Tale(
    id: 300,
    title: 'ජවන සකුන ජාතකය',
    story: '',
    image: 'assets/stories/s300.jpg',
    tags: ['', 'Jawana Sakuna', 'ජවන සකුන', '300']);

final _tale301 = Tale(
    id: 301,
    title: 'ජව ජාතකය',
    story: '',
    image: 'assets/stories/s301.jpg',
    tags: ['', 'Jawa', 'ජව', '301']);

final _tale302 = Tale(
    id: 302,
    title: 'සයිහ ජාතකය',
    story: '',
    image: 'assets/stories/s302.jpg',
    tags: ['', 'Saiha', 'සයිහ', '302']);

final _tale303 = Tale(
    id: 303,
    title: 'පුචිමන්‍ද ජාතකය',
    story: '',
    image: 'assets/stories/s303.jpg',
    tags: ['', 'Puchimanna', 'පුචිමන්‍ද', '303']);

final _tale304 = Tale(
    id: 304,
    title: 'කස්සප මන්‍දිය ජාතකය',
    story: '',
    image: 'assets/stories/s304.jpg',
    tags: ['', 'Kassapa Mandia', 'කස්සප මන්‍දිය', '304']);

final _tale305 = Tale(
    id: 305,
    title: 'ක්‍ෂාන්තිවාද ජාතකය',
    story: '',
    image: 'assets/stories/s305.jpg',
    tags: ['', 'Kshanthiwaadi', 'ක්‍ෂාන්තිවාද', '305']);

final _tale306 = Tale(
    id: 306,
    title: 'ලොහකුභි ජාතකය',
    story: '',
    image: 'assets/stories/s306.jpg',
    tags: ['', 'Lohakumbhi', 'ලොහකුභි', '306']);

final _tale307 = Tale(
    id: 307,
    title: 'මාංශ ජාතකය',
    story: '',
    image: 'assets/stories/s307.jpg',
    tags: ['', 'Mansha', 'මාංශ', '307']);

final _tale308 = Tale(
    id: 308,
    title: 'සස ජාතකය',
    story: '',
    image: 'assets/stories/s308.jpg',
    tags: ['', 'Sasa', 'සස', '308']);

final _tale309 = Tale(
    id: 309,
    title: 'එකරාජ ජාතකය',
    story: '',
    image: 'assets/stories/s309.jpg',
    tags: ['', 'Ekaraja', 'එකරාජ', '309']);

final _tale310 = Tale(
    id: 310,
    title: 'චිතීය දද්දර ජාතකය',
    story: '',
    image: 'assets/stories/s310.jpg',
    tags: ['', 'Chiththiya Daddara', 'චිතීය දද්දර', '310']);

final _tale311 = Tale(
    id: 311,
    title: 'මතරොදන ජාතකය',
    story: '',
    image: 'assets/stories/s311.jpg',
    tags: ['', 'Matharodana', 'මතරොදන', '311']);

final _tale312 = Tale(
    id: 312,
    title: 'නර්‍ඬරි ජාතකය',
    story: '',
    image: 'assets/stories/s312.jpg',
    tags: ['', 'Nardari', 'නර්‍ඬරි', '312']);

final _tale313 = Tale(
    id: 313,
    title: 'බාවේරු ජාතකය',
    story: '',
    image: 'assets/stories/s313.jpg',
    tags: ['', 'Baweru', 'බාවේරු', '313']);

final _tale314 = Tale(
    id: 314,
    title: 'වානර ජාතකය',
    story: '',
    image: 'assets/stories/s314.jpg',
    tags: ['', 'Wanara', 'වානර', '314']);

final _tale315 = Tale(
    id: 315,
    title: 'කනවෙර ජාතකය',
    story: '',
    image: 'assets/stories/s315.jpg',
    tags: ['', 'Kanawera', 'කනවෙර', '315']);

final _tale316 = Tale(
    id: 316,
    title: 'තෘතිය තිත්තිර ජාතකය',
    story: '',
    image: 'assets/stories/s316.jpg',
    tags: ['', 'Thruthiya Thiththira', 'තෘතිය තිත්තිර', '316']);

final _tale317 = Tale(
    id: 317,
    title: 'සුබ්බච ජාතකය',
    story: '',
    image: 'assets/stories/s317.jpg',
    tags: ['', 'Subbacha', 'සුබ්බච', '317']);

final _tale318 = Tale(
    id: 318,
    title: 'කුටිදුෂක ජාතකය',
    story: '',
    image: 'assets/stories/s318.jpg',
    tags: ['', 'Kutidushaka', 'කුටිදුෂක', '318']);

final _tale319 = Tale(
    id: 319,
    title: 'දද්දභ ජාතකය',
    story: '',
    image: 'assets/stories/s319.jpg',
    tags: ['', 'Daddabha', 'දද්දභ', '319']);

final _tale320 = Tale(
    id: 320,
    title: 'බ්‍රහ්මදත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s320.jpg',
    tags: ['', 'Brahmadatta', 'බ්‍රහ්මදත්ත', '320']);

final _tale321 = Tale(
    id: 321,
    title: 'තෘතිය ගොධ ජාතකය',
    story: '',
    image: 'assets/stories/s321.jpg',
    tags: ['', 'Thruthiya Godha', 'තෘතිය ගොධ', '321']);

final _tale322 = Tale(
    id: 322,
    title: 'වම්ම සාටක ජාතකය',
    story: '',
    image: 'assets/stories/s322.jpg',
    tags: ['', 'Chamasataka', 'වම්ම සාටක', '322']);

final _tale323 = Tale(
    id: 323,
    title: 'කක්කාර ජාතකය',
    story: '',
    image: 'assets/stories/s323.jpg',
    tags: ['', 'Kakkara', 'කක්කාර', '323']);

final _tale324 = Tale(
    id: 324,
    title: 'තෘතීය කාක ජාතකය',
    story: '',
    image: 'assets/stories/s324.jpg',
    tags: ['', 'Thruthiya Kaka', 'තෘතීය කාක', '324']);

final _tale325 = Tale(
    id: 325,
    title: 'අනනු සොචිය ජාතකය',
    story: '',
    image: 'assets/stories/s325.jpg',
    tags: ['', 'Ananu Sochiya', 'අනනු සොචිය', '325']);

final _tale326 = Tale(
    id: 326,
    title: 'කාලබාහු ජාතකය',
    story: '',
    image: 'assets/stories/s326.jpg',
    tags: ['', 'Kalabahu', 'කාලබාහු', '326']);

final _tale327 = Tale(
    id: 327,
    title: 'චතුත්‍ර‍ථසීල රිමංස ජාතකය',
    story: '',
    image: 'assets/stories/s327.jpg',
    tags: ['', 'Chathuhratha Seela Rimansa', 'චතුත්‍ර‍ථසීල රිමංස', '327']);

final _tale328 = Tale(
    id: 328,
    title: 'රථලන්‍දා ජාතකය',
    story: '',
    image: 'assets/stories/s328.jpg',
    tags: ['', 'Rathalanda', 'රථලන්‍දා', '328']);

final _tale329 = Tale(
    id: 329,
    title: 'ජබුක ජාතකය',
    story: '',
    image: 'assets/stories/s329.jpg',
    tags: ['', 'Jabuka', 'ජබුක', '329']);

final _tale330 = Tale(
    id: 330,
    title: 'බ්‍රහත්ඡත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s330.jpg',
    tags: ['', 'Brahathchatta', 'බ්‍රහත්ඡත්ත', '330']);

final _tale331 = Tale(
    id: 331,
    title: 'පීඨ ජාතකය',
    story: '',
    image: 'assets/stories/s331.jpg',
    tags: ['', 'Peeta', 'පීඨ', '331']);

final _tale332 = Tale(
    id: 332,
    title: 'තුෂ ජාතකය',
    story: '',
    image: 'assets/stories/s332.jpg',
    tags: ['', 'Thusha', 'තුෂ', '332']);

final _tale333 = Tale(
    id: 333,
    title: 'රිසයිහ ජාතකය',
    story: '',
    image: 'assets/stories/s000.jpg',
    tags: ['', 'Risaiha', 'රිසයිහ', '333']);

final _tale334 = Tale(
    id: 334,
    title: 'කුන්තානි ජාතකය',
    story: '',
    image: 'assets/stories/s334.jpg',
    tags: ['', 'Kunthani', 'කුන්තානි', '334']);

final _tale335 = Tale(
    id: 335,
    title: 'අබචොර ජාතකය',
    story: '',
    image: 'assets/stories/s335.jpg',
    tags: ['', 'Abachora', 'අබචොර', '335']);

final _tale336 = Tale(
    id: 336,
    title: 'ගජකුම්භ ජාතකය',
    story: '',
    image: 'assets/stories/s336.jpg',
    tags: ['', 'Gajakumbha', 'ගජකුම්භ', '336']);

final _tale337 = Tale(
    id: 337,
    title: 'කේසව ජාතකය',
    story: '',
    image: 'assets/stories/s337.jpg',
    tags: ['', 'Kesawa', 'කේසව', '337']);

final _tale338 = Tale(
    id: 338,
    title: 'අයකූට ජාතකය',
    story: '',
    image: 'assets/stories/s338.jpg',
    tags: ['', 'Ayakuuta', 'අයකූට', '338']);

final _tale339 = Tale(
    id: 339,
    title: 'සන්‍ධිභේද ජාතකය',
    story: '',
    image: 'assets/stories/s339.jpg',
    tags: ['', 'Sandhibheda', 'සන්‍ධිභේද', '339']);

final _tale340 = Tale(
    id: 340,
    title: 'අරඤ්ඤ ජාතකය',
    story: '',
    image: 'assets/stories/s340.jpg',
    tags: ['', 'Aranna', 'අරඤ්ඤ', '340']);

final _tale341 = Tale(
    id: 341,
    title: 'මණිකුණ්ඩල ජාතකය',
    story: '',
    image: 'assets/stories/s341.jpg',
    tags: ['', 'Manikundala', 'මණිකුණ්ඩල', '341']);

final _tale342 = Tale(
    id: 342,
    title: 'තෘතීය සුජාත ජාතකය',
    story: '',
    image: 'assets/stories/s342.jpg',
    tags: ['', 'Thruthiya Sujatha', 'තෘතීය සුජාත', '342']);

final _tale343 = Tale(
    id: 343,
    title: 'ජෝත ජාතකය',
    story: '',
    image: 'assets/stories/s343.jpg',
    tags: ['', 'Jotha', 'ජෝත', '343']);

final _tale344 = Tale(
    id: 344,
    title: 'චිතීය උරග ජාතකය',
    story: '',
    image: 'assets/stories/s344.jpg',
    tags: ['', 'Chithiya Uraga', 'චිතීය උරග', '344']);

final _tale345 = Tale(
    id: 345,
    title: 'ඝණ ජාතකය',
    story: '',
    image: 'assets/stories/s345.jpg',
    tags: ['', 'Ghana', 'ඝණ', '345']);

final _tale346 = Tale(
    id: 346,
    title: 'කාරඬික ජාතකය',
    story: '',
    image: 'assets/stories/s346.jpg',
    tags: ['', 'Karadika', 'කාරඬික', '346']);

final _tale347 = Tale(
    id: 347,
    title: 'ලටුකික ජාතකය',
    story: '',
    image: 'assets/stories/s347.jpg',
    tags: ['', 'Latukika', 'ලටුකික', '347']);

final _tale348 = Tale(
    id: 348,
    title: 'චුල්ලධර්‍මපාල ජාතකය',
    story: '',
    image: 'assets/stories/s348.jpg',
    tags: ['', 'Chulladharmapala', 'චුල්ලධර්‍මපාල', '348']);

final _tale349 = Tale(
    id: 349,
    title: 'සුස්සොන්දිය ජාතකය',
    story: '',
    image: 'assets/stories/s349.jpg',
    tags: ['', 'Sussondiya', 'සුස්සොන්දිය', '349']);

final _tale350 = Tale(
    id: 350,
    title: 'සවර්ණ මෘග ජාතකය',
    story: '',
    image: 'assets/stories/s350.jpg',
    tags: ['', 'Swarna Mruga', 'සවර්ණ මෘග', '350']);

final _tale351 = Tale(
    id: 351,
    title: 'වර්ණරෝහ ජාතකය',
    story: '',
    image: 'assets/stories/s351.jpg',
    tags: ['', 'Warnaroha', 'වර්ණරෝහ', '351']);

final _tale352 = Tale(
    id: 352,
    title: 'ශීලපරික්ඛ ජාතකය',
    story: '',
    image: 'assets/stories/s352.jpg',
    tags: ['', 'Shelaparikkha', 'ශීලපරික්ඛ', '352']);

final _tale353 = Tale(
    id: 353,
    title: 'හිරි ජාතකය',
    story: '',
    image: 'assets/stories/s353.jpg',
    tags: ['', 'Hiri', 'හිරි', '353']);

final _tale354 = Tale(
    id: 354,
    title: 'අහිගුණ්ඨි‍ක ජාතකය',
    story: '',
    image: 'assets/stories/s354.jpg',
    tags: ['', 'Ahiguntika', 'අහිගුණ්ඨි‍ක', '354']);

final _tale355 = Tale(
    id: 355,
    title: 'ගුඹිය ජාතකය',
    story: '',
    image: 'assets/stories/s355.jpg',
    tags: ['', 'Gubhiya', 'ගුඹිය', '355']);

final _tale356 = Tale(
    id: 356,
    title: 'සාලිය ජාතකය',
    story: '',
    image: 'assets/stories/s356.jpg',
    tags: ['', 'Saliya', 'සාලිය', '356']);

final _tale357 = Tale(
    id: 357,
    title: 'නවසාර ජාතකය',
    story: '',
    image: 'assets/stories/s357.jpg',
    tags: ['', 'Nawasara', 'නවසාර', '357']);

final _tale358 = Tale(
    id: 358,
    title: 'මිත්තරින්‍දක ජාතකය',
    story: '',
    image: 'assets/stories/s358.jpg',
    tags: ['', 'Mittarindaka', 'මිත්තරින්‍දක', '358']);

final _tale359 = Tale(
    id: 359,
    title: 'චතුත්‍ථපලාස ජාතකය',
    story: '',
    image: 'assets/stories/s359.jpg',
    tags: ['', 'Chathuthrapalasa', 'චතුත්‍ථපලාස', '359']);

final _tale360 = Tale(
    id: 360,
    title: 'දීඝකොසල ජාතකය',
    story: '',
    image: 'assets/stories/s360.jpg',
    tags: ['', 'Deega Kosala', 'දීඝකොසල', '360']);

final _tale361 = Tale(
    id: 361,
    title: 'මුවපොතක ජාතකය',
    story: '',
    image: 'assets/stories/s361.jpg',
    tags: ['', 'Muwapothaka', 'මුවපොතක', '361']);

final _tale362 = Tale(
    id: 362,
    title: 'මුසික ජාතකය',
    story: '',
    image: 'assets/stories/s362.jpg',
    tags: ['', 'Musika', 'මුසික', '362']);

final _tale363 = Tale(
    id: 363,
    title: 'චුල්ලධනු‍ධර ජාතකය',
    story: '',
    image: 'assets/stories/s363.jpg',
    tags: ['', 'Chulladhanudhara', 'චුල්ලධනු‍ධර', '363']);

final _tale364 = Tale(
    id: 364,
    title: 'වීතිය කපොත ජාතකය',
    story: '',
    image: 'assets/stories/s364.jpg',
    tags: ['', 'Vithiya Kapotha', 'වීතිය කපොත', '364']);

final _tale365 = Tale(
    id: 365,
    title: 'ආවාරි ජාතකය',
    story: '',
    image: 'assets/stories/s365.jpg',
    tags: ['', 'Achari', 'ආවාරි', '365']);

final _tale366 = Tale(
    id: 366,
    title: 'සෙවතකෙතු ජාතකය',
    story: '',
    image: 'assets/stories/s366.jpg',
    tags: ['', 'Sewathakethu', 'සෙවතකෙතු', '366']);

final _tale367 = Tale(
    id: 367,
    title: 'ර්‍දරිමුඛ ජාතකය',
    story: '',
    image: 'assets/stories/s367.jpg',
    tags: ['', 'Drimukha', 'ර්‍දරිමුඛ', '367']);

final _tale368 = Tale(
    id: 368,
    title: 'නේරු ජාතකය',
    story: '',
    image: 'assets/stories/s368.jpg',
    tags: ['', 'Neru', 'නේරු', '368']);

final _tale369 = Tale(
    id: 369,
    title: 'ආසංඛවතී ජාතකය',
    story: '',
    image: 'assets/stories/s369.jpg',
    tags: ['', 'Asankhawathi', 'ආසංඛවතී', '369']);

final _tale370 = Tale(
    id: 370,
    title: 'මිගාලොප ජාතකය',
    story: '',
    image: 'assets/stories/s370.jpg',
    tags: ['', 'Migalopa', 'මිගාලොප', '370']);

final _tale371 = Tale(
    id: 371,
    title: 'ශ්‍රී කාලකණ්ණි ජාතකය',
    story: '',
    image: 'assets/stories/s371.jpg',
    tags: ['', 'Sri Kalakanni', 'ශ්‍රී කාලකණ්ණි', '371']);

final _tale372 = Tale(
    id: 372,
    title: 'බි‍ළාල ජාතකය',
    story: '',
    image: 'assets/stories/s372.jpg',
    tags: ['', 'Bilala', 'බි‍ළාල', '372']);

final _tale373 = Tale(
    id: 373,
    title: 'ධර්‍මධවජ ජාතකය',
    story: '',
    image: 'assets/stories/s373.jpg',
    tags: ['', 'Dharmadhawaja', 'ධර්‍මධවජ', '373']);

final _tale374 = Tale(
    id: 374,
    title: 'කරපත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s374.jpg',
    tags: ['', 'Karapatta', 'කරපත්ත', '374']);

final _tale375 = Tale(
    id: 375,
    title: 'නන්දිය‍ මෘග ජාතකය',
    story: '',
    image: 'assets/stories/s375.jpg',
    tags: ['', 'Nandiya Mruga', 'නන්දිය‍ මෘග', '375']);

final _tale376 = Tale(
    id: 376,
    title: 'සුචි ජාතකය',
    story: '',
    image: 'assets/stories/s376.jpg',
    tags: ['', 'Suchi', 'සුචි', '376']);

final _tale377 = Tale(
    id: 377,
    title: 'තුඬිල ජාතකය',
    story: '',
    image: 'assets/stories/s377.jpg',
    tags: ['', 'Thudila', 'තුඬිල', '377']);

final _tale378 = Tale(
    id: 378,
    title: 'මය්හ ජාතකය',
    story: '',
    image: 'assets/stories/s378.jpg',
    tags: ['', 'Maiha', 'මය්හ', '378']);

final _tale379 = Tale(
    id: 379,
    title: 'ස්වර්ණ කර්‍කටක ජාතකය',
    story: '',
    image: 'assets/stories/s379.jpg',
    tags: ['', 'Swarna Karkataka', 'ස්වර්ණ කර්‍කටක', '379']);

final _tale380 = Tale(
    id: 380,
    title: 'ධජ විහෙඨ ජාතකය',
    story: '',
    image: 'assets/stories/s380.jpg',
    tags: ['', 'Dhaja Wiheta', 'ධජ විහෙඨ', '380']);

final _tale381 = Tale(
    id: 381,
    title: 'පුෂ්ප ගන්‍ධ ජාතකය',
    story: '',
    image: 'assets/stories/s381.jpg',
    tags: ['', 'Pushpa Gandha', 'පුෂ්ප ගන්‍ධ', '381']);

final _tale382 = Tale(
    id: 382,
    title: 'රිඝාත ජාතකය',
    story: '',
    image: 'assets/stories/s382.jpg',
    tags: ['', 'Righatha', 'රිඝාත', '382']);

final _tale383 = Tale(
    id: 383,
    title: 'තෘතීය වට්ටක ජාතකය',
    story: '',
    image: 'assets/stories/s383.jpg',
    tags: ['', 'Thruthiya Wattaka', 'තෘතීය වට්ටක', '383']);

final _tale384 = Tale(
    id: 384,
    title: 'චතුත්‍ථි කාක ජාතකය',
    story: '',
    image: 'assets/stories/s384.jpg',
    tags: ['', 'Chathuththi Kaka', 'චතුත්‍ථි කාක', '384']);

final _tale385 = Tale(
    id: 385,
    title: 'කුක්කු ජාතකය',
    story: '',
    image: 'assets/stories/s385.jpg',
    tags: ['', 'Kukku', 'කුක්කු', '385']);

final _tale386 = Tale(
    id: 386,
    title: 'මනොජ ජාතකය',
    story: '',
    image: 'assets/stories/s386.jpg',
    tags: ['', 'Manoja', 'මනොජ', '386']);

final _tale387 = Tale(
    id: 387,
    title: 'සුතනු ජාතකය',
    story: '',
    image: 'assets/stories/s387.jpg',
    tags: ['', 'Suthanu', 'සුතනු', '387']);

final _tale388 = Tale(
    id: 388,
    title: 'චිතීය ගිජඣ ජාතකය',
    story: '',
    image: 'assets/stories/s388.jpg',
    tags: ['', 'Vithiya Gijakta', 'චිතීය ගිජඣ', '388']);

final _tale389 = Tale(
    id: 389,
    title: 'දබ්බ පුෂ්ප ජාතකය',
    story: '',
    image: 'assets/stories/s389.jpg',
    tags: ['', 'Dabba Pushpa', 'දබ්බ පුෂ්ප', '389']);

final _tale390 = Tale(
    id: 390,
    title: 'දසන්නක ජාතකය',
    story: '',
    image: 'assets/stories/s390.jpg',
    tags: ['', 'Dasannaka', 'දසන්නක', '390']);

final _tale391 = Tale(
    id: 391,
    title: 'සත්තුභත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s391.jpg',
    tags: ['', 'Saththubhatta', 'සත්තුභත්ත', '391']);

final _tale392 = Tale(
    id: 392,
    title: 'අ‍ඨිසේන ජාතකය',
    story: '',
    image: 'assets/stories/s392.jpg',
    tags: ['', 'Atihsena', 'අ‍ඨිසේන', '392']);

final _tale393 = Tale(
    id: 393,
    title: 'වීතිය කපි ජාතකය',
    story: '',
    image: 'assets/stories/s393.jpg',
    tags: ['', 'Vithiya Kapi', 'වීතිය කපි', '393']);

final _tale394 = Tale(
    id: 394,
    title: 'ගන්‍ධාර ජාතකය',
    story: '',
    image: 'assets/stories/s394.jpg',
    tags: ['', 'Gandhara', 'ගන්‍ධාර', '394']);

final _tale395 = Tale(
    id: 395,
    title: 'බකබ්‍රහ්ම ජාතකය',
    story: '',
    image: 'assets/stories/s395.jpg',
    tags: ['', 'BakaBrahma', 'බකබ්‍රහ්ම', '395']);

final _tale396 = Tale(
    id: 396,
    title: 'මහාකපි ජාතකය',
    story: '',
    image: 'assets/stories/s396.jpg',
    tags: ['', 'Maha Kapi', 'මහාකපි', '396']);

final _tale397 = Tale(
    id: 397,
    title: 'කුම්භකාර ජාතකය',
    story: '',
    image: 'assets/stories/s397.jpg',
    tags: ['', 'Kumbhakara', 'කුම්භකාර', '397']);

final _tale398 = Tale(
    id: 398,
    title: 'දල්හ ධම්ම ජාතකය',
    story: '',
    image: 'assets/stories/s398.jpg',
    tags: ['', 'Dalha Dhamma', 'දල්හ ධම්ම', '398']);

final _tale399 = Tale(
    id: 399,
    title: 'සොමදත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s399.jpg',
    tags: ['', 'Somadatta', 'සොමදත්ත', '399']);

final _tale400 = Tale(
    id: 400,
    title: 'සුසීම ජාතකය',
    story: '',
    image: 'assets/stories/s400.jpg',
    tags: ['', 'Susima', 'සුසීම', '400']);

final _tale401 = Tale(
    id: 401,
    title: 'කොසිඔලි ජාතකය',
    story: '',
    image: 'assets/stories/s401.jpg',
    tags: ['', 'Kotisimbali', 'කොසිඔලි', '401']);

final _tale402 = Tale(
    id: 402,
    title: 'ධූමකාරි ජාතකය',
    story: '',
    image: 'assets/stories/s402.jpg',
    tags: ['', 'Dhumakari', 'ධූමකාරි', '402']);

final _tale403 = Tale(
    id: 403,
    title: 'ජාගර ජාතකය',
    story: '',
    image: 'assets/stories/s403.jpg',
    tags: ['', 'Jagara', 'ජාගර', '403']);

final _tale404 = Tale(
    id: 404,
    title: 'කුමාස පිඬි ජාතකය',
    story: '',
    image: 'assets/stories/s404.jpg',
    tags: ['', 'Kummasapinda', 'කුමාස පිඬි', '404']);

final _tale405 = Tale(
    id: 405,
    title: 'පරන්තප ජාතකය',
    story: '',
    image: 'assets/stories/s405.jpg',
    tags: ['', 'Parantapa', 'පරන්තප', '405']);

final _tale406 = Tale(
    id: 406,
    title: 'කච්චානි ජාතකය',
    story: '',
    image: 'assets/stories/s406.jpg',
    tags: ['', 'Kaccani', 'කච්චානි', '406']);

final _tale407 = Tale(
    id: 407,
    title: 'අෂ්ටශක්‍ෂද ජාතකය',
    story: '',
    image: 'assets/stories/s407.jpg',
    tags: ['', 'Atthasadda', 'අෂ්ටශක්‍ෂද', '407']);

final _tale408 = Tale(
    id: 408,
    title: 'සුලසා ජාතකය',
    story: '',
    image: 'assets/stories/s408.jpg',
    tags: ['', 'Sulasa', 'සුලසා', '408']);

final _tale409 = Tale(
    id: 409,
    title: 'සුමඞගල ජාතකය',
    story: '',
    image: 'assets/stories/s409.jpg',
    tags: ['', 'Sumangala', 'සුමඞගල', '409']);

final _tale410 = Tale(
    id: 410,
    title: 'ගඞගාමාල ජාතකය',
    story: '',
    image: 'assets/stories/s410.jpg',
    tags: ['', 'Gangamala', 'ගඞගාමාල', '410']);

final _tale411 = Tale(
    id: 411,
    title: 'චෙතිය ජාතකය',
    story: '',
    image: 'assets/stories/s411.jpg',
    tags: ['', 'Chethiya', 'චෙතිය', '411']);

final _tale412 = Tale(
    id: 412,
    title: 'ඉන්ද්‍රිය ජාතකය',
    story: '',
    image: 'assets/stories/s412.jpg',
    tags: ['', 'Indriya', 'ඉන්ද්‍රිය', '412']);

final _tale413 = Tale(
    id: 413,
    title: 'ආදිත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s413.jpg',
    tags: ['', 'Aditta', 'ආදිත්ත', '413']);

final _tale414 = Tale(
    id: 414,
    title: 'දිවි ජාතකය',
    story: '',
    image: 'assets/stories/s414.jpg',
    tags: ['', 'Divi', 'දිවි', '414']);

final _tale415 = Tale(
    id: 415,
    title: 'තෘතිය ජාතකය',
    story: '',
    image: 'assets/stories/s415.jpg',
    tags: ['', 'Thruthiya', 'තෘතිය', '415']);

final _tale416 = Tale(
    id: 416,
    title: 'කොසම්බ ජාතකය',
    story: '',
    image: 'assets/stories/s416.jpg',
    tags: ['', 'Kosamba', 'කොසම්බ', '416']);

final _tale417 = Tale(
    id: 417,
    title: 'මහගිරා  ජාතකය',
    story: '',
    image: 'assets/stories/s417.jpg',
    tags: ['', 'Mahagira', 'මහගිරා', '417']);

final _tale418 = Tale(
    id: 418,
    title: 'සු‍ළුසුව ජාතකය',
    story: '',
    image: 'assets/stories/s418.jpg',
    tags: ['', 'Sulusuwa', 'සු‍ළුසුව', '418']);

final _tale419 = Tale(
    id: 419,
    title: 'හාරිත ජාතකය',
    story: '',
    image: 'assets/stories/s419.jpg',
    tags: ['', 'Haritha', 'හාරිත', '419']);

final _tale420 = Tale(
    id: 420,
    title: 'රාජෝවාද ජාතකය',
    story: '',
    image: 'assets/stories/s420.jpg',
    tags: ['', 'Rajowaada', 'රාජෝවාද', '420']);

final _tale421 = Tale(
    id: 421,
    title: 'පදමානවක ජාතකය',
    story: '',
    image: 'assets/stories/s421.jpg',
    tags: ['', 'Padamanawaka', 'පදමානවක', '421']);

final _tale422 = Tale(
    id: 422,
    title: 'ලොමස ජාතකය',
    story: '',
    image: 'assets/stories/s422.jpg',
    tags: ['', 'Lomasa', 'ලොමස', '422']);

final _tale423 = Tale(
    id: 423,
    title: 'සක්වාදා ජාතකය',
    story: '',
    image: 'assets/stories/s423.jpg',
    tags: ['', 'Sakwaadaa', 'සක්වාදා', '423']);

final _tale424 = Tale(
    id: 424,
    title: 'හලින්දිය ජාතකය',
    story: '',
    image: 'assets/stories/s424.jpg',
    tags: ['', 'Halindiya', 'හලින්දිය', '424']);

final _tale425 = Tale(
    id: 425,
    title: 'සමුග්ග ජාතකය',
    story: '',
    image: 'assets/stories/s425.jpg',
    tags: ['', 'Samugga', 'සමුග්ග', '425']);

final _tale426 = Tale(
    id: 426,
    title: 'ප්‍රතිමාංශ ජාතකය',
    story: '',
    image: 'assets/stories/s426.jpg',
    tags: ['', 'Prathimansa', 'ප්‍රතිමාංශ', '426']);

final _tale427 = Tale(
    id: 427,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s427.jpg',
    tags: ['', '', '', '427']);

final _tale428 = Tale(
    id: 428,
    title: 'තිත්වටු ජාතකය',
    story: '',
    image: 'assets/stories/s428.jpg',
    tags: ['', 'Thithwatu', 'තිත්වටු', '428']);

final _tale429 = Tale(
    id: 429,
    title: 'චතුවාර ජාතකය',
    story: '',
    image: 'assets/stories/s429.jpg',
    tags: ['', 'Chathuwara', 'චතුවාර', '429']);

final _tale430 = Tale(
    id: 430,
    title: 'කෘෂ්ණ ජාතකය',
    story: '',
    image: 'assets/stories/s430.jpg',
    tags: ['', 'Krushna', 'කෘෂ්ණ', '430']);

final _tale431 = Tale(
    id: 431,
    title: 'සංඛ ජාතකය',
    story: '',
    image: 'assets/stories/s431.jpg',
    tags: ['', 'Sankha', 'සංඛ', '431']);

final _tale432 = Tale(
    id: 432,
    title: 'චුල්ලබෝධි ජාතකය',
    story: '',
    image: 'assets/stories/s432.jpg',
    tags: ['', 'Chullabodhi', 'චුල්ලබෝධි', '432']);

final _tale433 = Tale(
    id: 433,
    title: 'කණ්හදීප ජාතකය',
    story: '',
    image: 'assets/stories/s433.jpg',
    tags: ['', 'Kanhadeepa', 'කණ්හදීප', '433']);

final _tale434 = Tale(
    id: 434,
    title: 'නි‍ග්‍රොධ ජාතකය',
    story: '',
    image: 'assets/stories/s434.jpg',
    tags: ['', 'Nigrodha', 'නි‍ග්‍රොධ', '434']);

final _tale435 = Tale(
    id: 435,
    title: 'තක්කාරි ජාතකය',
    story: '',
    image: 'assets/stories/s435.jpg',
    tags: ['', 'Thakkari', 'තක්කාරි', '435']);

final _tale436 = Tale(
    id: 436,
    title: 'මහාධර්මපාල ජාතකය',
    story: '',
    image: 'assets/stories/s436.jpg',
    tags: ['', 'Maha Dharmapala', 'මහාධර්මපාල', '436']);

final _tale437 = Tale(
    id: 437,
    title: 'කුක්කුහ ජාතකය',
    story: '',
    image: 'assets/stories/s437.jpg',
    tags: ['', 'Kukkuha', 'කුක්කුහ', '437']);

final _tale438 = Tale(
    id: 438,
    title: 'බිලාර සිය ජාතකය',
    story: '',
    image: 'assets/stories/s438.jpg',
    tags: ['', 'Bilara Siya', 'බිලාර සිය', '438']);

final _tale439 = Tale(
    id: 439,
    title: 'මට්ටකුණ්ඩලී ජාතකය',
    story: '',
    image: 'assets/stories/s439.jpg',
    tags: ['', 'Mattakundali', 'මට්ටකුණ්ඩලී', '439']);

final _tale440 = Tale(
    id: 440,
    title: 'චක්ක වාක ජාතකය',
    story: '',
    image: 'assets/stories/s440.jpg',
    tags: ['', 'Chakka Waaka', 'චක්ක වාක', '440']);

final _tale441 = Tale(
    id: 441,
    title: 'මහාමංගල ජාතකය',
    story: '',
    image: 'assets/stories/s441.jpg',
    tags: ['', 'Maha Mangala', 'මහාමංගල', '441']);

final _tale442 = Tale(
    id: 442,
    title: 'ඝත ජාතකය',
    story: '',
    image: 'assets/stories/s442.jpg',
    tags: ['', 'Ghatha', 'ඝත', '442']);

final _tale443 = Tale(
    id: 443,
    title: 'මාතු පොසක ජාතකය',
    story: '',
    image: 'assets/stories/s443.jpg',
    tags: ['', 'Maathu Posaka', 'මාතු පොසක', '443']);

final _tale444 = Tale(
    id: 444,
    title: 'ජුන්හ ජාතකය',
    story: '',
    image: 'assets/stories/s444.jpg',
    tags: ['', 'Junha', 'ජුන්හ', '444']);

final _tale445 = Tale(
    id: 445,
    title: 'ධර්ම ජාතකය',
    story: '',
    image: 'assets/stories/s445.jpg',
    tags: ['', 'Dharma', 'ධර්ම', '445']);

final _tale446 = Tale(
    id: 446,
    title: 'උදයභද්ද ජාතකය',
    story: '',
    image: 'assets/stories/s446.jpg',
    tags: ['', 'Udayabhadda', 'උදයභද්ද', '446']);

final _tale447 = Tale(
    id: 447,
    title: 'පාණිය ජාතකය',
    story: '',
    image: 'assets/stories/s447.jpg',
    tags: ['', 'Paaniya', 'පාණිය', '447']);

final _tale448 = Tale(
    id: 448,
    title: 'යුංජ්ජය ජාතකය',
    story: '',
    image: 'assets/stories/s448.jpg',
    tags: ['', 'Yunjjaya', 'යුංජ්ජය', '448']);

final _tale449 = Tale(
    id: 449,
    title: 'දසරථ ජාතකය',
    story: '',
    image: 'assets/stories/s449.jpg',
    tags: ['', 'Dasaratha', 'දසරථ', '449']);

final _tale450 = Tale(
    id: 450,
    title: 'සංවර ජාතකය',
    story: '',
    image: 'assets/stories/s450.jpg',
    tags: ['', 'Sanwara', 'සංවර', '450']);

final _tale451 = Tale(
    id: 451,
    title: 'සුප්පාර ජාතකය',
    story: '',
    image: 'assets/stories/s451.jpg',
    tags: ['', 'Suppara', 'සුප්පාර', '451']);

final _tale452 = Tale(
    id: 452,
    title: 'චුල්ලකුණාල ජාතකය',
    story: '',
    image: 'assets/stories/s452.jpg',
    tags: ['', 'Chulla Kunala', 'චුල්ලකුණාල', '452']);

final _tale453 = Tale(
    id: 453,
    title: 'භද්දසාල ජාතකය',
    story: '',
    image: 'assets/stories/s453.jpg',
    tags: ['', 'Bhaddasala', 'භද්දසාල', '453']);

final _tale454 = Tale(
    id: 454,
    title: 'සමුද්දවානි ජාතකය',
    story: '',
    image: 'assets/stories/s454.jpg',
    tags: ['', 'Samuddawani', 'සමුද්දවානි', '454']);

final _tale455 = Tale(
    id: 455,
    title: 'කාම ජාතකය',
    story: '',
    image: 'assets/stories/s455.jpg',
    tags: ['', 'Kama', 'කාම', '455']);

final _tale456 = Tale(
    id: 456,
    title: 'ජනසන්ධව ජාතකය',
    story: '',
    image: 'assets/stories/s456.jpg',
    tags: ['', 'Janasandawa', 'ජනසන්ධව', '456']);

final _tale457 = Tale(
    id: 457,
    title: 'මහා කණ්හ ජාතකය',
    story: '',
    image: 'assets/stories/s457.jpg',
    tags: ['', 'Maha Kanha', 'මහා කණ්හ', '457']);

final _tale458 = Tale(
    id: 458,
    title: 'මහා පදුම ජාතකය',
    story: '',
    image: 'assets/stories/s458.jpg',
    tags: ['', 'Maha Paduma', 'මහා පදුම', '458']);

final _tale459 = Tale(
    id: 459,
    title: 'මිත්තා මිත්ත ජාතකය',
    story: '',
    image: 'assets/stories/s459.jpg',
    tags: ['', 'Mittha Mitta', 'මිත්තා මිත්ත', '459']);

final _tale460 = Tale(
    id: 460,
    title: 'වීතිය අඔ ජාතකය',
    story: '',
    image: 'assets/stories/s460.jpg',
    tags: ['', 'Vithiya Amba', 'වීතිය අඔ', '460']);

final _tale461 = Tale(
    id: 461,
    title: 'ඵන්දන ජාතකය',
    story: '',
    image: 'assets/stories/s461.jpg',
    tags: ['', 'Endana', 'ඵන්දන', '461']);

final _tale462 = Tale(
    id: 462,
    title: 'ජවනහංස ජාතකය',
    story: '',
    image: 'assets/stories/s462.jpg',
    tags: ['', 'Jawana Hansa', 'ජවනහංස', '462']);

final _tale463 = Tale(
    id: 463,
    title: 'චුල්ලනාරද ජාතකය',
    story: '',
    image: 'assets/stories/s463.jpg',
    tags: ['', 'Chulla Narada', 'චුල්ලනාරද', '463']);

final _tale464 = Tale(
    id: 464,
    title: 'දුත ජාතකය',
    story: '',
    image: 'assets/stories/s464.jpg',
    tags: ['', 'Dutha', 'දුත', '464']);

final _tale465 = Tale(
    id: 465,
    title: 'කාලිංගබෝධි ජාතකය',
    story: '',
    image: 'assets/stories/s465.jpg',
    tags: ['', 'Kalinga Bodhi', 'කාලිංගබෝධි', '465']);

final _tale466 = Tale(
    id: 466,
    title: 'ආකීර්ති ජාතකය',
    story: '',
    image: 'assets/stories/s466.jpg',
    tags: ['', 'Akirthi', 'ආකීර්ති', '466']);

final _tale467 = Tale(
    id: 467,
    title: 'තක්කාරී ජාතකය',
    story: '',
    image: 'assets/stories/s467.jpg',
    tags: ['', 'Thakkari', 'තක්කාරී', '467']);

final _tale468 = Tale(
    id: 468,
    title: 'රෑරැමෘග ජාතකය',
    story: '',
    image: 'assets/stories/s468.jpg',
    tags: ['', 'Rearumruga', 'රෑරැමෘග', '468']);

final _tale469 = Tale(
    id: 469,
    title: 'සරභමිග ජාතකය',
    story: '',
    image: 'assets/stories/s469.jpg',
    tags: ['', 'Sarbhamiga', 'සරභමිග', '469']);

final _tale470 = Tale(
    id: 470,
    title: 'සාලිකෙදාර ජාතකය',
    story: '',
    image: 'assets/stories/s470.jpg',
    tags: ['', 'Sali Kedaara', 'සාලිකෙදාර', '470']);

final _tale471 = Tale(
    id: 471,
    title: 'චන්දකින්නර ජාතකය',
    story: '',
    image: 'assets/stories/s471.jpg',
    tags: ['', 'Chandakinnara', 'චන්දකින්නර', '471']);

final _tale472 = Tale(
    id: 472,
    title: 'මහා උක්කුස ජාතකය',
    story: '',
    image: 'assets/stories/s472.jpg',
    tags: ['', 'Maha Ukussa', 'මහා උක්කුස', '472']);

final _tale473 = Tale(
    id: 473,
    title: 'උද්දාල ජාතකය',
    story: '',
    image: 'assets/stories/s473.jpg',
    tags: ['', 'Uddala', 'උද්දාල', '473']);

final _tale474 = Tale(
    id: 474,
    title: 'මහිස ජාතකය',
    story: '',
    image: 'assets/stories/s474.jpg',
    tags: ['', 'Mahisa', 'මහිස', '474']);

final _tale475 = Tale(
    id: 475,
    title: 'සුරැචි  ජාතකය',
    story: '',
    image: 'assets/stories/s475.jpg',
    tags: ['', 'Surachi', 'සුරැචි', '475']);

final _tale476 = Tale(
    id: 476,
    title: 'පංචුපොසථ ජාතකය',
    story: '',
    image: 'assets/stories/s476.jpg',
    tags: ['', 'Panchuposatha', 'පංචුපොසථ', '476']);

final _tale477 = Tale(
    id: 477,
    title: 'මහාමයුර ජාතකය',
    story: '',
    image: 'assets/stories/s477.jpg',
    tags: ['', 'Maha Mayura', 'මහාමයුර', '477']);

final _tale478 = Tale(
    id: 478,
    title: 'තච්ඡසුකර ජාතකය',
    story: '',
    image: 'assets/stories/s478.jpg',
    tags: ['', 'Thachchasukara', 'තච්ඡසුකර', '478']);

final _tale479 = Tale(
    id: 479,
    title: 'මහා වාණිජ ජාතකය',
    story: '',
    image: 'assets/stories/s479.jpg',
    tags: ['', 'Maha Wanija', 'මහා වාණිජ', '479']);

final _tale480 = Tale(
    id: 480,
    title: 'සාධින ජාතකය',
    story: '',
    image: 'assets/stories/s480.jpg',
    tags: ['', 'Sadhina', 'සාධින', '480']);

final _tale481 = Tale(
    id: 481,
    title: 'දසබ්‍රාහ්මණ ජාතකය',
    story: '',
    image: 'assets/stories/s481.jpg',
    tags: ['', 'Dasa Brahmana', 'දසබ්‍රාහ්මණ', '481']);

final _tale482 = Tale(
    id: 482,
    title: 'භික්කා පරම්පර ජාතකය',
    story: '',
    image: 'assets/stories/s482.jpg',
    tags: ['', 'Bhikka Parampara', 'භික්කා පරම්පර', '482']);

final _tale483 = Tale(
    id: 483,
    title: 'මාතංග  ජාතකය',
    story: '',
    image: 'assets/stories/s483.jpg',
    tags: ['', 'Mathanga', 'මාතංග', '483']);

final _tale484 = Tale(
    id: 484,
    title: 'චිත්ත සම්භුත ජාතකය',
    story: '',
    image: 'assets/stories/s484.jpg',
    tags: ['', 'Chithta Sambutha', 'චිත්ත සම්භුත', '484']);

final _tale485 = Tale(
    id: 485,
    title: 'සිවි ජාතකය',
    story: '',
    image: 'assets/stories/s485.jpg',
    tags: ['', 'Sivi', 'සිවි', '485']);

final _tale486 = Tale(
    id: 486,
    title: 'සිරිමන්ද ජාතකය',
    story: '',
    image: 'assets/stories/s486.jpg',
    tags: ['', 'Sirimanda', 'සිරිමන්ද', '486']);

final _tale487 = Tale(
    id: 487,
    title: 'රොහන්ත මෘග ජාතකය',
    story: '',
    image: 'assets/stories/s487.jpg',
    tags: ['', 'Rohantha Mruga', 'රොහන්ත මෘග', '487']);

final _tale488 = Tale(
    id: 488,
    title: 'වීතිය ස්වර්ණහංස ජාතකය',
    story: '',
    image: 'assets/stories/s488.jpg',
    tags: ['', 'Vithiya Swarna Hansa', 'වීතිය ස්වර්ණහංස', '488']);

final _tale489 = Tale(
    id: 489,
    title: 'සත්තිකුඔ ජාතකය',
    story: '',
    image: 'assets/stories/s489.jpg',
    tags: ['', 'Saththikumba', 'සත්තිකුඔ', '489']);

final _tale490 = Tale(
    id: 490,
    title: 'භල්ලාටික  ජාතකය',
    story: '',
    image: 'assets/stories/s490.jpg',
    tags: ['', 'Bhallatika', 'භල්ලාටික', '490']);

final _tale491 = Tale(
    id: 491,
    title: 'සෝමනස්ස ජාතකය',
    story: '',
    image: 'assets/stories/s491.jpg',
    tags: ['', 'Somanassa', 'සෝමනස්ස', '491']);

final _tale492 = Tale(
    id: 492,
    title: 'චම්පෙය්‍ය ජාතකය',
    story: '',
    image: 'assets/stories/s492.jpg',
    tags: ['', 'Champeyaya', 'චම්පෙය්‍ය', '492']);

final _tale493 = Tale(
    id: 493,
    title: 'මහාපලෝභන ජාතකය',
    story: '',
    image: 'assets/stories/s493.jpg',
    tags: ['', 'Maha Palobhana', 'මහාපලෝභන', '493']);

final _tale494 = Tale(
    id: 494,
    title: 'හත්ථිපාල ජාතකය',
    story: '',
    image: 'assets/stories/s494.jpg',
    tags: ['', 'Haththipala', 'හත්ථිපාල', '494']);

final _tale495 = Tale(
    id: 495,
    title: 'අයෝඝර ජාතකය',
    story: '',
    image: 'assets/stories/s495.jpg',
    tags: ['', 'Ayoghara', 'අයෝඝර', '495']);

final _tale496 = Tale(
    id: 496,
    title: 'පඤ්ච පණ්ඩිත ජාතකය',
    story: '',
    image: 'assets/stories/s496.jpg',
    tags: ['', 'Pancha Panditha', 'පඤ්ච පණ්ඩිත', '496']);

final _tale497 = Tale(
    id: 497,
    title: 'කිංඡන්ද ජාතකය',
    story: '',
    image: 'assets/stories/s497.jpg',
    tags: ['', 'Kinchanda', 'කිංඡන්ද', '497']);

final _tale498 = Tale(
    id: 498,
    title: 'කුම්භ ජාතකය',
    story: '',
    image: 'assets/stories/s498.jpg',
    tags: ['', 'Kumbha', 'කුම්භ', '498']);

final _tale499 = Tale(
    id: 499,
    title: 'ජයද්දිස ජාතකය',
    story: '',
    image: 'assets/stories/s499.jpg',
    tags: ['', 'Jayadissa', 'ජයද්දිස', '499']);

final _tale500 = Tale(
    id: 500,
    title: 'ඡද්දන්ත ජාතකය',
    story: '',
    image: 'assets/stories/s500.jpg',
    tags: ['', 'Chaddanta', 'ඡද්දන්ත', '500']);

final _tale501 = Tale(
    id: 501,
    title: 'සම්භව ජාතකය',
    story: '',
    image: 'assets/stories/s501.jpg',
    tags: ['', 'Sambawa', 'සම්භව', '501']);

final _tale502 = Tale(
    id: 502,
    title: 'මහාකපි ජාතකය',
    story: '',
    image: 'assets/stories/s502.jpg',
    tags: ['', 'Mahakapi', 'මහාකපි', '502']);

final _tale503 = Tale(
    id: 503,
    title: 'පණ්ඩනාග ජාතකය',
    story: '',
    image: 'assets/stories/s503.jpg',
    tags: ['', 'Pandanaga', 'පණ්ඩනාග', '503']);

final _tale504 = Tale(
    id: 504,
    title: 'සම්බුලා ජාතකය',
    story: '',
    image: 'assets/stories/s504.jpg',
    tags: ['', 'Sambula', 'සම්බුලා', '504']);

final _tale505 = Tale(
    id: 505,
    title: 'තන්ඩුලනාලි ජාතකය',
    story: '',
    image: 'assets/stories/s505.jpg',
    tags: ['', 'Thandulanali', 'තන්ඩුලනාලි', '505']);

final _tale506 = Tale(
    id: 506,
    title: 'තෙසකුන ජාතකය',
    story: '',
    image: 'assets/stories/s506.jpg',
    tags: ['', 'Thesakuna', 'තෙසකුන', '506']);

final _tale507 = Tale(
    id: 507,
    title: 'ශරභංග ජාතකය',
    story: '',
    image: 'assets/stories/s507.jpg',
    tags: ['', 'Sharabhanga', 'ශරභංග', '507']);

final _tale508 = Tale(
    id: 508,
    title: 'අලම්බුසා ජාතකය',
    story: '',
    image: 'assets/stories/s508.jpg',
    tags: ['', 'Alambusa', 'අලම්බුසා', '508']);

final _tale509 = Tale(
    id: 509,
    title: 'සංඛපාල ජාතකය',
    story: '',
    image: 'assets/stories/s509.jpg',
    tags: ['', 'Sankapala', 'සංඛපාල', '509']);

final _tale510 = Tale(
    id: 510,
    title: 'චුල්ල සුතසෝම ජාතකය',
    story: '',
    image: 'assets/stories/s510.jpg',
    tags: ['', 'Chulla Suthasoma', 'චුල්ල සුතසෝම', '510']);

final _tale511 = Tale(
    id: 511,
    title: 'නලිනී ජාතකය',
    story: '',
    image: 'assets/stories/s511.jpg',
    tags: ['', 'Nalini', 'නලිනී', '511']);

final _tale512 = Tale(
    id: 512,
    title: 'සෝනක ජාතකය',
    story: '',
    image: 'assets/stories/s512.jpg',
    tags: ['', 'Sonaka', 'සෝනක', '512']);

final _tale513 = Tale(
    id: 513,
    title: 'සංකිච්ච ජාතකය',
    story: '',
    image: 'assets/stories/s513.jpg',
    tags: ['', 'Sankichcha', 'සංකිච්ච', '513']);

final _tale514 = Tale(
    id: 514,
    title: 'කුස ජාතකය',
    story: '',
    image: 'assets/stories/s514.jpg',
    tags: ['', 'Kusa', 'කුස', '514']);

final _tale515 = Tale(
    id: 515,
    title: 'සෝණනන්ද ජාතකය',
    story: '',
    image: 'assets/stories/s515.jpg',
    tags: ['', 'Sonanannda', 'සෝණනන්ද', '515']);

final _tale516 = Tale(
    id: 516,
    title: 'චුල්ල හංස ජාතකය',
    story: '',
    image: 'assets/stories/s516.jpg',
    tags: ['', 'Chulla Hansa', 'චුල්ල හංස', '516']);

final _tale517 = Tale(
    id: 517,
    title: 'මහා හංස ජාතකය',
    story: '',
    image: 'assets/stories/s517.jpg',
    tags: ['', 'Maha Hansa', 'මහා හංස', '517']);

final _tale518 = Tale(
    id: 518,
    title: 'සුධාභොජන ජාතකය',
    story: '',
    image: 'assets/stories/s518.jpg',
    tags: ['', 'Sudhabojana', 'සුධාභොජන', '518']);

final _tale519 = Tale(
    id: 519,
    title: 'මහා කුනාල ජාතකය',
    story: '',
    image: 'assets/stories/s519.jpg',
    tags: ['', 'Maha Kunala', 'මහා කුනාල', '519']);

final _tale520 = Tale(
    id: 520,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s520.jpg',
    tags: ['', '', '', '520']);

final _tale521 = Tale(
    id: 521,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s521.jpg',
    tags: ['', '', '', '521']);

final _tale522 = Tale(
    id: 522,
    title: 'මහාජනක ජාතකය',
    story: '',
    image: 'assets/stories/s522.jpg',
    tags: ['', 'Maha Janaka', 'මහාජනක', '522']);

final _tale523 = Tale(
    id: 523,
    title: 'සාම ජාතකය',
    story: '',
    image: 'assets/stories/s523.jpg',
    tags: ['', 'Sama', 'සාම', '523']);

final _tale524 = Tale(
    id: 524,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s524.jpg',
    tags: ['', '', '', '524']);

final _tale525 = Tale(
    id: 525,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s525.jpg',
    tags: ['', '', '', '525']);

final _tale526 = Tale(
    id: 526,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s526.jpg',
    tags: ['', '', '', '526']);

final _tale527 = Tale(
    id: 527,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s527.jpg',
    tags: ['', '', '', '527']);

final _tale528 = Tale(
    id: 528,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s528.jpg',
    tags: ['', '', '', '528']);

final _tale529 = Tale(
    id: 529,
    title: 'ජාතකය',
    story: '',
    image: 'assets/stories/s529.jpg',
    tags: ['', '', '', '529']);

final _tale530 = Tale(
    id: 530,
    title: 'කකණ්ටක ජාතකය',
    story: '',
    image: 'assets/stories/s530.jpg',
    tags: ['', 'Kakantaka', 'කකණ්ටක', '530']);

final _tale531 = Tale(
    id: 531,
    title: 'භූරිපඤ්ඤ ජාතකය',
    story: '',
    image: 'assets/stories/s531.jpg',
    tags: ['', 'Buripanna', 'භූරිපඤ්ඤ', '531']);

final _tale532 = Tale(
    id: 532,
    title: 'සබ්බසංහාරක ජාතකය',
    story: '',
    image: 'assets/stories/s532.jpg',
    tags: ['', 'Sabba Sanharaka', 'සබ්බසංහාරක', '532']);

final _tale533 = Tale(
    id: 533,
    title: 'ගඳ්‍රභ ජාතකය',
    story: '',
    image: 'assets/stories/s533.jpg',
    tags: ['', 'Gadrabha', 'ගඳ්‍රභ', '533']);

final _tale534 = Tale(
    id: 534,
    title: 'අමරා දේවි ජාතකය',
    story: '',
    image: 'assets/stories/s534.jpg',
    tags: ['', 'Amara Dewi', 'අමරා දේවි', '534']);

final _tale535 = Tale(
    id: 535,
    title: 'දෙවතා පඤහ ජාතකය',
    story: '',
    image: 'assets/stories/s535.jpg',
    tags: ['', 'Dewata Pannaha', 'දෙවතා පඤහ', '535']);

final _tale536 = Tale(
    id: 536,
    title: 'ඛජ්ජෙිපනක ජාතකය',
    story: '',
    image: 'assets/stories/s536.jpg',
    tags: ['', 'Khajipanaka', 'ඛජ්ජෙිපනක', '536']);

final _tale537 = Tale(
    id: 537,
    title: 'දක රක්ඛස ජාතකය',
    story: '',
    image: 'assets/stories/s537.jpg',
    tags: ['', 'Daka Rakkhasa', 'දක රක්ඛස', '537']);

final _tale538 = Tale(
    id: 538,
    title: 'දහම්සොඬ ජාතකය',
    story: '',
    image: 'assets/stories/s538.jpg',
    tags: ['', 'Dahamsonda', 'දහම්සොඬ', '538']);

final _tale539 = Tale(
    id: 539,
    title: 'උම්මාදන්තී ජාතකය',
    story: '',
    image: 'assets/stories/s539.jpg',
    tags: ['', 'Ummadanthi', 'උම්මාදන්තී', '539']);

final _tale540 = Tale(
    id: 540,
    title: 'මහාබෝධි ජාතකය',
    story: '',
    image: 'assets/stories/s540.jpg',
    tags: ['', 'Mahabodhi', 'මහාබෝධි', '540']);

final _tale541 = Tale(
    id: 541,
    title: 'වෙස්සන්තර ජාතකය',
    story: '',
    image: 'assets/stories/s541.jpg',
    tags: ['', 'Wessanthara', 'වෙස්සන්තර', '541']);

final _tale542 = Tale(
    id: 542,
    title: 'අස්ථාන ජාතකය',
    story: '',
    image: 'assets/stories/s542.jpg',
    tags: ['', 'Asthana', 'අස්ථාන', '542']);

final _tale543 = Tale(
    id: 543,
    title: 'පක්ක ගොධ ජාතකය',
    story: '',
    image: 'assets/stories/s543.jpg',
    tags: ['', 'Pakka Godha', 'පක්ක ගොධ', '543']);

final _tale544 = Tale(
    id: 544,
    title: 'විතිය කොසිය ජාතකය',
    story: '',
    image: 'assets/stories/s544.jpg',
    tags: ['', 'Vithiya Kosiya', 'විතිය කොසිය', '544']);

final _tale545 = Tale(
    id: 545,
    title: 'සිහ කොත්ථුක ජාතකය',
    story: '',
    image: 'assets/stories/s545.jpg',
    tags: ['', 'Siha Koththuka', 'සිහ කොත්ථුක', '545']);

final _tale546 = Tale(
    id: 546,
    title: 'මෙණ්ඩක පඤ්හ ජාතකය',
    story: '',
    image: 'assets/stories/s546.jpg',
    tags: ['', 'Mendaka Pannaha', 'මෙණ්ඩක පඤ්හ', '546']);

final _tale547 = Tale(
    id: 547,
    title: 'කුම්භිල ජාතකය',
    story: '',
    image: 'assets/stories/s547.jpg',
    tags: ['', 'Kumhila', 'කුම්භිල', '547']);

final _tale548 = Tale(
    id: 548,
    title: 'කලන්දක ජාතකය',
    story: '',
    image: 'assets/stories/s548.jpg',
    tags: ['', 'Kalandaka', 'කලන්දක', '548']);

final _tale549 = Tale(
    id: 549,
    title: 'කොකාලික ජාතකය',
    story: '',
    image: 'assets/stories/s549.jpg',
    tags: ['', 'Kokalika', 'කොකාලික', '549']);

final _tale550 = Tale(
    id: 550,
    title: 'බ්‍රහ්මඉසි ජාතකය',
    story: '',
    image: 'assets/stories/s550.jpg',
    tags: ['', 'Brahmaisi', 'බ්‍රහ්මඉසි', '550']);

final List<Tale> tales = [
  _tale001,
  _tale002,
  _tale003,
  _tale004,
  _tale005,
  _tale006,
  _tale007,
  _tale008,
  _tale009,
  _tale010,
  _tale011,
  _tale012,
  _tale013,
  _tale014,
  _tale015,
  _tale016,
  _tale017,
  _tale018,
  _tale019,
  _tale020,
  _tale021,
  _tale022,
  _tale023,
  _tale024,
  _tale025,
  _tale026,
  _tale027,
  _tale028,
  _tale029,
  _tale030,
  _tale031,
  _tale032,
  _tale033,
  _tale034,
  _tale035,
  _tale036,
  _tale037,
  _tale038,
  _tale039,
  _tale040,
  _tale041,
  _tale042,
  _tale043,
  _tale044,
  _tale045,
  _tale046,
  _tale047,
  _tale048,
  _tale049,
  _tale050,
  _tale051,
  _tale052,
  _tale053,
  _tale054,
  _tale055,
  _tale056,
  _tale057,
  _tale058,
  _tale059,
  _tale060,
  _tale061,
  _tale062,
  _tale063,
  _tale064,
  _tale065,
  _tale066,
  _tale067,
  _tale068,
  _tale069,
  _tale070,
  _tale071,
  _tale072,
  _tale073,
  _tale074,
  _tale075,
  _tale076,
  _tale077,
  _tale078,
  _tale079,
  _tale080,
  _tale081,
  _tale082,
  _tale083,
  _tale084,
  _tale085,
  _tale086,
  _tale087,
  _tale088,
  _tale089,
  _tale090,
  _tale091,
  _tale092,
  _tale093,
  _tale094,
  _tale095,
  _tale096,
  _tale097,
  _tale098,
  _tale099,
  _tale100,
  _tale101,
  _tale102,
  _tale103,
  _tale104,
  _tale105,
  _tale106,
  _tale107,
  _tale108,
  _tale109,
  _tale110,
  _tale111,
  _tale112,
  _tale113,
  _tale114,
  _tale115,
  _tale116,
  _tale117,
  _tale118,
  _tale119,
  _tale120,
  _tale121,
  _tale122,
  _tale123,
  _tale124,
  _tale125,
  _tale126,
  _tale127,
  _tale128,
  _tale129,
  _tale130,
  _tale131,
  _tale132,
  _tale133,
  _tale134,
  _tale135,
  _tale136,
  _tale137,
  _tale138,
  _tale139,
  _tale140,
  _tale141,
  _tale142,
  _tale143,
  _tale144,
  _tale145,
  _tale146,
  _tale147,
  _tale148,
  _tale149,
  _tale150,
  _tale151,
  _tale152,
  _tale153,
  _tale154,
  _tale155,
  _tale156,
  _tale157,
  _tale158,
  _tale159,
  _tale160,
  _tale161,
  _tale162,
  _tale163,
  _tale164,
  _tale165,
  _tale166,
  _tale167,
  _tale168,
  _tale169,
  _tale170,
  _tale171,
  _tale172,
  _tale173,
  _tale174,
  _tale175,
  _tale176,
  _tale177,
  _tale178,
  _tale179,
  _tale180,
  _tale181,
  _tale182,
  _tale183,
  _tale184,
  _tale185,
  _tale186,
  _tale187,
  _tale188,
  _tale189,
  _tale190,
  _tale191,
  _tale192,
  _tale193,
  _tale194,
  _tale195,
  _tale196,
  _tale197,
  _tale198,
  _tale199,
  _tale200,
  _tale201,
  _tale202,
  _tale203,
  _tale204,
  _tale205,
  _tale206,
  _tale207,
  _tale208,
  _tale209,
  _tale210,
  _tale211,
  _tale212,
  _tale213,
  _tale214,
  _tale215,
  _tale216,
  _tale217,
  _tale218,
  _tale219,
  _tale220,
  _tale221,
  _tale222,
  _tale223,
  _tale224,
  _tale225,
  _tale226,
  _tale227,
  _tale228,
  _tale229,
  _tale230,
  _tale231,
  _tale232,
  _tale233,
  _tale234,
  _tale235,
  _tale236,
  _tale237,
  _tale238,
  _tale239,
  _tale240,
  _tale241,
  _tale242,
  _tale243,
  _tale244,
  _tale245,
  _tale246,
  _tale247,
  _tale248,
  _tale249,
  _tale250,
  _tale251,
  _tale252,
  _tale253,
  _tale254,
  _tale255,
  _tale256,
  _tale257,
  _tale258,
  _tale259,
  _tale260,
  _tale261,
  _tale262,
  _tale263,
  _tale264,
  _tale265,
  _tale266,
  _tale267,
  _tale268,
  _tale269,
  _tale270,
  _tale271,
  _tale272,
  _tale273,
  _tale274,
  _tale275,
  _tale276,
  _tale277,
  _tale278,
  _tale279,
  _tale280,
  _tale281,
  _tale282,
  _tale283,
  _tale284,
  _tale285,
  _tale286,
  _tale287,
  _tale288,
  _tale289,
  _tale290,
  _tale291,
  _tale292,
  _tale293,
  _tale294,
  _tale295,
  _tale296,
  _tale297,
  _tale298,
  _tale299,
  _tale300,
  _tale301,
  _tale302,
  _tale303,
  _tale304,
  _tale305,
  _tale306,
  _tale307,
  _tale308,
  _tale309,
  _tale310,
  _tale311,
  _tale312,
  _tale313,
  _tale314,
  _tale315,
  _tale316,
  _tale317,
  _tale318,
  _tale319,
  _tale320,
  _tale321,
  _tale322,
  _tale323,
  _tale324,
  _tale325,
  _tale326,
  _tale327,
  _tale328,
  _tale329,
  _tale330,
  _tale331,
  _tale332,
  _tale333,
  _tale334,
  _tale335,
  _tale336,
  _tale337,
  _tale338,
  _tale339,
  _tale340,
  _tale341,
  _tale342,
  _tale343,
  _tale344,
  _tale345,
  _tale346,
  _tale347,
  _tale348,
  _tale349,
  _tale350,
  _tale351,
  _tale352,
  _tale353,
  _tale354,
  _tale355,
  _tale356,
  _tale357,
  _tale358,
  _tale359,
  _tale360,
  _tale361,
  _tale362,
  _tale363,
  _tale364,
  _tale365,
  _tale366,
  _tale367,
  _tale368,
  _tale369,
  _tale370,
  _tale371,
  _tale372,
  _tale373,
  _tale374,
  _tale375,
  _tale376,
  _tale377,
  _tale378,
  _tale379,
  _tale380,
  _tale381,
  _tale382,
  _tale383,
  _tale384,
  _tale385,
  _tale386,
  _tale387,
  _tale388,
  _tale389,
  _tale390,
  _tale391,
  _tale392,
  _tale393,
  _tale394,
  _tale395,
  _tale396,
  _tale397,
  _tale398,
  _tale399,
  _tale400,
  _tale401,
  _tale402,
  _tale403,
  _tale404,
  _tale405,
  _tale406,
  _tale407,
  _tale408,
  _tale409,
  _tale410,
  _tale411,
  _tale412,
  _tale413,
  _tale414,
  _tale415,
  _tale416,
  _tale417,
  _tale418,
  _tale419,
  _tale420,
  _tale421,
  _tale422,
  _tale423,
  _tale424,
  _tale425,
  _tale426,
  _tale427,
  _tale428,
  _tale429,
  _tale430,
  _tale431,
  _tale432,
  _tale433,
  _tale434,
  _tale435,
  _tale436,
  _tale437,
  _tale438,
  _tale439,
  _tale440,
  _tale441,
  _tale442,
  _tale443,
  _tale444,
  _tale445,
  _tale446,
  _tale447,
  _tale448,
  _tale449,
  _tale450,
  _tale451,
  _tale452,
  _tale453,
  _tale454,
  _tale455,
  _tale456,
  _tale457,
  _tale458,
  _tale459,
  _tale460,
  _tale461,
  _tale462,
  _tale463,
  _tale464,
  _tale465,
  _tale466,
  _tale467,
  _tale468,
  _tale469,
  _tale470,
  _tale471,
  _tale472,
  _tale473,
  _tale474,
  _tale475,
  _tale476,
  _tale477,
  _tale478,
  _tale479,
  _tale480,
  _tale481,
  _tale482,
  _tale483,
  _tale484,
  _tale485,
  _tale486,
  _tale487,
  _tale488,
  _tale489,
  _tale490,
  _tale491,
  _tale492,
  _tale493,
  _tale494,
  _tale495,
  _tale496,
  _tale497,
  _tale498,
  _tale499,
  _tale500,
  _tale501,
  _tale502,
  _tale503,
  _tale504,
  _tale505,
  _tale506,
  _tale507,
  _tale508,
  _tale509,
  _tale510,
  _tale511,
  _tale512,
  _tale513,
  _tale514,
  _tale515,
  _tale516,
  _tale517,
  _tale518,
  _tale519,
  _tale520,
  _tale521,
  _tale522,
  _tale523,
  _tale524,
  _tale525,
  _tale526,
  _tale527,
  _tale528,
  _tale529,
  _tale530,
  _tale531,
  _tale532,
  _tale533,
  _tale534,
  _tale535,
  _tale536,
  _tale537,
  _tale538,
  _tale539,
  _tale540,
  _tale541,
  _tale542,
  _tale543,
  _tale544,
  _tale545,
  _tale546,
  _tale547,
  _tale548,
  _tale549,
  _tale550,
];

// Strings
final String constPansiyaPanas = "550";
final String constAppName = "ජාතක කතා";
final String constSearch = "සොයන්න";
final String constExit = "පිටවීම";
final String constYes = "ඔව්";
final String constNo = "නැත";
final String constExitConfirmMessage =
    "$constPansiyaPanas $constAppName තුලින් ඉවත්වීමට අවශ්‍යද ?";
final String constTtsLanguage = "si-LK";
final int constTtsMaxLength = 3999;
final double constShadowTextBlurRadius = 2;

// Colors
final Color constColorPrimary = Colors.amber;
final Color constColorSecondary = Colors.orange;
final Color constColorSplashNumberTitle = Color.fromARGB(255, 255, 191, 0);
final Color constColorSplashTextTitle = Color.fromARGB(255, 255, 0, 127);
final Color constColorDefaultText = Colors.white;
final Color constColorDefaultFill = Colors.white;
final Color constColorDefaultDisabled = Colors.grey;
final Color constColorIcon = Colors.white;
final Color constColorIconShadow = Colors.black;
final Color constColorTextShadow = Colors.black;
final Color constColorIconSplash = Colors.orange;
final Color constColorTransparent = Colors.transparent;

// Images
final AssetImage constWelcomeBackgroundImage =
    AssetImage("assets/lord-buddha.jpg");
final AssetImage constImageAppIcon = AssetImage("assets/buddha_baby.png");

// Font Sizes
final double constFontSizeTitle = 24;
final double constFontSizeTileIndex = 24;
final double constFontSizeTileTitle = 20;
final double constFontSizeStory = 16;
final double constFontSizeBody = 16;
const double constFontSizeStoryMax = 28;
const double constFontSizeStoryMin = 12;

// Border Sizes
final double constBorderRadius = 10;
final double constBorderWidth = 0.8;
final double constTextContentPadding = 10;
final double constIconSize = 20;
final double constPaddingSpace = 10;

// Lists, Arrays
List<Color> constColorsColourfulProgressBar = [
  Color.fromARGB(255, 0, 0, 255),
  Colors.yellow,
  Colors.red,
  Colors.white,
  Colors.orange
];

Map<String, double> fontSizeMap = <String, double>{
  "ඉතා සෙමෙන්": 0.6,
  "සෙමෙන්": 0.8,
  "සාමාන්‍ය": 1,
  "වේගයෙන්": 1.2,
  "ඉතා වේගයෙන්": 1.4
};

// Shadows
final Shadow constShadowTextUpRight = Shadow(
  offset: Offset(1.0, 1.5),
  blurRadius: constShadowTextBlurRadius,
  color: constColorTextShadow,
);
final Shadow constShadowTextDownRight = Shadow(
  offset: Offset(1.0, -1.5),
  blurRadius: constShadowTextBlurRadius,
  color: constColorTextShadow,
);
final Shadow constShadowTextDownLeft = Shadow(
  offset: Offset(-1.0, -1.5),
  blurRadius: constShadowTextBlurRadius,
  color: constColorTextShadow,
);
final Shadow constShadowTextUpLeft = Shadow(
  offset: Offset(-1.0, 1.5),
  blurRadius: constShadowTextBlurRadius,
  color: constColorTextShadow,
);
final List<Shadow> constDefaultTextShadow = <Shadow>[
  constShadowTextDownLeft,
  constShadowTextDownRight,
  constShadowTextUpRight,
  constShadowTextUpLeft
];
